{
  "title": "EPOC: Burn calories even after leaving the gym",
  "url": "https://blog.ultrahuman.com/blog/epoc-burn-calories-even-after-leaving-gym-2/",
  "category": "entrainement",
  "content": "Your body continues to burn calories even after you're done exercising. This process is called excess post-exercise oxygen consumption (EPOC), also known as the \"afterburn effect.\"\n\nLet's understand how it ties into the process of metabolism, specifically the aerobic and anaerobic pathways, and how it benefits your body.\n\nHighlights\n\n- Adenosine triphosphate (ATP) is produced either with oxygen using the aerobic pathways or without oxygen relying on the anaerobic pathways\n- The body stores energy as fat for efficiency. It essentially responds to excess post-exercise oxygen consumption (EPOC) by freeing up fatty acids in the bloodstream.\n\nATP Production: Aerobic and Anaerobic Pathways\n\nMetabolism is a series of chemical processes that take place in each cell, transforming the calories we eat into fuel to keep us alive.\n\nThese processes sustain life, and everyday functioning, and include breaking down food and drink for energy and building or repairing our bodies. It is also the process that produces adenosine triphosphate (ATP) from consumed nutrients. ATP is used as muscular fuel by the body during exercise.\n\nATP is produced either with oxygen using the aerobic pathways or without oxygen relying on the anaerobic pathways. When you first start to exercise, your body uses the anaerobic energy pathways and stored ATP to fuel that activity.\n\nA proper warm-up is important because it can take about five to eight minutes to be able to efficiently use aerobic metabolism to produce the ATP necessary to sustain physical activity.\n\nOnce a steady state of oxygen consumption is achieved, the aerobic energy pathways are able to provide most of the ATP needed for the workout.\n\nExercise that places a greater demand on the anaerobic energy pathways during the workout can increase the need for oxygen after the workout, thereby enhancing the EPOC effect.\n\nWhat is EPOC/Afterburn effect?\n\nThe process of consuming oxygen at an increased rate for the body to recover from or rest after intense exercises is called excess post-exercise oxygen consumption (EPOC). This resting state is called homeostasis. While studies around EPOC are often contradictory or inconclusive, some can make the case for EPOC or 'afterburn' as the body reaches homeostasis.\n\nThis takes place from increased oxygen consumption for around 3 to 72 hours after an intense session of exercise. It is further identified that \"EPOC replenishes between 6 and 15%\" of the total oxygen spent by the body on exercise. The EPOC process also carries the benefit of the body consuming more energy or fuel, hence the term 'afterburn', which means to continue to burn fuel after one has finished exercising.\n\nEPOC effect on Your Body\n\nThe body stores energy as fat for efficiency. It essentially responds to excess post-exercise oxygen consumption (EPOC) by freeing up fatty acids in the bloodstream. In different studies, it has been established that:\n\n1. The rate at which fatty acids (FA) are utilized by the body increases after the post-exercise recovery period. Further, the intensity of this fatty acid utilization rate is affected by both \"the length as well as the intensity of the exercise\"\n\n2. Research \"suggests that resting energy consumed by the body the morning after intense exercise can be significantly higher than on days that do not follow intense exercise.\"\n\nAs a result, any intense exercise triggers energy expenditure as well as lipid oxidation for a prolonged period.\n\nIn a study of 7 men in good health, participants carried out resistance training for about 30 minutes. Oxygen consumption from the experiment indicated that \"EPOC in the body could continue to occur well past 16 hours following strenuous exercise.\"\n\nHowever, EPOC duration can be as short as 15 minutes. It also occurs in people based on their general fitness levels and may not be equally beneficial to all.\n\nThere are various benefits to the body from EPOC, occurring over the course of the duration of its effect. Primarily, these are:\n\nMore calories burnt without excess effort\n\nA 2015 study published in 'The Journal of Strength and Conditioning Research shows that people undertaking exercises like high-intensity interval training (HIIT) can \"burn more calories than those who spend similar amounts of time undertaking steady-state exercises.\"\n\nQuicker workouts\n\nDespite less time spent on working out using HIIT methods, the EPOC generated through increased exercise intensity allows for \"more calories to be burned in less time.\"\n\nPotential weight loss\n\nA 2017 review published in 'Obesity Reviews' details that three sessions of HIIT could have \"as much impact on the reduction of fat, mass, and waist size\" in those with excess weight as steady-state exercise or training.\n\nImproved sports performance\n\nA 2016 experiment on well-trained rowers concluded that HIIT carried out over eight weeks at a maximized peak power output (PPO) had higher effectiveness than long slow distance (LSD) training on \"improving rowing performance as well as athletic abilities\" like oxygen uptake and power output at maximum oxygen uptake levels.\n\nOxygen carries out a variety of functions in the body after exercise. It can replenish the ATP consumed by exercise, as well as restore oxygen count across venous blood, skeletal muscle blood, and myoglobin.\n\nIt can stabilize the temperature of the body as it reaches a state of rest, also called homeostasis. It can also combine with protein to restore any damaged or worn out muscle tissue from the workout.\n\nFurther, EPOC aids in the removal of lactate, as well as \"catalyzes the resynthesis of phosphocreatine.\" Lactate removal prevents a disruptive impact on metabolic processes. After a period of lactate concentration either the levels of concentration, or the hydrogen accompanying such levels of lactate concentration begin to have an impact on muscular contraction.\n\nThis prevents the way such a muscle can function to perform exercises with intense, short bursts like HIIT. The resynthesis of phosphocreatine is essential, as it is the \"first available reserve of ATP.\" Intense exercise may dilute its potency to as low as 30% when compared to the levels found at resting levels.\n\nTypes of Exercise that Extract EPOC Effect\n\nExcess post-exercise oxygen consumption (EPOC) has been shown to depend on the \"duration and intensity of the exercise.\"\n\nWhile exercise duration has a linear effect on EPOC, some evidence also indicates an exponential relationship between EPOC and the intensity of the exercise for certain durations.\n\nAn extended EPOC of between 3 and 24 hours can result from certain exercise metrics, indicated to be between 50 minutes or under for 70% or higher VO2max (the maximum rate of oxygen consumption) and 6 minutes and under for 105% or higher VO2max.\n\nThere is some evidence of resistance training proving to have a \"more sustainable EPOC effect.\"\n\nConsidering the following facts, some exercises are more suited to unlock EPOC in us:\n\n1. There is some evidence that resistance or strength training can unlock \"up to 72 hours of EPOC effects\" in people under certain conditions of set repetition.\n\n2. \"30-minute cycling routines\" with elements of interval training and sprints that intersperse 30-second pace bursts with periods of recovery.\n\n3. Plyometrics, i.e., a range of exercise jumps designed to maintain and build power and swimming in \"altering bursts of pace sprints and recovery.\"\n\n4. Essentially all workouts which \"carry high-intensity interval training (HIIT) principles\" can unlock the effects of EPOC on those performing them.\n\nConclusion\n\nThe human body could continue consuming and burning calories as it recovers from intense exercises. This process, called excess post-exercise oxygen consumption (EPOC), is informally known as the \"afterburn effect.\"\n\nIt affects exercise energy availability through ATP production by aerobic and anaerobic means or pathways. The impact of EPOC depends more on the intensity of an exercise than on the duration of it.\n\nSome of the earlier research on EPOC has been less conclusive. However, newer research indicates that exercises of intensity carried out over a short period of time by people with good fitness levels can produce a substantial calorie burning impact.\n\nThis takes place through the body consuming excess amounts of oxygen as it reaches a resting state or homeostasis.\n\nThere are also additional physiological benefits to this process that impact muscles and nutrients in the bloodstream. You can unlock EPOC through a range of exercises that follow high-intensity interval training (HIIT) principles.\n\nAuthor: Sarvesh Talreja\nPublished: November 2, 2022\nCategory: Exercise",
  "charCount": 7592
}
