{
  "title": "IIFYM Explained: How It Works and What to Eat",
  "url": "https://blog.ultrahuman.com/blog/what-is-iifym-diet/",
  "category": "nutrition",
  "content": "IIFYM Explained: How It Works and What to Eat\n\nArticle by Abhay Puri | June 20, 2025\n\nOverview\n\nIIFYM, an acronym meaning \"If It Fits Your Macros,\" represents a flexible dietary approach that has gained traction in fitness communities. Rather than eliminating food groups or strictly counting calories, this method emphasizes meeting daily macronutrient targets. Fitness coach Anthony Collova popularized the approach, which focuses on tracking protein, carbohydrates, and fat intake.\n\nHow to Follow IIFYM\n\nCalculating Your Macros\n\nThe process involves four steps:\n\n1. Determine BMR: Calculate your basal metabolic rate using age, gender, height, weight, and body-fat percentage—the calories your body burns at rest.\n\n2. Adjust for Activity: Multiply BMR by an activity factor to establish Total Daily Energy Expenditure (TDEE).\n\n3. Set Goals: For weight loss, reduce TDEE by 10–25%. For weight gain, increase it by 5–15%.\n\n4. Establish Macro Targets: Protein should be \"0.7–1g per pound of body weight.\"\n\nOnline macro calculators automate these calculations. Success requires daily tracking using food-logging apps or digital scales to maintain accuracy.\n\nWhat to Eat on IIFYM\n\nThe diet permits all foods without restrictions, though nutrient-dense choices facilitate goal achievement. Protein sources include meats, dairy, eggs, legumes, nuts, and seafood. Healthy fats derive from avocados, nuts, fatty fish, and olive oil. Carbohydrates come from fruits, vegetables, grains, and cereals.\n\nWhile flexibility permits occasional indulgences, prioritizing whole foods enhances satiety and overall health outcomes.\n\nAdvantages\n\n- Flexibility: No forbidden foods promote consistency and adherence\n- Educational value: Builds awareness of food composition and portions\n- Customization: Adapts to fat loss, muscle gain, or maintenance goals\n- PCOS support: Some evidence suggests macro-balanced, higher-protein approaches may assist women with PCOS\n- Accessibility: Accommodates individuals with limited mobility\n\nDisadvantages\n\n1. Micronutrient gaps: The macro focus may neglect essential vitamins and minerals\n2. Limited health condition accommodation: Individuals with diabetes or kidney issues may require modifications\n3. Insufficient research: While macro-based diets show benefits, IIFYM lacks robust peer-reviewed validation\n4. Disordered eating risk: Obsessive tracking may exacerbate food anxiety, particularly among vulnerable populations\n\nConclusion\n\nIIFYM offers an effective, less restrictive weight management approach emphasizing awareness and consistency over rigid rules. However, long-term success requires combining it with adequate sleep, physical activity, micronutrient attention, and healthy eating patterns. Those with underlying health conditions or disordered eating histories should consult healthcare providers before beginning.",
  "charCount": 2468
}
