{
  "title": "How palm cooling improves physical performance",
  "url": "https://blog.ultrahuman.com/blog/cold-hands-does-this-improve-performance/",
  "category": "entrainement",
  "content": "The human body performs best within a narrow temperature range. Even small deviations, especially increases in core temperature during exercise, can compromise performance by disrupting cellular energy production.\n\nOne emerging strategy to counteract this: palm cooling.\n\nWhy thermoregulation matters\n\nDuring physical activity, your body temperature rises. Once muscle temperature crosses 40°C, enzyme function begins to shut down. One critical enzyme affected is Pyruvate Kinase (PK), which is essential for producing ATP, the energy source for muscle contraction. When PK is inhibited, muscles can no longer generate force efficiently.\n\nThis isn't just theory. Cooling the body, specifically the palms, has been shown to:\n\n- Reactivate enzyme activity\n- Improve energy production\n- Delay muscle fatigue\n- Enhance strength output\n- Reduce delayed onset muscle soreness (DOMS)\n\nWhy the palms?\n\nNot all skin is created equal when it comes to heat loss.\n\nGlabrous skin, found on the palms, soles, and upper face, is uniquely suited to dissipating heat. These areas are rich in arteriovenous anastomoses (AVAs), which allow large volumes of blood to bypass capillaries and flow directly from arteries to veins, accelerating thermal exchange.\n\nTargeting these areas allows the body to \"dump\" heat more effectively—especially through the palms, which are easy to access during workouts.\n\nPalm cooling is already being used by elite athletes, the military, and NFL teams to improve output and recovery. And it's supported by good scientific research:\n\nStudy 1: Bench Press After Running\n\nEight subjects ran on a treadmill in a hot environment until their core body temperature reached 39°C. They then performed 4 sets of barbell bench press (40% 1RM), with 3 minutes rest between sets.\n\n- Without cooling: 36 total reps across 4 sets\n- With palm cooling (15–16°C water perfusion device): 42 total reps\n- Core temperature dropped to 38.4°C\n\nA modest drop in core temperature led to six additional reps, purely due to palm cooling.\n\nStudy 2: Pull-Ups Over Six Weeks\n\nTwo groups trained with 10 sets of pull-ups until failure, 3 minutes rest between sets:\n\n- Palm-cooled group: +13 reps per session\n- Control group: +6 reps per session\n\nHow to implement palm cooling into your routine\n\nWhile commercial palm-cooling devices are still in early stages of development, it's possible to replicate the core benefit using simple, accessible tools.\n\nA practical approach is to use a cooling pack during rest intervals between sets. The temperature sweet spot is 15–16°C—cool enough to lower core temperature effectively, but not so cold that it triggers vasoconstriction, which can actually hinder heat loss by narrowing blood vessels.\n\nWhat matters most is consistency and timing. Cooling should happen during rest—not mid-rep or while actively training. Short, targeted cooling windows allow muscles to recover enzymatic function and maintain force output without disrupting workout flow.\n\nSummary\n\nPalm cooling is a science-supported technique that enhances physical performance by helping regulate core and muscle temperature. It has been shown to improve endurance, prevent the temperature-induced shutdown of enzymes critical for energy production, reduce muscle soreness, and accelerate recovery. By lowering perceived exertion, it also enables individuals to push further and train more effectively.",
  "charCount": 3247
}
