{
  "title": "14 Benefits Of Good Posture And How To Fix Bad Posture",
  "url": "https://blog.ultrahuman.com/blog/14-benefits-of-good-posture-and-how-to-fix-bad-posture/",
  "category": "entrainement",
  "content": "We've all been told to \"sit up straight\" or \"walk tall\" since we were children. Everyone, from our relatives to influencers on social media, talks about the importance of having good posture, but very little effort is made to truly understand our own posture in order to improve it. Working long hours and standing or sitting endlessly have exacerbated this problem.\n\nOver time, bad posture can manifest in different aches and pains in the body. So how do you know what good posture is? Why is it important to even have good posture, and is it something you can correct? Let's focus on these aspects and learn more.\n\nHighlights\n\n- Proper posture ensures proper alignment of bones and joints, decreasing wear and tear of the supportive structures\n- Good posture helps reduce back, neck and shoulder pain while improving digestion, increasing lung capacity and instilling confidence\n- Bad posture may lead to urinary incontinence, constipation and heartburn\n\nWhat are posture and good posture?\n\nTo begin with, it is imperative to understand what posture and good posture mean. Posture, in simple terms, is how the body is aligned while sitting, standing or lying down. This could be in an active or inactive state. It more specifically refers to the position of the spine in these states. Every human being has a natural curve in their upper (cervical), middle (thoracic) and lower (lumbar) spine.\n\nThese curves need to be maintained, which means that they should not go beyond or below their normal range so that the spine can hold the body up without putting excess strain on the support structures—muscles, bones and ligaments—of the body. This maintenance happens when the muscles surrounding the spine are strong, thereby balancing and supporting the body equally.\n\nThere are two types of postures:\n\n1. Static posture:\n\nThis is how the body holds itself when it is stationary; for example, while standing, sitting or lying down.\n\n2. Dynamic posture:\n\nThis is how the body holds itself when it is in a state of motion, such as while walking, running and swimming.\n\nGood posture while sitting down is when your feet are touching the floor, there is equal weight or pressure on both sides of your hips, your back is straight (maintaining the natural curves), your shoulders are back and relaxed, and your chin is parallel to the floor, and your ears line up with your collarbone.\n\nWhile standing, however, there should be a slight bend in the knees, your ears should be aligned with your shoulders, your chin should be parallel to the floor, your shoulders should align with your hips, and your weight should be evenly distributed between the two feet.\n\nProper posture ensures proper alignment of bones and joints, decreasing wear and tear of the supportive structures.\n\nImportance of good posture\n\nHealth benefits of good posture\n\nGood posture can have a multitude of benefits for the human body:\n\n1. Reduces back pain:\n\nIncorrect posture is the leading cause of lower back pain, affecting more than 25% of the workforce every year. Slouching and/or prolonged periods of sitting can put excessive pressure on the intervertebral discs, facet joints, ligaments and muscles present in and around the spine.\n\nThe gluteal (muscles of the hips) and abdominal muscles (muscles between the ribs and pelvis) become dormant because of prolonged sitting and eventually fail to support the spine and its supporting structures. It is, therefore, important to strengthen these muscles regularly to prevent pain.\n\n2. Improves muscle and joint function:\n\nGood posture is a catalyst for the proper functioning of the joints and muscles of the body. It helps avoid any excess strain on the ligaments, tendons, muscles and joints, avoiding abnormal wear and tear of the muscles. A common problem seen with improper posture is easy osteoarthritis—when the cartilage that acts as a cushion at the end of the bone wears out over time.\n\nAlthough age and genetics play a role, there is an increased risk of developing osteoarthritis without good posture. Therefore, good posture can help prevent the early degeneration of muscles and bones.\n\n3. Improves mood:\n\nWhen the spine is aligned, the lungs can expand to their maximum potential. This increased oxygenation and blood flow to the organs increases energy levels and helps activate the parasympathetic nervous system (associated with the body's rest and digest function), thereby reducing the stress hormone cortisol and triggering a relaxation response in the body.\n\nAdditionally, sitting upright can instantly improve the mood. The body's posture is instantly impacted when your mood is low, but the converse is also true. You can instantly make yourself feel better by just sitting upright.\n\n4. Keeps spine healthy:\n\nGood posture is a simple way to keep your spine and its supporting structures healthy as you age. Proper alignment improves blood flow and tones (the process of expansion and contraction) of the blood vessels and nerves, keeping them healthy along with your muscles, joints, ligaments and tendons.\n\n5. Reduces headaches:\n\nBad posture can cause headaches due to tension in the muscles in and around the neck. These often manifest as tension headaches. Simple stretching of the neck reduces muscle tension and alleviates headaches. Keeping good posture, i.e., ensuring that the neck is aligned with the shoulders, can prevent the onset of such headaches.\n\n6. Ensures high energy levels:\n\nWhen muscles and joints are aligned and used properly, the chances of fatigue or overuse of muscles are rare. This also enables the body to use the right muscles, ensuring that other muscles don't have to work extra to get the same results.\n\nAdditionally, good posture enables the lungs to expand to their maximum, contracting the diaphragm. This increased oxygenation and blood flow increase the energy levels in the body.\n\n7. Relieves tension from neck and shoulders:\n\nMuscles around the neck and shoulders tend to get tight, especially if they're overused or are stiff for long. Prolonged work hours without any movement can lead to a stiff neck and shoulders, straining the muscles, joints and ligaments in and around the neck.\n\nWith corrective exercises and proper usage, the chances of overuse and straining the muscles are slim. Maintaining good posture can ensure muscles don't reach the point of strain and are strong enough to support themselves.\n\n8. Improves lung capacity:\n\nSlouching compresses the lungs, reducing the strength of the diaphragm. Studies have demonstrated that a slouched position reduces the diaphragm strength when measured against a neutral spine (straight spine with its natural curves) position.\n\nWhen the spine remains in its neutral form, the lungs have space to expand to their maximum, contracting the diaphragm and increasing its strength. This leads to increased oxygenation, stronger lungs and a stronger diaphragm.\n\n9. Aids circulation and digestion:\n\nSlouching compresses not only the lungs but also all other internal organs. When this happens, the blood circulation to these organs reduces, impairing digestion. Efficient breathing also improves digestion because of increased blood flow. When the posture is upright, efficient breathing becomes easy, and blood circulation and digestion improve.\n\n10. Reduces TMJ pain:\n\nThe temporomandibular joint (TMJ) is a joint that connects the skull to the jaw. It is present on both sides of the head to ensure ease of movement for the jaw. When there is a misalignment, i.e., when the head moves forward and ahead of its usual position, the muscles around the TMJ get strained, impairing the jaw's ability to function smoothly.\n\nChewing, talking and yawning become difficult. This can also cause headaches. Since good posture includes keeping the ears and head in line with the shoulders, it can prevent any TMJ-related issues and reduce the onset of any pain associated with it.\n\n11. Strengthens core and scapula:\n\nMaintaining good posture requires the muscles supporting your spine to function efficiently. The converse is also true. If you maintain the neutral position of the spine, the muscles around it will automatically remain strong. This means the core (abdominal muscles) and the upper back muscles, including the muscles around the scapula (shoulder blade), remain strong.\n\n12. Improves workout form:\n\nAs mentioned earlier, good posture is not only necessary when you are in a static position but also in dynamic movements. This includes maintaining good posture while working out. Good posture in static form translates to good posture in movement as well.\n\nAlthough this may not always be true, it is more likely for your posture to be good even while working out if your natural posture is good because the muscles are already strong and have to work less hard. If you slouch, this bad posture will permeate into your workouts, leading to more injuries.\n\n13. Makes you appear taller:\n\nGood posture gives the body a taller appearance. It also gives the torso a slimmer or toned appearance.\n\n14. Instils confidence:\n\nResearch shows that people who sit up straight are more likely to believe in themselves and their qualifications than people who don't. Sitting up tall boosts mood, alleviates pain, increases energy, and instils confidence. Sitting or standing tall also improves breathing, which ultimately helps reduce stress and induce a sense of calm.\n\nEffects/risks of bad posture:\n\nWhile there are fairly obvious woes associated with bad posture, there are some subtle health risks that go undiagnosed:\n\n1. Urinary incontinence:\n\nUrinary incontinence is the loss of bladder control which can be triggered by laughing, coughing or sneezing. Poor posture compresses the bladder, weakening the muscles around the pelvis. Over time, the muscles lose their ability to hold pressure.\n\n2. Constipation:\n\nDry stools, hard stools, straining to move the bowels and a sense of incomplete evacuation of bowels are all considered constipation. Poor posture—knees above the hips, especially on the toilet—can cause constipation because it closes the anus muscles, making it more difficult to evacuate faecal matter.\n\n3. Heartburn caused by acid reflux:\n\nSlouching can put immense pressure on the abdominal muscles, causing the acids from the stomach to flow in the opposite direction. This causes heartburn, especially after a meal.\n\nHow can you correct your posture?\n\nThere are many simple ways to improve your posture:\n\n1. Being more mindful:\n\nThe easiest way to improve your posture is to catch bad posture before it adversely impacts other parts of your body. Be mindful of how you're sitting or standing when you wash the dishes, watch television, text or walk.\n\n2. Staying active:\n\nStaying active is another imperative step toward good posture. Most physical activities focus on keeping the body upright or in a good position. Additionally, it's generally good practice to do exercises that strengthen your abdominal muscles and help strengthen the spine eventually. Activities such as yoga, tai chi and strength and conditioning can help you become more aware of your body and its movements.\n\n3. Maintaining a healthy weight:\n\nExtra weight around the abdomen can cause problems in the pelvis and spine. Therefore, shedding extra weight and strengthening the abdomen can help correct your posture.\n\n4. Wearing comfortable shoes:\n\nBad footwear, particularly heels, can change your posture and make you walk differently. In the long run, this can recruit incorrect muscles for static or dynamic movements, putting unnecessary stress on certain muscles, bones and ligaments. Wearing low-heeled shoes or even zero-drop (no heel shoes) can help strengthen the right muscles and prevent excess strain on the other ones.\n\n5. Ensuring surfaces are of apt height:\n\nWhether it is your work desk, dining table or kitchen counter, ensure the height of these surfaces is appropriate for you so that you don't have to slouch whenever you are working or doing chores.\n\n6. Making small changes while sitting:\n\nSitting is a big contributor to bad posture. While sitting, ensure your feet touch the ground, you switch positions often, take a walk now and then and relax your shoulders.\n\n7. Sleeping correctly:\n\nSleeping on a bad mattress can alter your posture. A hard mattress that allows your spine to retain its curves is ideal for good sleep and posture. If you sleep on your sides, keep the knees slightly bent but don't hug them. Ensure your neck is at the same height as your spine. Using a thin pillow under the neck is ideal if you sleep on your back.\n\n8. Driving with good posture:\n\nWhile driving, ensure you sit up straight and have a slight bend in the knees which, in turn, should be at the same height as the hip or slightly higher.\n\nExercises for good posture\n\nWhether you suffer from bad posture or you just generally want to ensure you have good posture, there are a few exercises that can help you ensure your posture remains rock solid:\n\n1. Single-leg extensions:\n\nSingle leg extensions work on stabilizing your core and pelvic floor muscles.\n\nHow to do it:\n\n- Lie down on your back with your knees bent and feet on the floor.\n- Place your hands behind your head, curl your head in and press your lower back into the floor.\n- Pull in the belly button towards your spine as you exhale.\n- Keeping the back pressed into the mat, pull one knee in towards the chest and extend your other leg at a 45-degree angle to the mat.\n- Switch legs. That completes 1 repetition. Repeat for 5-10 rounds without arching the lower back.\n\n2. Supine marching:\n\nSupine marching helps control the pelvic floor muscles and the abdomen, strengthening and toning them.\n\nHow to do it:\n\n- Lie down on your back, keeping your knees bent at a 90-degree angle in a tabletop position and your arms beside the body.\n- Keeping the knees bent, bring one heel to the floor.\n- Bring the foot back and repeat the same with the other leg. This completes 1 repetition. You can do 5-10 repetitions.\n\n3. Dead bug:\n\nDead bugs work the core muscles, including the transverse abdominis situated deep inside the abdominal muscles and the erector spinae muscles that help stabilize the spine and the glutes. They also add to your hip and shoulder mobility.\n\nHow to do it:\n\n- Lie down on your back with your arms pointing towards the ceiling and your knees bent in a tabletop position at a 90-degree angle.\n- Slowly extend your right leg while simultaneously extending the left arm overhead. Keep your arm and leg a few inches above the floor.\n- Keep your core (abdominal muscles) and your butt engaged the entire time.\n- Bring this arm and leg back and then switch sides to complete 1 repetition of these exercises. You can do 5-10 repetitions of these.\n\n4. Bird dog:\n\nThis is another excellent exercise to stabilize and strengthen the pelvis and core while also strengthening the lower back and glutes.\n\nHow to do it:\n\n- Start in a tabletop position with your wrists under your shoulders and knees under the hips.\n- Extend your right arm forward and your left leg back.\n- Bring them back and do the other side to complete 1 repetition of this exercise. You can do 5-10 repetitions.\n- Make sure to squeeze your abs and maintain the position of the spine while moving.\n\n5. Kneeling glute hinge:\n\nKneeling glute hinges are a great way to stabilize the pelvis, engaging the core and glute muscles. This movement forms the basis and foundation of squats and deadlifts.\n\nHow to do it:\n\n- Kneel with knees at hip distance, feet apart, toes on the floor, chest upright and abdominal muscles (core) engaged.\n- Hold a dumbbell to your chest with both hands.\n- Keep the glute and core muscles engaged.\n- Push your hips back so that they go towards your heels and your upper body hinges forward.\n- Once the hips touch the heels, come back up the same way, engaging the core and glute muscles (squeeze the hips). This entire move is 1 repetition. Repeat it 5-10 times.\n\n6. Dumbbell halo:\n\nDumbbell halo is a great exercise for stabilizing the mid-back, core and pelvis.\n\nHow to do it:\n\n- Kneel with knees at hip distance, feet apart, toes on the floor, chest upright and abdominal muscles (core) engaged.\n- Hold a dumbbell to the chest with both hands.\n- Lift the dumbbell to eye level and circle it around your head like a halo, clockwise and anti-clockwise. Repeat this 10 times.\n\n7. Farmer's carry:\n\nFarmer's carry works well for the shoulders, core muscles and your grip strength. It helps maintain good posture in movement while your body is carrying weight.\n\nHow to do it:\n\n- Place a dumbbell each on either side of your feet.\n- Squat down to pick up the weights with your grips facing inward.\n- Keep the chest upright, tighten the core muscles and stand up.\n- With this upright position and braced core, walk forward. Ensure you don't slouch at any point and allow for a neutral spine.\n- Walk up and down the room and, when you are done, keep the weights back down the same way.\n- Repeat this for 5-7 lengths, one length being walking to and fro.\n\n8. High knees march:\n\nHigh knees are a good way to ensure your body remains in good posture even while walking. It helps the body learn how to brace the core, hip flexors and glute muscles in movement.\n\nHow to do it:\n\n- Stand tall with your feet at hip-width distance, your arms bent at a 90-degree angle and out in front of you.\n- Keeping your chest upright and your core muscles engaged, pick up one knee at a time to touch your palm and take it back.\n- Repeat this 5-10 times on each side\n\n9. Cobra pose:\n\nCobra pose helps strengthen the erector spinae muscles and other lower back muscles.\n\nHow to do it:\n\n- Lie down on your stomach with your palms beside your chest, close to the ribs.\n- Extend your legs straight behind you, placing the tops of your feet onto the mat.\n- Pull the abdominal muscles in as you exhale and lift the chest, trying to utilize your spine muscles instead of your hands.\n- Keep your hip bones on the floor and your shoulders tucked away from your ears. Repeat this 3-5 times.\n\n10. Plank pose:\n\nPlanks strengthen your obliques (sides of your waist), transverse abdominis, shoulders and spine muscles.\n\nHow to do it:\n\n- Place your hands and knees on the mat with your wrist underneath your shoulders.\n- Straighten the legs and tuck your toes under like you would for a pushup.\n- Pull your abdominal muscles in and gaze at the floor.\n- Hold this pose for anywhere between 15 seconds to a minute. You can build it up to more eventually.\n\nConclusion\n\nGood posture is crucial for overall health and well-being. When the body is well aligned, it can have immense benefits on your physical and psychological well-being. Good posture helps reduce back, neck and shoulder pain while improving digestion, increasing lung capacity and instilling confidence. When the posture is bad, it can have serious health implications such as urinary incontinence, constipation and heartburn.\n\nMaking tiny changes—the position you sit in, how often you walk around, adopting a good sleeping posture and wearing comfortable shoes—are just some of the many ways to correct your posture. Exercises such as bird dog, dumbbell halo, high knees, farmer's carry and cobra pose can help the body to not only prevent bad posture but maintain good posture as well.\n\nDisclaimer:\n\nThe contents of this article are for general information and educational purposes only. It neither provides any medical advice nor intends to substitute professional medical opinion on the treatment, diagnosis, prevention or alleviation of any disease, disorder or disability. Always consult with your doctor or qualified healthcare professional about your health condition and/or concerns and before undertaking a new healthcare regimen including making any dietary or lifestyle changes.",
  "charCount": 16688
}
