{
  "title": "Running vs weight lifting – which one should you pick?",
  "url": "https://blog.ultrahuman.com/blog/running-vs-lifting-which-one-should-you-pick/",
  "category": "entrainement",
  "content": "If you're looking to supercharge your fitness journey, deciding between running vs. strength training and weights is a tough choice.\n\nConventional wisdom says that running is more beneficial for shredding fat – and running is really good for you. But evidence shows that strength training also comes with more benefits than simply bulking up – and could still shred fat and boost heart health.\n\nEach form of exercise comes with benefits and has distinct advantages. But here's how they compare.\n\nHighlights:\n\n- Metabolism is the process by which the body converts food into energy to fuel our needs and is improved by both running and lifting.\n- Studies have found that running is more effective for decreasing overall body weight and fat mass than strength training – and it burns more calories.\n- Strength training can boost your metabolism and shred fat because muscle burns more energy at rest.\n- Both running and lifting have been linked to positive heart health outcomes.\n\nBoosting metabolism\n\nMetabolism is the body's process of generating the energy it needs to function. While diet, sleep, and genetics play a vital role in basal metabolic rate, exercise keeps it firing efficiently.\n\nRunning and lifting impact metabolism differently. Cardio (like running) primarily increases calorie burn during exercise, while strength training (lifting) boosts resting metabolism by building muscle, which burns more calories at rest.\n\nFibroblast growth factor 21 (FGF21) is a metabolic hormone that plays a key role in regulating energy balance, glucose metabolism, and fat burning. It has been linked to various health benefits, including improved insulin sensitivity and enhanced metabolic function.\n\nA study conducted by researchers at the University of Copenhagen examined how different types of exercise influence FGF21 levels.\n\nThey found that both endurance training (such as running) and strength training stimulate the production of this hormone. However, endurance training led to a significantly greater increase in FGF21 levels compared to strength training, suggesting that prolonged aerobic activity may have a stronger impact on metabolic health.\n\nDoes that mean that strength training doesn't increase your metabolism? Strength training is known to increase muscle mass or help maintain it. The higher the amount of muscle in your body, and the lesser the amount of fat, the higher your metabolic rate, as muscle uses more energy than fat while at rest. That means your metabolism may stay elevated for a longer period after strength training in comparison to running.\n\nWeight loss\n\nOne of the primary reasons for people to take up physical exercise is weight loss. What you eat, your lifestyle, the genes you are gifted with, your metabolism, and even how you sleep play a significant part in your weight.\n\nDuke University conducted a study to compare running and strength training for weight loss. It concluded that running decreases both body weight and fat mass significantly more than strength training.\n\nWhile the two modes of exercise produced statistically similar changes in body fat percentage, these changes were driven by different mechanisms. Strength training increased lean body mass, whereas running decreased fat. Other findings from the trial also indicated that running reduced fat around the waist – visceral adipose tissue – more than strength training did.\n\nBurning calories\n\nLosing weight is largely a matter of calories in vs. calories burned – so creating a deficit is essential to losing weight. But which burns more calories, running or lifting?\n\nAccording to a study published in PubMed, an individual who weighs 160 pounds (73 kg) will burn about 250 calories per 30 minutes of running at a moderate pace. If the person was running at a faster pace of 6 miles per hour, the calories burned would be around 365 calories in 30 minutes.\n\nIf the person was strength training for a similar amount of time, the energy expended would be between 130–220 calories. But that's not the full story.\n\nWhile running burns more calories, strength training is more effective at building muscle. According to research, you may also burn more calories in the hours following a strength training session. But crucially, muscle burns more calories at rest, so strength training can condition the body to shred fat.\n\nMuscle building\n\nAesthetics is one of the reasons why most people want to exercise. The byproduct of good health may sometimes also mean looking fit and strong.\n\nAlthough running builds muscle, it's primarily for your lower body, such as the glutes, quads, and hamstrings – they are called the 'powerhouses' for your runs. It can also help you maintain weight, provided your nutrition is on point.\n\nWith good nutrition and the right training program, running alone could provide the necessary means to a lean physique through consistent fat loss and muscle maintenance.\n\nHowever, the size of your muscle increases when you continuously challenge your muscles to deal with higher levels of resistance. This process is known as muscle hypertrophy.\n\nWhen running, muscle size will plateau once your body gets used to the load after an initial phase of adaptation.\n\nGood strength training increases muscle hypertrophy and builds muscle more efficiently than running. This requires progressive overload, which means increasing the weights you lift over time.\n\nYou tend to see differences in muscle in athletes from different types of sports. Marathon runners like Eliud Kipchoge have very lean physiques, sprinters like Usain Bolt have more muscle, and strongmen like Eddie Hall have the most muscle.\n\nHeart health benefits\n\nHaving a healthy heart is known to prolong life and is a strong indicator of good health. But which is better for your heart – running or strength training?\n\nConsistent moderate or intense running gets your heart pumping, increasing its longevity and capability over the long term.\n\nOne of the largest studies published in the Journal of the American College of Cardiology looked at data over 15 years from more than 55,000 adults, showing a positive relationship between heart health and running among the participants.\n\nRunners in the study were found to have a 30% lower risk of death than non-runners. They also had reduced chances of heart-related deaths such as heart attacks or strokes and lived three years longer than non-runners.\n\nStrength training is also a healthy choice to be heart-smart. A study published in 2019 by JAMA Cardiology had 32 obese and sedentary adults who did not have heart disease, diabetes, or atrial fibrillation (an irregular heartbeat that can lead to blood clots, heart attacks, and strokes). All participants took an MRI of their hearts and were randomly assigned to a three-month program of endurance training, strength training, or no exercise.\n\nCompared with the no-exercise group, those in the endurance training and strength training groups had less fat directly touching the heart, by 32% and 24%, respectively.\n\nOnly those in the strength training group had decreased fat that lies just outside the heart sac (called the pericardium). Having less fat in and around the heart sac is associated with a lower risk of heart disease – which indicates that strength training could be even more effective.\n\nConclusion\n\nIt's important to look at exercise holistically and the benefits it provides, aligning the forms of exercise to your fitness goals.\n\nFor instance, if you want to clock a better marathon time or want to lose weight faster, running can be a great choice. People love the freedom of running, it's great for mental health, and you just need to grab your trainers and head out the door.\n\nIf you hate running but want the benefits of shredding fat, then strength training can still be effective. That's because building muscle boosts calorie burn at rest. And if you want to increase your muscle mass for aesthetics, lose fat, and have the strength to bench press 200 pounds, then lifting weights is a no-brainer.\n\nWhile there is nothing wrong with performing each exercise on its own, combining the two can also be a great way to optimize your program. It could help you maintain and build muscle while burning fat.\n\nDisclaimer: The contents of this article are for general information and educational purposes only. It neither provides any medical advice nor intends to substitute professional medical opinion on the treatment, diagnosis, prevention, or alleviation of any disease, disorder, or disability. Always consult with your doctor or qualified healthcare professional about your health condition and/or concerns before undertaking a new healthcare regimen, including making any dietary or lifestyle changes.",
  "charCount": 7355
}
