[
  {
    "id": "yamamoto-1",
    "slug": "ashwagandha-allie-stress",
    "title": "Ashwagandha : un allié précieux contre le stress",
    "excerpt": "L'Ashwagandha, une plante adaptogène puissante utilisée depuis des millénaires, offre un soutien efficace contre le stress, l'anxiété et la fatigue chronique.",
    "category": "Supplémentation",
    "author": "ACHZOD",
    "date": "2025-01-09",
    "readTime": "5 min",
    "image": "/images/supplements/ashwagandha.jpg",
    "featured": false,
    "content": "# Ashwagandha : un allié précieux contre le stress\n\nL'un des éléments nutraceutiques phytothérapeutiques qui m'a le plus fasciné ces dernières années est l'Ashwagandha (ou Withania somnifera, aussi appelée « Ginseng indien ») l'une des herbes les plus puissantes de la médecine ayurvédique dont j'ai été parmi les premiers à en parler en Italie.\n\nEn sanskrit, Ashwagandha signifie « odeur de cheval », se référant à sa capacité de conférer « la force et la vigueur d'un étalon ». Utilisée depuis des millénaires dans la médecine ayurvédique, l'ashwagandha est considérée comme un « Rasayana », un tonique pour restaurer et maintenir la santé et promouvoir la longévité. On lui attribue des propriétés anxiolytiques, hypotensives, analgésiques et antioxydantes bien connues et efficaces, et elle est également utilisée pour traiter les problèmes liés à l'impuissance et à l'infertilité.\n\nAujourd'hui, elle est devenue de plus en plus connue et appréciée aussi par le monde occidental moderne « stressé » et bourré d'adrénaline, en tant qu'« adaptogène » par excellence capable d'augmenter la capacité du corps à gérer et à répondre à des facteurs de stress de diverses sortes, capable d'apporter du soulagement, de combattre les états d'anxiété, de promouvoir la relaxation et la clarté mentale en cas de fatigue psychophysique chronique. Le mérite de ces puissantes propriétés adaptogènes provient de sa composition en éléments bioactifs sous forme de lactones stéroïdes, dans ce cas de « withanolides ». Avant tout « witaférine A », son ingrédient actif le plus puissant de cette plante médicinale extraordinaire auquel on attribue les activités anti-inflammatoires, cardioprotectrices, en particulier neuroprotectrices différenciées, et au niveau du système immunitaire.\n\nMais son action la plus reconnue et confirmée par la recherche est celle concernant la santé du cerveau, du système nerveux et du paysage neuro-cognitif qui étend son éventail potentiel d'action au-delà du simple soutien aux états d'anxiété et de stress. Ce « cousin » de la tomate améliore la santé et la fonction cérébrales de plusieurs façons, notamment en améliorant l'efficacité de la « liaison » des récepteurs du GABA et de la sérotonine dans le cerveau. Il semble agir de manière intéressante sur les récepteurs des neurones, permettant au GABA de se connecter plus facilement, et ainsi d'inhiber les signaux provenant de la réponse au stress. Tonique-adaptogène par excellence qui améliore les performances cognitives et psychomotrices (chez un cerveau sain), avec un effet « antiâge » particulier sur les axones et les dendrites des cellules nerveuses cérébrales, qui favorise les synapses, les jonctions dans lesquelles les cellules nerveuses communiquent.\n\nNous savons aussi que le stress chronique et le cortisol peuvent endommager le cerveau au fil du temps en altérant les réseaux neuronaux. Le cortisol crée un effet domino qui traverse la connexion « logicielle » entre l'hippocampe et l'amygdale, la zone responsable de votre réponse de fuite ou de combat qui reste en « alerte permanente », même quand ce n'est pas nécessaire, ou que très peu suffit à l'activer et à avoir une réponse disproportionnée. C'est ici que l'Ashwagandha intervient précisément pour restaurer ces équilibres physiologiques et « calmer les menaces » détectées quand il n'y a pas de besoin réel.\n\nSi nous éprouvons une fatigue sévère et un brouillard cérébral (« brain fog ») surtout au réveil, si nous sommes perpétuellement « épuisés » et sans force, si la motivation est au plancher avec un moral fluctuant, où l'anxiété devient un fardeau quotidien désagréable, l'Ashwagandha est l'élément le plus intéressant et efficace que la phytothérapie orientale nous a transmis « aujourd'hui », et pour lequel la science moderne a déjà donné plusieurs confirmations. Un élément nutraceutique extraordinaire qui peut être utile à quiconque traverse des phases de stress psychophysique, aux professionnels de divers secteurs, aux athlètes, aux soldats, ou à quiconque a besoin de restaurer « en amont » la capacité à répondre avec clarté et efficacité à des agents ou des situations stressantes, tant mentales que physiques, ainsi que de savoir se reposer quand il n'y a pas de « danger », freiner les niveaux de cortisol, avec un meilleur équilibre sur ceux de l'acétylcholine qui redonneront de la vigueur pour que vous puissiez à nouveau penser avec clarté, plus calmement et en améliorant les temps de réaction.\n\n## Références scientifiques\n\nSingh N, Bhalla M, de Jager P, Gilca M. Un aperçu de l'ashwagandha : un Rasayana rajeunissant de l'Ayurvéda. Afr J Tradit Complement Alternate With. 2011;8(5 Suppl):208-13. doi: 10.4314/ajtcam.v8i5S.9. Epub 2011 Jul 3. PMID: 22754076 ; PMCID: PMC3252722.\n\nMishra LC, Singh BB, Dagenais S. Fondement scientifique de l'utilisation thérapeutique de Withania somnifera (ashwagandha) : une revue. Altern Med Rev. 2000 Aug;5(4):334-46. PMID: 10956379.\n\nBhattacharya S.K., Bhattacharya A., Sairam K., Ghosal S. « Activité anxiolytique-antidépresseur des glycowithanolides de Withania somnifera : une étude expérimentale. » Phytomedicine 2000 Dec;7(6):463-9.\n\nSengupta P, Agarwal A, Pogrebetskaya M, Roychoudhury S, Durairajanayagam D, Henkel R. Rôle de Withania somnifera (Ashwagandha) dans la gestion de l'infertilité masculine. Reprod Biomed Online. 2018 Mar;36(3):311-326. doi: 10.1016/j.rbmo.2017.11.007. Epub 2017 Dec 7. PMID: 29277366.\n\nKuboyama T, Tohda C, Komatsu K. Effets de l'Ashwagandha (racines de Withania somnifera) sur les maladies neurodégénératives. Biol Pharm Bull. 2014;37(6):892-7. doi: 10.1248/bpb.b14-00022. PMID: 24882401.\n\nKuboyama T., Tohda C., Komatsu K. « Régénération neuritique et reconstruction synaptique induites par la withanolide A. » British Journal of Pharmacology 2005 Apr;144(7):961-71.\n\nChoudhary M.I., Yousuf S., Nawaz S.A., Ahmed S., Atta-ur-Rahman. « Withanolides inhibiteurs de la cholinestérase de Withania somnifera. » Chemical and Pharmaceutical Bulletin (Tokyo) 2004 Nov;52(11):1358-61.\n\nChoudhary D, Bhattacharyya S, Bose S. Efficacité et sécurité de l'Ashwagandha (Withania somnifera (L.) Dunal) Extrait racinaire dans l'amélioration de la mémoire et des fonctions cognitives. J Diet Suppl. 2017 Nov 2;14(6):599-612. doi: 10.1080/19390211.2017.1284970. Epub 2017 Feb 21. PMID: 28471731.\n\nPingali U., Pilli R., Fatima N. « Effet de l'extrait aqueux standardisé de Withania somnifera sur les tests de performance cognitive et psychomotrice chez les participants humains en bonne santé » Pharmacognosy Res. 2014 Jan-Mar; 6(1): 12–18.\n\n« De nouvelles preuves que le stress chronique prédispose le cerveau à la maladie mentale » Université de Californie, Berkeley 11 février 2014, Récupéré 24 mars 2016\n\nChandrasekhar K., Kapoor J., Anishetty S. « Une étude prospective, randomisée, en double aveugle et contrôlée par placebo sur la sécurité et l'efficacité d'un extrait à haut spectre et haute concentration de racine d'ashwagandha dans la réduction du stress et de l'anxiété chez les adultes. » Indian Journal of Psychological Medicine 2012 Jul;34(3):255-62.\n\nDhuley J.N. « Effet de type nootrope de l'ashwagandha (Withania somnifera L.) chez la souris. » Phytotherapy Research 2001 Sep;15(6):524-8.\n\nBhattacharya S.K., Bhattacharya A., Sairam K., Ghosal S. « Activité anxiolytique-antidépresseur des glycowithanolides de Withania somnifera : une étude expérimentale. » Phytomedicine 2000 Dec;7(6):463-9."
  },
  {
    "id": "yamamoto-2",
    "slug": "creatine-reine-supplements-performance",
    "title": "Créatine : la reine des suppléments de performance",
    "excerpt": "La créatine monohydrate, l'un des suppléments les plus étudiés et sûrs, offre des avantages prouvés pour la performance athlétique, la force et la récupération.",
    "category": "Musculation",
    "author": "ACHZOD",
    "date": "2025-01-09",
    "readTime": "12 min",
    "image": "/images/supplements/creatine.jpg",
    "featured": false,
    "content": "# Créatine : la reine des suppléments de performance\n\nLa créatine fait partie de la famille des guanidino-phosphates, un composé d'acide aminé exempt de protéines naturellement présent dans plusieurs aliments, notamment principalement la viande rouge et le poisson. La majorité de la créatine est déposée dans le muscle squelettique (95%), le reste étant réparti entre le cerveau et les testicules. Environ 2/3 de la créatine intramusculaire se présentent sous la forme de phospho-créatine (Pcr), le reste sous la forme de créatine libre. Elle a été identifiée pour la première fois en 1832 par le chimiste français Chevreul, mais sa présence dans la viande a été confirmée par le chimiste allemand bien connu Von Liebig seulement en 1847, suivi dans la décennie de nombreuses études, qui ne cessent toujours de produire des surprises, études qui ont vu parmi les protagonistes l'école italienne de Margaria.\n\nBien sûr, une proportion de créatine, chimiquement « acide méthyl guanidino acétique », peut être synthétisée au niveau du foie, en partie aussi dans les reins et le pancréas, à partir de l'arginine, de la S-adénosyl-méthionine et de la glycine. Ses fonctions physiologiques les plus bien connues incluent la capacité à fournir rapidement une molécule de phosphate dans la resynthèse de l'ATP à partir de l'ADP dans la réaction cyclique bien connue et donc dans la gestion de l'énergie dans les premières secondes d'activité musculaire.\n\nIl est donc évident que la disponibilité de la Pcr est capable de gérer les flux énergétiques musculaires pour les efforts intenses de courte durée, la disponibilité de la Pcr dépend principalement de l'activité de l'enzyme créatine kinase (CK), des stocks musculaires (et donc de la masse totale) et de la capacité de synthèse endogène, considérant que la quantité assimilable par l'alimentation est extrêmement faible. Le rôle principal de la créatine, ainsi que son effet pléiotrope, est lié au système CK/Pcr, schématiquement rapporté à la Figure 2.\n\nLa quantité de Cr utilisée quotidiennement dépend de divers facteurs, notamment la durée et l'intensité de l'exercice, la biodisponibilité des sources de Cr, la masse musculaire de l'athlète. En fait, il a été rapporté que les grands athlètes sont capables de consommer des quantités de Cr égales à 5-10 g/jour ; dans certaines conditions cliniques, c'est même 10-30 g/jour (Braissant, Wyss et al.).\n\n## Supplémentation\n\nDepuis plusieurs années, on a émis l'hypothèse qu'augmenter la quantité de Cr ingérée pourrait entraîner les avantages causés par la plus grande disponibilité et donc une augmentation de la capacité de stockage de celle-ci dans les muscles, compte tenu aussi de la démonstration que quand la concentration de Cr diminue avec la poursuite de l'exercice, donc, diminue la capacité à maintenir l'intensité constante.\n\nAvec un régime normal, il est possible de fournir 1-2 g de Cr par jour, ce qui signifie saturer les dépôts à 60-70%, clairement, une supplémentation non seulement permettrait de saturer les dépôts à 100%, mais même d'augmenter la capacité de 20-40%, également à la suite de diverses stratégies de supplémentation (Candow, Kreider et al.).\n\n## La supplémentation en Cr est-elle vraiment capable d'améliorer la performance athlétique ?\n\nLa Cr et sa supplémentation ont été le sujet d'au moins 25 ans d'une série très longue et copieuse d'études qui ont permis de connaître de nombreux aspects de la biochimie de la substance et comment celle-ci est capable d'accompagner et de modifier les adaptations métaboliques qui suivent les exercices, souvent d'intensité et de charge très élevées et de durée particulière, sans compter les perspectives très intéressantes qui s'ouvrent dans le domaine clinique, mais sur lesquelles nous n'écrirons pas à cette occasion.\n\n## Quantités recommandées\n\nLa quantité de Cr à ingérer pour augmenter les dépôts est d'environ 5 g/jour pendant 5-7 jours, nous parlons de MONOHYDRATE DE CRÉATINE, la forme la plus étudiée.\n\nLes quantités de Cr à administrer capable de maintenir constantes les quantités maximales de Cr musculaire voient maintenant un partage décidé indiquant 3-5 g/jour, même pour de longues périodes ; on considère un besoin plus important pour les athlètes de grand tonnage pour lesquels 5-10 g/jour. Dans certaines études, il a été recommandé de commencer par une courte période de charge (en tout cas pas moins de 0,3 g/kg de poids corporel pendant 4-5 jours), suivie des doses précédemment recommandées.\n\nL'administration de Cr monohydrate avec des glucides ou un mélange de glucides et de protéines augmente la capacité de rétention et l'augmentation des dépôts (Steenge, Greenwood). Un protocole alternatif voit une quantité de 3 g/jour pendant au moins 28 jours consécutifs, mais l'augmentation des dépôts est lente et progressive. Il convient de considérer qu'une fois que la quantité maximale de dépôts a été obtenue, en cas d'arrêt de la supplémentation, le retour à la quantité initiale se ferait après 4-6 semaines.\n\nLe monohydrate de créatine, tel que mentionné ci-dessus, la forme la plus largement utilisée et étudiée, est très stable sous forme solide, moins dans une solution aqueuse dans laquelle il reste stable pendant plusieurs heures (l'instabilité se manifeste par la cyclisation de la créatinine qui la rendrait peu ou pas assimilable), la stabilité augmente avec l'augmentation du pH et la diminution de la température de la solution ; une fois ingérée, le pic d'absorption se produit après environ 60 minutes. En plus du monohydrate de créatine, plusieurs autres formes ont été proposées (citrate, ester éthylique, nitrate, tamponné et autres), mais aucune n'a démontré avoir de meilleures propriétés tant dans le résultat final que dans la cinétique d'absorption.\n\n## Quand la prendre\n\nQuant au timing, cependant, plusieurs études affirment avec détermination que prendre Cr post-entraînement détermine de meilleurs résultats que pré-entraînement en analysant les valeurs de force et composition corporelle.\n\n## Avantages de la supplémentation\n\nUne série copieuse d'études a conduit à avoir de fortes preuves en relation avec la capacité de Cr à fournir un supplément énergétique dans une large gamme d'exercices ; clairement, différentes disciplines sportives bénéficient en vue de la présence des différentes étapes du tableau qui composent les caractéristiques de la discipline à considérer.\n\nSuit un tableau récapitulatif qui tient compte des disciplines sportives qui apportent un avantage de la supplémentation de Cr et pourquoi prédominant.\n\nComme vous pouvez le voir, plusieurs disciplines sont impliquées confirmant que la supplémentation de Cr est capable d'augmenter la performance dans toutes les conditions athlétiques et que ce soit en force pure et intensité élevée, continue et intermittente, ainsi que dans les tests long terme.\n\nDans un aperçu récent des avantages supplémentaires découlant de l'utilisation de Cr, il y a une description schématique :\n\nAmélioration de la récupération\nPrévention des blessures\nAugmentation de la tolérance à la chaleur\nAmélioration de la réadaptation après blessure\nNeuroprotection du cerveau et de la colonne vertébrale\nSécurité\n\n## Sécurité\n\nL'un des aspects les plus intéressants est la sécurité signalée après des doses massives de Cr prises pendant de longues périodes sans avoir d'effets secondaires particuliers. En particulier, il est rapporté que l'apport pendant plusieurs années de doses de 0,3-0,8 g par kg/ poids corporel (égal à 21-56 g pour un sujet de 70 kg) quotidiennement n'a pas entraîné d'événements cliniques ou d'effets secondaires graves.\n\n## Croyances et faux mythes\n\nLa renommée remarquable acquise par les capacités de la Cr a également conduit, comme cela arrive souvent, à la diffusion d'éléments d'avantage extraordinaire, jamais confirmés dans de telles proportions, alors que, au contraire, des données alarmantes sur les effets secondaires sont susceptibles de compromettre certaines caractéristiques saillantes de disciplines spécifiques, comme la condition préoccupante de prise de poids due à la rétention d'eau, évidemment problématique dans les disciplines où la perte de poids est cruciale.\n\nNécessaire à cet effet de rapporter les conclusions finales d'une étude qui a analysé de nombreuses publications scientifiques publiées sur la supplémentation de Cr, étude très éclairante à cet égard :\n\nCr ne conduit pas à la rétention d'eau\nCr n'est pas un stéroïde anabolisant\nS'il est pris aux doses recommandées, n'entraîne pas de dommages ou de dysfonctionnement rénal\nLa majorité des preuves ne montrent aucune corrélation entre l'utilisation de Cr et la perte de cheveux\nCr ne cause pas la déshydratation et les crampes\nLe CR est capable d'apporter les avantages rapportés en toute sécurité même chez les adolescents\nCr n'augmente pas la masse grasse\nDe petites doses de Cr (3-5 g par jour) sont suffisantes pour maintenir des quantités maximales constantes de dépôts de Cr musculaire, donc la charge (25 g/jour) n'est généralement pas utile\nLa supplémentation de Cr en combinaison avec l'entraînement de résistance au comptoir apporte des avantages considérables à la population âgée ; notez que chez ces sujets, même la Cr seule (sans entraînement) est capable d'apporter des avantages\nCr est capable d'apporter des avantages dans une grande variété de disciplines sportives\nLe CR est capable d'apporter les mêmes avantages au sexe féminin tout au long de la vie\nAucune forme alternative de Cr n'a d'avantages par rapport au monohydrate de créatine.\n\n## Conclusion\n\nEn conclusion, la Cr devient de plus en plus importante en tant que substance d'intérêt considérable pour les aspects les plus variés dans les diverses disciplines sportives, pas exclus les aspects cliniques qui, de plus en plus, vont au-delà des besoins sportifs et pour lesquels, cependant, la preuve scientifique assume maintenant des proportions sans équivoque.\n\n## Bibliographie\n\nBraissant O, et al. Syndromes de déficience en créatine et l'importance de la synthèse de créatine dans le cerveau. Amino Acids.\n\nWyss M, et al. Créatine et créatine kinase dans la santé et la maladie – un avenir prometteur ? Subcell Biochem. 2007;46:309–34.2011;40(5):1315–24.\n\nCandow DG, Chilibeck PD. Potentiel de la supplémentation en créatine pour améliorer la santé osseuse liée au vieillissement. J Nutr Health Aging. 2010;14(2):149–53.\n\nKreider RB. Effets de la supplémentation en créatine sur la performance et les adaptations à l'entraînement. Mol Cell Biochem. 2003;244(1–2):89–94.\n\nSteenge GR, Simpson EJ, Greenhaff PL. Augmentation de la rétention de créatine corporelle induite par les protéines et les glucides chez l'humain. J Appl Physiol (1985). 2000;89(3):1165–71.\n\nGreenwood M, et al. Différences dans la rétention de créatine entre trois formulations nutritionnelles de suppléments oraux de créatine. J Exerc Physiol Online. 2003;6(2):37–43.\n\nKreider RB, Kalman DS, Antonio J, Ziegenfuss TN, Wildman R, Collins R, Candow DG, Kleiner SM, Almada AL, Lopez HL. Position de la Société internationale de nutrition sportive : sécurité et efficacité de la supplémentation en créatine dans l'exercice, le sport et la médecine. J. Int. Soc. Sports Nutr. 2017;14:18-z eCollection 2017.\n\nAntonio, J., Candow, D.G., Forbes, S.C. et al. Questions courantes et idées fausses sur la supplémentation en créatine : que montrent vraiment les données scientifiques ? J Int Soc Sports Nutr 18, 13 (2021)"
  },
  {
    "id": "yamamoto-3",
    "slug": "deshydratation-sels-mineraux-role-fonctions",
    "title": "Déshydratation et sels minéraux : rôle et fonctions",
    "excerpt": "L'hydratation appropriée est essentielle pour la performance sportive et la prévention des blessures. Comprendre la physiologie de l'hydratation et le rôle des électrolytes est fondamental.",
    "category": "Nutrition et bien-être",
    "author": "ACHZOD",
    "date": "2025-01-09",
    "readTime": "13 min",
    "image": "/images/supplements/hydration.jpg",
    "featured": false,
    "content": "# Déshydratation et sels minéraux : rôle et fonctions\n\nL'hydratation a toujours joué un rôle important dans la performance sportive, la prévention des blessures et la récupération après les séances d'entraînement ou les compétitions, tant pour les athlètes engagés dans des sports de compétition ou des compétitions que au niveau amateur. Par conséquent, il est extrêmement important que les entraîneurs et les athlètes comprennent clairement les mécanismes et la physiologie de ce mécanisme, afin d'améliorer les besoins en hydratation des sportifs à titre préventif mais aussi à titre de prêt.\n\nCommençons par les bases : chez un sujet sédentaire, l'échange hydrique quotidien est d'environ 2,5 litres (entre les entrées et les sorties), mais les liquides qui circulent réellement dans tout le système digestif s'élèvent à environ 9 litres. Quand il s'agit d'athlètes, ces quantités varient considérablement et les demandes de liquides ont augmenté, évidemment en raison d'une augmentation des sorties, avant tout sous forme de sueur. Ces pertes doivent être adéquatement compensées par une augmentation des revenus, afin de ne pas risquer d'encourir des problèmes et des répercussions (que nous discuterons plus tard).\n\nLa quantité d'eau à réintégrer varie alors selon les caractéristiques individuelles, l'intensité et la quantité de travail musculaire et, surtout, en relation avec les conditions climatiques. Il n'est donc pas possible d'établir a priori les besoins du sujet individuel, qui sont strictement personnels.\n\n## Physiologie et mécanismes de l'état d'hydratation\n\nCependant, il est important de toujours garder à l'esprit certains aspects physiologiques, qui nous permettent de mieux comprendre comment fonctionne l'état d'hydratation de l'individu : l'eau corporelle représente environ 60% du poids corporel total chez un homme adulte (donc plus de la moitié du nombre que nous voyons sur la balance quand nous nous pesons). La quantité d'eau intracellulaire (aussi techniquement appelée ICW - Eau Intra Cellulaire) s'élève à 2/3 de l'eau corporelle totale (66%), tandis que le contenu en eau extracellulaire (qui est indiqué à la place comme ECW - Eau Extra Cellulaire) s'élève à 1/3 de l'eau corporelle totale (ou Eau Corporelle Totale - TBW) et représente 35%.\n\nLargement parlant, le besoin en eau d'une personne qui fait une activité physique est d'environ 1 ml pour chaque calorie de dépense énergétique. Si l'activité physique dépasse 2 heures, la déshydratation peut même atteindre 5% du poids corporel : une valeur bien trop élevée pour être négligée, et qui peut aussi entraîner des complications sérieuses si elle n'est pas rapidement réintégrée. Ce manque de liquides doit donc être adéquatement et promptement rééquilibré ; sinon, il crée les conditions d'une détérioration rapide de la performance de l'athlète.\n\nLe respect du choix des solutions hypo- ou isotoniques et l'utilisation de toute supplémentation ciblée est nécessaire pour éviter qu'une quantité importante d'eau pure ne conduise également à la dilution des fluides extracellulaires. Cela pourrait en fait déterminer, grâce à l'action de la glande pituitaire, la sécrétion (c'est-à-dire la production et l'excrétion) de l'adiurétine, une hormone aussi connue sous le nom de « vasopressine », avec élimination consécutive des fluides en excès, mais ce qui entraîne aussi des conséquences désagréables pour un athlète.\n\nEn général, le manque de liquides et par conséquent de sels, en particulier dans les conditions humides et chaudes, est signalé par des symptômes tels que la nausée, les vomissements, les vertiges et la fatigue générale, ainsi que par une altération significative de la performance. Si vous insistez pour continuer à faire de l'exercice malgré l'apparition des symptômes, vous pouvez éprouver des crampes musculaires et des difficultés de concentration. Pour calculer correctement la quantité de substances à réapprovisionner, il est nécessaire de se souvenir de certains concepts, liés à la définition de l'osmolarité, que nous rapportons ci-dessous.\n\nLe terme osmolarité fait référence à une quantité physique qui mesure la concentration de solutions, et sa valeur exprime précisément la concentration de la solution examinée. Sous conditions normales, l'osmolarité est identique pour tous les fluides présents dans les différents compartiments de l'organisme (qui peuvent être divisés en intracellulaires et extracellulaires). Le volume du fluide extracellulaire est généralement estimé à 0,255 l/Kg de poids corporel, et le facteur principal qui régule la distribution de l'eau corporelle entre les districts extracellulaires (EC) et intracellulaires (IC) est la pression osmotique des liquides eux-mêmes. La pression osmotique est définie comme cette pression qui équilibre exactement le mouvement du solvant généré par la différence de concentration de soluté entre 2 concentrations. Dans le compartiment extracellulaire, le sodium est plus important, tandis que le potassium prévaut dans le compartiment intracellulaire.\n\nL'importance d'une interprétation correcte de l'osmolarité devient fondamentale dans la préparation d'une solution qui doit réapprovisionner l'énergie et les sels minéraux chez l'athlète. Avant tout, il est nécessaire d'identifier l'objectif, c'est-à-dire si vous visez un réapprovisionnement rapide en eau ou si vous voulez une prise énergétique rapide, qui peut être utilisée rapidement par le corps.\n\n## Intégration des sels minéraux\n\nAu niveau supplémentaire, deux minéraux bien connus jouent certainement un rôle fondamental : le magnésium et le potassium. Le magnésium aide à soutenir la fonction musculaire physiologique, contribue à la réduction de la fatigue et de l'épuisement, soutient le métabolisme énergétique et contribue au fonctionnement normal du système nerveux. Le potassium aide à soutenir la fonction musculaire physiologique, favorise le maintien d'une pression artérielle normale et contribue également au fonctionnement du système nerveux. Dans certaines situations, une supplémentation en sodium peut également être nécessaire quand il n'est pas possible de couvrir l'augmentation des besoins avec l'alimentation seule (généralement suffisante) ou suite à une transpiration extrême non suivie d'une récupération adéquate. En fait, le sodium participe à la transmission des impulsions nerveuses, régule la perméabilité des membranes et contribue au maintien de l'équilibre hydrique.\n\nQuant aux niveaux de concentration des solutions, ceux-ci peuvent être divisés en Isotonique et Hypertonique, en fonction des temps d'assimilation par l'intestin. Une solution isotonique (avec pression osmotique égale à celle du plasma) garantit également un transit rapide par l'estomac, juste plus lent que celui de l'eau pure.\n\nEn revanche, une solution hypertonique, c'est-à-dire avec une pression osmotique supérieure à celle du plasma, reste plus longtemps dans l'estomac et, une fois qu'elle atteint la lumière intestinale en raison de l'osmolarité élevée, elle rappelle une quantité considérable de liquides de la muqueuse (vol d'eau). Cette soustraction d'eau endommage tout le corps, aggravant tout état de déshydratation, causant la diarrhée et, en tout cas, limitant la performance athlétique.\n\nAu début de l'exercice physique, l'eau est transférée du plasma sanguin (ECW) aux espaces interstitiels et intracellulaires : les métabolites commencent à s'accumuler dans et autour des fibres musculaires ; la pression osmotique à ces sites augmente et attire l'eau. En augmentant l'activité musculaire, une augmentation de la pression artérielle est obtenue, avec une « extravasation » d'eau du compartiment vasculaire, souvent associée à une augmentation de la transpiration : essentiellement, de tous ces effets dus à l'activité physique accrue, les muscles acquièrent l'eau aux dépens du volume plasmatique.\n\nEn revanche, la réduction du volume plasmatique entraîne :\n\nRéduction de la pression artérielle ;\nRéduction du flux sanguin vers l'épiderme ;\nRéduction du flux sanguin vers les muscles.\n\n## Risques de déshydratation\n\nMême une déshydratation modeste (égale à 1% du poids corporel), causée par la transpiration lors de l'exercice physique, peut augmenter le travail cardiovasculaire en augmentant la FC (fréquence cardiaque) et ainsi réduire la capacité du corps à thermoréguler.\n\nLa transpiration excessive et/ou l'émission urinaire excessive pourraient également être une conséquence de la perte importante d'électrolytes, qui pourrait entraîner le développement de répercussions graves, telles que les dysrythmies cardiaques. Tout cela bien que Costill, un célèbre physiologiste du sport, ait observé que la perte uniforme d'électrolytes, même si elle est considérable, provient principalement du compartiment ECW, et donc la perte d'ions par la transpiration et l'émission urinaire se traduirait par de petits effets sur la teneur en ions K+ dans la cellule musculaire.\n\nÀ ne pas négliger non plus est l'influence de la déshydratation sur nos défenses immunitaires. Cet effet, aussi connu sous le nom de « l'effet de la fenêtre ouverte », découle du fait qu'après l'exercice physique, le système immunitaire est occupé à guérir les micro-lésions des muscles et des cellules, formées à la suite de l'entraînement. C'est pourquoi, avec l'hydratation, pendant et après la performance, un athlète doit se rappeler de garder aussi les intestins protégés. En fait, toute sa santé en dépend : pour que l'intestin soit moins « perméable » aux attaques par les agents pathogènes, des suppléments tels que le zinc et la vitamine C exercent une excellente action antioxydante pour protéger les cellules du stress oxydatif induit par l'activité physique intense, et soutenant ainsi les défenses physiologiques.\n\n## Bibliographie\n\nMcARDLE W. D, KATCH FI, KATCH VL « Physiologie appliquée au SPORT ». Casa Editrice Ambrosiana, Milan, 1998.\n\nOPPLIGER RA, CASE HS, HORSWILL CA et al. « Perte de poids chez les lutteurs », Position officielle de l'American College of Sports Medicine. Medicine and Science in Sports and Exercise. Vol. 28, No. 2. 1996\n\nROEMMICH JN, SINNING WE « Perte de poids et entraînement à la lutte : effets ou nutrition, maturation, composition corporelle et force ». Journal of Applied Physiology 82 : 1751-1759, 1997.\n\nTIMPMANN S., OOPIK V. « L'influence de la réduction du poids corporel sur la performance en sports de combat ». Athlon 10/2005, 1-2/2006.\n\nWILMORE J. H. « Sports de catégories de poids » ; Partie 4, Cap. 49, en MAUGHAN R.J. « Nutrition dans le sport », Volume VII de l'Encyclopédie de la médecine du sport, en collaboration avec la Fédération internationale de médecine du sport. Blackwell Science, 2002.\n\nDamir Zubac, Armin Paravlic, Reid Reale, Igor Jelaska, Shawnda A Morrison, Vladimir IvancevEur J Nutr. 2019 Mar;58(2):497-514. Équilibre hydrique et état d'hydratation chez les athlètes olympiques des sports de combat : un examen systématique avec méta-analyse d'études contrôlées et non contrôlées.\n\nShirreffs SM et al. 2005, Réponse sudatoire des joueurs de football professionnel d'élite à l'entraînement dans la chaleur. Int. J. Sport. Med. 26 (2): 90-5.\n\nMaughan, R. 2006. Directives pour le remplacement des fluides et des CHO pendant l'exercice. In: Nutrition sportive clinique - McGraw Hill.\n\nR. J. Maughan, S. M. Shirreﬀs; Scand J Med Sci Sports 2010: 20 (Suppl. 2): 59–69. Développement des stratégies d'hydratation pour optimiser la performance des athlètes dans les sports d'intensité élevée et dans les sports avec des efforts intenses répétés.\n\nN.A. Masento, M. Golightly, D.T. Field, L.T. Butler and C.M. van Reekum; British journal of nutrition, January 2014, Effets de l'état d'hydratation sur la performance cognitive et l'humeur."
  },
  {
    "id": "yamamoto-4",
    "slug": "wada-agence-mondiale-antidopage-actions-directives",
    "title": "WADA, l'Agence mondiale antidopage - actions et directives",
    "excerpt": "L'Agence mondiale antidopage (WADA) coordonne la lutte contre le dopage dans le sport, établissant des normes harmonisées et une liste annuelle de substances interdites.",
    "category": "Sport",
    "author": "ACHZOD",
    "date": "2025-01-09",
    "readTime": "7 min",
    "image": "/images/sports/wada.jpg",
    "featured": false,
    "content": "# WADA, l'Agence mondiale antidopage - actions et directives\n\nLe problème des substances à utiliser pour améliorer la performance sportive n'est pas récent, même Hippocrate et Galien en parlaient en 400 av. J.-C. et depuis lors, selon l'importance de la compétition, des scientifiques, des sorciers, des gourous et des charlatans de toutes sortes se sont succédé, toujours et en tout cas à la recherche d'une substance « miraculeuse ».\n\nÉvidemment, pour la plupart, ces substances variées incluses dans les programmes des athlètes ont très souvent causé divers et, dans certains cas, des problèmes de santé considérables aux malheureuses personnes qui les utilisaient. À cet égard, on a senti le besoin d'exercer un contrôle sur l'utilisation de ces substances et aussi de certaines méthodes qui accompagnaient souvent l'administration desdites ; avant tout il était nécessaire d'harmoniser la classification des substances à interdire avec des procédures valables pour toutes les nations dont les athlètes ont été envoyés à diverses compétitions et, surtout, de créer une structure super-partes capable de contrôler ces activités et d'émettre des classifications mises à jour chaque année, et c'est ainsi qu'est née la WADA.\n\n## Qu'est-ce que la WADA ?\n\nL'Agence mondiale antidopage, en anglais World Anti-Doping Agency (WADA), est une fondation à participation publique-privée mixte, créée par la volonté du Comité international olympique le 10 novembre 1999 à Lausanne, pour coordonner la lutte contre le dopage dans le sport. En 2002, son siège a été transféré à Montréal, Canada, bien que légalement elle reste une fondation de droit privé, régie par le droit civil suisse. La WADA est donc une organisation internationale qui délègue le travail aux nations individuelles et aux organisations nationales antidopage (NADO), en surveillant leur travail pour s'assurer qu'il est conforme au Code mondial antidopage. En outre, la WADA accrédite environ 30 laboratoires qui effectuent les analyses scientifiques nécessaires au contrôle antidopage.\n\nLe Code mondial antidopage WADA est un document rédigé afin de mettre les réglementations antidopage en conformité dans tous les sports et, plus important encore, dans tous les pays. Il contient une liste, mise à jour chaque année, des substances et des méthodes interdites que les athlètes ne peuvent pas utiliser. Il a été adopté par les organisations sportives en 2004, avant les Jeux olympiques d'Athènes. En novembre 2007, à la Troisième Conférence mondiale sur le dopage dans le sport, plus de 650 organisations sportives (fédérations sportives internationales, organisations nationales antidopage, le CIO, le Comité paralympique international et diverses fédérations professionnelles du monde entier) ont adopté à l'unanimité une révision du Code, entrant en vigueur le 1er janvier 2009.\n\nLa Liste WADA des substances et méthodes interdites (Liste WADA) est le document identifié comme la norme internationale pour identifier les substances et les méthodes interdites dans le sport. La Liste WADA est l'un des éléments les plus importants pour l'harmonisation mondiale du mouvement antidopage mondial. Divisée en catégories, elle identifie quelles substances et méthodes sont interdites En Compétition, Hors de la Compétition et dans des Sports Particuliers.\n\nLa Liste WADA est mise à jour annuellement suite à un processus de consultation étendu coordonné par la WADA et entre en vigueur le 1er janvier de chaque année. Dans notre pays, les règles WADA sont gérées par NADO Italie - Organisation nationale antidopage (NADO) -, division fonctionnelle de l'Agence mondiale antidopage WADA, qui a la responsabilité exclusive de l'adoption des règles sportives antidopage conformément au Code mondial antidopage (Code WADA) dont elle est signataire.\n\n## Rôles clés et responsabilités des athlètes\n\nIl est de la responsabilité personnelle de chaque athlète :\n\n- être conscient d'avoir à se conformer aux Règles sportives antidopage (NSA) et connaître les obligations qui en découlent ;\n\n- être toujours disponible pour le prélèvement d'un échantillon biologique ;\n\n- être personnellement responsable de l'utilisation ou de l'ingestion de quoi que ce soit dans le contexte antidopage ;\n\n- informer le personnel médical de l'interdiction d'utiliser des substances interdites et de recourir à des méthodes interdites et s'assurer que tout traitement médical reçu ne viole pas la NSA ;\n\n- signaler à NADO Italie et à sa Fédération internationale toute décision prise par un non-signataire à l'égard d'un athlète qui a commis une violation des règles antidopage au cours des dix (10) années précédentes ;\n\n- coopérer avec les organismes antidopage impliqués dans l'enquête sur les violations des règles antidopage ;\n\n- divulguer l'identité de votre personnel de soutien à la demande de NADO Italie, d'une fédération sportive nationale ou de toute autre organisation antidopage ayant autorité sur l'athlète\n\n## Rôles clés et responsabilités du personnel de soutien de l'athlète\n\nIl est de la responsabilité personnelle de tout personnel de soutien d'athlète :\n\n- être conscient d'avoir à se conformer aux NSA et connaître les obligations qui en découlent ;\n\n- collaborer à la mise en œuvre des contrôles antidopage placés sur l'athlète ;\n\n- utiliser son influence sur l'athlète, en promouvant des valeurs et des comportements contraires au dopage ;\n\n- signaler à NADO Italie et à sa Fédération internationale toute décision prise par un non-signataire à l'égard de celui qui a commis une violation des règles antidopage au cours des dix (10) années précédentes ;\n\n- coopérer avec les organismes antidopage impliqués dans l'enquête sur les violations des règles antidopage.\n\nLe personnel de soutien de l'athlète ne doit pas utiliser ou posséder de substance interdite ou employer une méthode interdite, sans justification valide.\n\n## Classification des substances\n\nLa WADA a classé les substances « interdites » dans le sport en utilisant des méthodes classiques et clairement compréhensibles. Voici un aperçu simple :\n\n### SUBSTANCES ET MÉTHODES TOUJOURS INTERDITES\n\nSubstances non approuvées\nAgents anabolisants\nHormones peptidiques, facteurs de croissance, substances apparentées et analogues\nAgonistes bêta-2\nHormones et modulateurs métaboliques\nDiurétiques et agents de masquage\nMéthodes interdites (par exemple, transfusion de substances homologues – transfusion autohémo_ et de substances hétérologues. Toute forme de manipulation intravasculaire, indépendamment de la substance introduite ; etc.)\n\n### SUBSTANCES ET MÉTHODES INTERDITES PENDANT LES COMPÉTITIONS\n\nStimulants (spécifiques et non spécifiques)\nNarcotiques\nCannabinoides (sauf Cannabidiol CBD)\nGlucocorticoïdes\n\n### SUBSTANCES INTERDITES DANS DES SPORTS PARTICULIERS (*)\n\nBêta-bloquants\n\n(*) Tir à l'arc ; sports automobiles ; fléchettes, billard ; golf ; mini-golf ; chaque type de tir ; événements de ski extrême ; sports subaquatiques\n\n## Conclusions\n\nCependant, la lutte contre le dopage est en constante évolution, une mise à jour est présentée chaque année capable d'assimiler toutes les nouvelles substances qui sont progressivement introduites afin d'augmenter toutes les phases de l'exercice physique, presque toujours indépendamment de la protection de la santé des athlètes.\n\nCarmine Orlandi"
  }
]
