[
  {
    "title": "Ashwagandha: a valuable ally against stress",
    "url": "https://www.yamamotonutrition.com/int/blog/post/ashwagandha-a-valuable-ally-against-stress-a1952",
    "category": "active ingredients",
    "author": "Author: Gabriele Trapani",
    "excerpt": "Ashwagandha is a nutraceutical phytotherapeutic element known as an adaptogen par excellence, capable of enhancing the body's ability to cope with and respond to stressors of various kinds, providing relief, counteracting states of anxiety, promoting relaxation, and mental clarity in cases of chronic psychophysical fatigue.Also known for its anti-inflammatory, cardioprotective and neuroprotective activities, it strengthens the immune system. An extraordinary nutraceutical element that can help anyone going through phases of psychophysical stress.",
    "imageUrl": "https://www.yamamotonutrition.com/media//magefan_blog/head/1952-card.jpg"
  },
  {
    "title": "Guarana | Properties, Benefits and Curiosities",
    "url": "https://www.yamamotonutrition.com/int/blog/post/guarana-properties-benefits-and-curiosities-a987",
    "category": "active ingredients",
    "author": "Author: Massimiliano Febbi",
    "excerpt": "Guarana (Paullinia Cupana) is an evergreen climbing plant that produces seeds used for the creation of energy drinks, pre-workouts, and energizing and antioxidant food supplements. Let's see all the properties, benefits and some curiosities about guarana.",
    "imageUrl": "https://www.yamamotonutrition.com/media//magefan_blog/head/987-card.jpg"
  },
  {
    "title": "How to deal with psychophysical, work and emotional stress",
    "url": "https://www.yamamotonutrition.com/int/blog/post/how-to-deal-with-psychophysical-work-and-emotional-stress-a1793",
    "category": "health",
    "author": "Author: Gabriele Trapani",
    "excerpt": "In modern life efficiency and productivity are the order of the day, imposing rhythms of life difficult to maintain with psychophysical and emotional stress not indifferent. There are, however, a series of natural substances with a strong nootropic connotation and able to support us in the most challenging moments.",
    "imageUrl": "https://www.yamamotonutrition.com/media//magefan_blog/head/1793-card.jpg"
  },
  {
    "title": "Creatine: the queen of performance supplements",
    "url": "https://www.yamamotonutrition.com/int/blog/post/creatine-the-queen-of-performance-supplements-a1768",
    "category": "bodybuilding",
    "author": "Author: Carmine Orlandi",
    "excerpt": "Can creatine supplementation really improve athletic performance? After years of studies, it can be said that creatine supplementation can accompany and modify metabolic adaptations following exercise.",
    "imageUrl": "https://www.yamamotonutrition.com/media//magefan_blog/head/1768-card.jpg"
  },
  {
    "title": "WADA, the World Anti-Doping Agency - actions and directives",
    "url": "https://www.yamamotonutrition.com/int/blog/post/wada-the-world-anti-doping-agency-actions-and-directives-a1976",
    "category": "endurance",
    "author": "Author: Carmine Orlandi",
    "excerpt": "That of the substances to be used to improve sports performance is not a recent problem: for centuries man has been in search of the miraculous substance to enhance performance. Thus WADA was born, to coordinate the fight against doping in sport. Let's find out together what it is and the main prohibited substances!",
    "imageUrl": "https://www.yamamotonutrition.com/media//magefan_blog/head/1976-card.jpg"
  },
  {
    "title": "The diseases of well-being",
    "url": "https://www.yamamotonutrition.com/int/blog/post/the-diseases-of-well-being-a1975",
    "category": "health",
    "author": "Author: Massimiliano Febbi",
    "excerpt": "Economic prosperity and the improvement of the quality of life can be seen as a natural process of evolution: however, it leads to an increase in the incidence of various diseases, which can be defined as 'diseases of well-being'. But what are they? And how can we reduce the risk of developing them? Find out with us in this article.",
    "imageUrl": "https://www.yamamotonutrition.com/media//magefan_blog/head/1975-card.jpg"
  },
  {
    "title": "Beta-Alanine: A supplement to support resistance",
    "url": "https://www.yamamotonutrition.com/int/blog/post/beta-alanine-a-supplement-to-support-resistance-a1982",
    "category": "endurance",
    "author": "Author: Federica Federici",
    "excerpt": "In the context of sports supplementation we frequently hear of Beta-Alanine supplementation. But what does this amino acid do? For which categories of sportsmen is it really essential? And does it really help to increase endurance in endurance sports? Let's find out together!",
    "imageUrl": "https://www.yamamotonutrition.com/media/magefan_blog/ART_6_42.jpg"
  },
  {
    "title": "Dehydration and mineral salts: role and functions",
    "url": "https://www.yamamotonutrition.com/int/blog/post/dehydration-and-mineral-salts-role-and-functions-a1938",
    "category": "health",
    "author": "Author: Massimiliano Febbi",
    "excerpt": "Hydration has always played an important role in sports performance, injury prevention and recovery after training sessions or competitions, both for athletes involved in sports or competitive competitions and at an amateur level. It is extremely important that athletes and coaches understand the risks of dehydration and how to replenish the water and mineral salts lost with sports performance in the right quantities.",
    "imageUrl": "https://www.yamamotonutrition.com/media/magefan_blog/ART_1_2.jpg"
  },
  {
    "title": "Cycling nutrition",
    "url": "https://www.yamamotonutrition.com/int/blog/post/cycling-nutrition-a1978",
    "category": "endurance",
    "author": "Author: Carmine Orlandi",
    "excerpt": "What are the skills required for an endurance athlete? And how to improve the cyclist's body composition to get the most out of performance? Dr. Carmine Orlandi, sports nutritionist of our team of experts, tells us about it.",
    "imageUrl": "https://www.yamamotonutrition.com/media/magefan_blog/ART_3_13.jpg"
  },
  {
    "title": "The secret of youthfulness for quality ageing",
    "url": "https://www.yamamotonutrition.com/int/blog/post/the-secret-of-youthfulness-for-quality-ageing-a1977",
    "category": "active ingredients",
    "author": "Author: Federica Federici",
    "excerpt": "The secret of youth? The answer for us is very simple: being able to live every moment of life to the full. How do we do this? By taking care of ourselves through prevention, because the way we live really does make a difference. Discover in this article all the secrets to quality ageing.",
    "imageUrl": "https://www.yamamotonutrition.com/media//magefan_blog/head/1977-card.jpg"
  }
]