[
  {
    "title": "Ashwagandha: a valuable ally against stress",
    "author": "ACHZOD",
    "date": "October 18, 2022",
    "category": "supplements and nutraceuticals",
    "fullContent": "One of the phytotherapeutic nutraceutical elements that have fascinated me most in recent years is the Ashwagandha (or Withania somnifera, but also called \"Indian Ginseng\") one of the most powerful herbs in Ayurvedic medicine of which I was among the very first to talk about it in Italy.\n\nIn Sanskrit, Ashwagandha means \"horse smell\", referring to its conferring \"the strength and vigor of a stallion\". Used for millennia in Ayurvedic medicine, ashwagandha is regarded as a \"Rasayana\", a tonic for restoring and maintaining health and promoting longevity. It is attributed known and effective anxiolytic, hypotensive, pain-relieving and antioxidant properties, as well as being used to treat problems related to impotence and infertility.\n\nToday it has come to be increasingly known and appreciated also by the modern \"stressed\" and adrenaline-fueled Western world, as an \"adaptogen\" par excellence capable of increasing the body's ability to manage and respond to stressors of various kinds, able to give relief ,  to counter the states of anxiety, to promote relaxation, and mental clarity in case of chronic psychophysical fatigue. The merit of these powerful adaptogenic properties derives from its composition of bioactive elements in the form of steroid lactones, in this case of \"withanolides\". First of all \"witaferin A\", its most powerful active ingredient of this extraordinary medicinal plant to which the differentanti-inflammatory, cardioprotective, especially neuroprotective activities, and at the level of the immune system. \n\nBut its action most recognized and confirmed by research is that on the discourse of the health of the brain, the nervous system and the neurocognitive landscape which extends its potential range of action from only support to anxiety and stress states. This \"cousin\" of the tomato improves brain health and function in several ways, such as enhancing the \"binding\" efficacy of GABA and serotonin receptors in the brain. It seems to act in an interesting way on the receptors of neurons, allowing GABA to connect more easily, and thus inhibit the signals present from the stress response. Tonic-adaptogen therefore par excellence that improves cognitive and psychomotor performance (in a healthy brain), with a particular \"antiaging\" effect on the axons and dendrites of brain nerve cells, which favors synapses, the junctions in which nerve cells communicate.\n\nWe also know that chronic stress and cortisol can damage the brain over time by altering neural networks. Cortisol creates a domino effect that crosses the \"software\" connection between the hippocampus and the amygdala, the area responsible for your fight or flight response that remains in \"permanent alert\", even when not needed, or it takes very little to activate it and have a non-proportional response. Here the Ashwagandha arrives to intervene precisely to restore those physiological balances and \"quell the threats\" detected when there is no real need.\n\nIf we are experiencing severe fatigue and brain fog (\"brain fog\") especially upon waking, if we are perpetually \"exhausted\" and without strength, if the motivation is on the ground with a fluctuating morale, where anxiety becomes an unpleasant daily burden , Ashwagandha is the most interesting and effective element that oriental phytotherapy has transmitted to us \"today\", and where modern science has already given several confirmations. An extraordinary nutraceutical element that can be of help to anyone going through phases of psychophysical stress, by professionals from various sectors, athletes, soldiers, or anyone who needs to restore \"upstream\" the ability to respond with clarity and efficiency to agents or stressful situations, both mental and physical, as well as knowing how to rest when there is no \"danger \", Putting a brake on cortisol levels, with better balance on those of acetylcholine that will reinvigorate performing so you can think again with clarity, more calmly and improving reaction times.\n\n \n\nSCIENTIFIC REFERENCES\n\nSingh N, Bhalla M, de Jager P, Gilca M. An overview of ashwagandha: a rejuvenating Rasayana of Ayurveda. Afr J Tradit Complement Alternate With. 2011;8(5 Suppl):208-13. doi: 10.4314/ajtcam.v8i5S.9. Epub 2011 Jul 3. PMID:  22754076 ; PMCID: PMC3252722.\n\nMishra LC, Singh BB, Dagenais S. Scientific basis for the therapeutic use of Withania somnifera (ashwagandha): a review. Altern Med Rev. 2000 Aug;5(4):334-46. PMID: 10956379.\n\n Bhattacharya S.K., Bhattacharya A., Sairam K., Ghosal S. “Anxiolytic-antidepressant activity of Withania somnifera glycowithanolides: an experimental study.” Phytomedicine 2000 Dec;7(6):463-9.\n\nSengupta P, Agarwal A, Pogrebetskaya M, Roychoudhury S, Durairajanayagam D, Henkel R. Role of Withania somnifera (Ashwagandha) in the management of male infertility. Reprod Biomed Online. 2018 Mar;36(3):311-326. doi: 10.1016/j.rbmo.2017.11.007. Epub 2017 Dec 7. PMID: 29277366.\n\nKuboyama T, Tohda C, Komatsu K. Effects of Ashwagandha (roots of Withania somnifera) on neurodegenerative diseases. Biol Pharm Bull. 2014;37(6):892-7. doi: 10.1248/bpb.b14-00022. PMID: 24882401.\n\nKuboyama T., Tohda C., Komatsu K. “Neuritic regeneration and synaptic reconstruction induced by withanolide A.” British Journal of Pharmacology 005 Apr;144(7):961-71. \n\nChoudhary M.I., Yousuf S., Nawaz S.A., Ahmed S., Atta-ur-Rahman. “Cholinesterase inhibiting withanolides from Withania somnifera.” Chemical and Pharmaceutical Bulletin (Tokyo) 2004 Nov;52(11):1358-61. \n\nChoudhary D, Bhattacharyya S, Bose S. Efficacy and Safety of Ashwagandha (Withania somnifera (L.) Dunal) Root Extract in Improving Memory and Cognitive Functions. J Diet Suppl. 2017 Nov 2;14(6):599-612. doi: 10.1080/19390211.2017.1284970. Epub 2017 Feb 21. PMID:  28471731 .\n\nPingali U., Pilli R., Fatima N. “Effect of standardized aqueous extract of Withania somnifera on tests of cognitive and psychomotor performance in healthy human participants” Pharmacognosy Res. 2014 Jan-Mar; 6(1): 12–18. \n\n“New evidence that chronic stress predisposes brain to mental illness” University of California, Berkeley Feb. 11, 2014, Retrieved Mar. 24, 2016\n\nChandrasekhar K., Kapoor J., Anishetty S. “A prospective, randomized double-blind, placebo-controlled study of safety and efficacy of a high-concentration full-spectrum extract of ashwagandha root in reducing stress and anxiety in adults.” Indian Journal of Psychological Medicine 2012 Jul;34(3):255-62.\n\nDhuley J.N. “Nootropic-like effect of ashwagandha (Withania somnifera L.) in mice.” Phytotherapy Research 2001 Sep;15(6):524-8. \n\nBhattacharya S.K., Bhattacharya A., Sairam K., “Ghosal S. Anxiolytic-antidepressant activity of Withania somnifera glycowithanolides: an experimental study.” Phytomedicine 2000 Dec;7(6):463-9. ",
    "contentLength": 6764,
    "url": "https://www.yamamotonutrition.com/int/blog/post/ashwagandha-a-valuable-ally-against-stress-a1952",
    "slug": "ashwagandha-a-valuable-ally-against-stress-a1952"
  },
  {
    "title": "Creatine: the queen of performance supplements",
    "author": "ACHZOD",
    "date": "February 28, 2022",
    "category": "bodybuilding",
    "fullContent": "Creatine is part of the guanidine-phosphate family, a protein-free amino acid compound naturally present in several foods, including mainly red meat and fish. Most of the creatine is deposited in skeletal muscle (95%), the rest divided between the brain and testicles. Approximately 2/3 of intramuscular creatine occurs in the form of phospho-creatine (Pcr), the rest as free creatine. It was identified for the first time in 1832 by the French chemist Chevreul but its presence in the flesh was confirmed by the well-known German chemist Von Liebig only in 1847, to which followed in the decade's numerous studies, which do not end yet to produce surprises, studies that saw among the protagonists the Italian school of Margaria.\n\nOf course, a proportion of creatine, chemically \"methyl guanidino acetic acid\", can be synthesized at the liver level, partly also in the kidneys and pancreas, starting from arginine, S-adenosyl-methionine and glycine, Its most well-known physiological functions include the ability to rapidly provide a phosphate molecule in ATP resynthesis from ADP in the known cyclic reaction and thus in energy management in the first seconds of muscle activity.\n\nIt is therefore evident that the availability of Pcr is able to manage muscle energy flows for intense efforts of short duration, the availability of Pcr depends mainly on the activity of the enzyme creatine kinase (CK), muscle stocks (and therefore by total mass) and endogenous synthesis capacity considering that the amount assimilable by food is extremely small. The primary role of creatine, as well as its pleiotropic effect, is linked to the CK/Pcr system, schematically reported in Figure 2.\n\nThe amount of Cr used daily depends on various factors, including the duration and intensity of exercise, the bioavailability of sources of Cr, muscle mass of the athlete, In fact, it has been reported that large athletes are able to consume amounts of Cr equal to 5-10 g/day; in some clinical conditions, it is even 10-30 g/day (Braissant, Wyss et. All).\n\nSupplementation\n\nFor several years it has been hypothesized that increasing the amount of Cr ingested could lead to the advantages caused by the greater availability and therefore an increase in the storage capacity of the same in the muscles given also the demonstration that when the concentration of Cr decreases with the continuation of the exercise, therefore, decreases the ability to keep the intensity constant.\n\nWith a normal diet, it is possible to provide 1-2 g of Cr per day which means saturating the deposits for 60-70%, clearly, a supplementation would not only allow to saturate the deposits at 100% but even increase the capacity of 20-40% also as a result of various strategies of supplementation (Candow, Kreider et all.)\n\nIs Cr’s supplementation really able to improve athletic performance? \n\nCr and its supplementation have been the subject of at least 25 years of a very long and copious series of studies that have led to know many aspects of the biochemistry of the substance and how this is able to accompany and modify metabolic adaptations that follow the exercises, often of very high intensity and load and of particular duration, without considering the very interesting perspectives that are opening in the clinical field but which we will not write on this occasion.\n\nRecommended quantities\n\nThe amount of Cr to be ingested to increase deposits is about 5 g/day for 5-7 days, we speak of CREATINE MONOHYDRATE, the most studied form.\n\nThe quantities of Cr to be administered able to maintain constant maximum quantities of muscle Cr now see a decided sharing indicating 3-5 g/day even for long periods; it is considered a greater need for athletes of large tonnage for which 5-10 g/day. In some studies, it was recommended to start with a short period of loading (in any case not less than 0.3 g/kg bodyweight for 4-5 days) followed by the doses previously recommended.\n\nAdministering Cr monohydrate together with carbohydrates or a mixture of carbohydrates and proteins increases the ability to retain and increase deposits (Steenge, Greenwood). Alternative protocol sees a quantity of 3 g/day for at least 28 consecutive days but the increase in deposits is slow and gradual. It should be considered that once the maximum quantity of deposits has been obtained in case of cessation of supplementation, the return to the starting quantity would take place after 4-6 weeks.\n\nCreatine monohydrate, as mentioned above, the most widely used and studied form, is very stable in solid form, less in aqueous solution in which it remains stable for several hours (the instability manifests with creatinine cyclization which would make it little or nothing assimilatable), the stability increases to the increase of the pH and to the decrease of the temperature of the solution; once ingested the peak of absorption occurs after about 60 minutes. In addition to Creatine Monohydrate, several other forms have been proposed (citrate, ethyl ester, nitrate, buffered and others) but none has been shown to have better properties both in the final result and in the kinetics of absorption.\n\nWhen to take it\n\nRegarding the timing, however, several studies state with a determination that taking Cr post-workout determines better results than pre-workout by analyzing the values of strength and body composition.\n\nAdvantages of supplementation\n\nA copious series of studies has led to having strong evidence in relation to the ability of Cr to provide an energy supplement in a wide range of exercises; clearly different sports disciplines benefit in view of the presence of the different stages in the table that makes up the characteristics of the discipline to be considered.\n\nNext is a summary table that takes into account sports disciplines that bring an advantage from the supplementation of Cr and why prevalent.\n\nAs you can see, several disciplines are involved confirming that the supplementation of Cr is able to increase performance in all athletic conditions and that is both in pure strength and high intensity, continuous and intermittent, as well as in long-term tests.\n\nIn a recent overview of the additional benefits derived from the use of Cr there is a schematic description:\n\nImprovement of recovery\nPrevention of accidents\nIncrease in heat tolerance\nImprovement of rehabilitation from injury\nBrain and column neuroprotection\nSecurity\n\nOne of the most interesting aspects is the safety reported after massive doses of Cr taken for long periods without having any particular side effects. In particular, it is reported that the intake for several years of doses of 0.3-0.8 g per kg/ body weight (equal to 21-56 g for a subject of 70 kg) daily did not result in clinical events or serious side effects.\n\nBeliefs and false myths\n\nThe remarkable fame assumed by the abilities of the Cr has also led, as often happens, to the diffusion of both elements of amazing advantage, never confirmed in such proportions, whereas, on the contrary, alarming data on side effects are likely to compromise certain salient features of specific disciplines, such as the worrying condition of weight gain due to water retention obviously problematic in the disciplines where weight loss is crucial.\n\nNecessary for this purpose to report the final conclusions of a study that has analyzed many scientific publications published on the supplementation of Cr, very illuminating study in this regard:\n\nCr does not lead to water retention\nCr is not an anabolic steroid\nIf taken in the recommended dosages does not result in kidney damage or dysfunction\nMost evidence shows no correlation between Cr use and hair loss\nCr does not cause dehydration and cramps\nThe CR is able to bring the benefits reported safely even in teenagers\nCr does not increase fat mass\nSmall doses of Cr (3-5 g per day) are sufficient to maintain constant maximum amounts of muscle Cr deposits so the load (25 g/day) is usually not useful\nThe supplementation of Cr in combination with counter-resistance training brings considerable advantages to the elderly population; note that in these subjects even the only Cr (without training) is able to bring advantages\nCr is able to bring benefits in a wide variety of sports disciplines\nThe CR is able to bring the same benefits to the female sex throughout life\nNo alternative form of Cr has advantages over creatine monohydrate.\n\nIn conclusion, the Cr is becoming increasingly important as a substance of considerable interest for the most varied aspects in the various sports disciplines not excluded clinical aspects which, increasingly, go beyond the sporting needs and for which, However, scientific evidence is now assuming unequivocal proportions.\n\nBibliography\n\nBraissant O, et al. Creatine deficiency syndromes and the importance of creatine synthesis in the brain. Amino Acids.\n\nWyss M, et al. Creatine and creatine kinase in health and disease–a bright future ahead? Subcell Biochem. 2007;46:309–34.2011;40(5):1315–24.\n\nCandow DG, Chilibeck PD. Potential of creatine supplementation for improving aging bone health. J Nutr Health Aging. 2010;14(2):149–53.\n\nKreider RB. Effects of creatine supplementation on performance and training adaptations. Mol Cell Biochem. 2003;244(1–2):89–94.\n\nSteenge GR, Simpson EJ, Greenhaff PL. Protein- and carbohydrate-induced augmentation of whole body creatine retention in humans. J Appl Physiol (1985). 2000;89(3):1165–71.\n\nGreenwood M, et al. Differences in creatine retention among three nutritional formulations of oral creatine supplements. J Exerc Physiol Online. 2003;6(2):37–43.\n\nKreider RB, Kalman DS, Antonio J, Ziegenfuss TN, Wildman R, Collins R, Candow DG, Kleiner SM, Almada AL, Lopez HL. International Society of Sports Nutrition position stand: safety and efficacy of creatine supplementation in exercise, sport, and medicine. J. Int. Soc. Sports Nutr. 2017;14:18-z eCollection 2017.\n\nAntonio, J., Candow, D.G., Forbes, S.C. et al. Common questions and misconceptions about creatine supplementation: what does the scientific evidence really show?. J Int Soc Sports Nutr 18, 13 (2021)",
    "contentLength": 10116,
    "url": "https://www.yamamotonutrition.com/int/blog/post/creatine-the-queen-of-performance-supplements-a1768",
    "slug": "creatine-the-queen-of-performance-supplements-a1768"
  },
  {
    "title": "Dehydration and mineral salts: role and functions",
    "author": "ACHZOD",
    "date": "June 01, 2023",
    "category": "nutrition and well being",
    "fullContent": " \n\nHydration has always played an important role in sports performance, injury prevention and recovery after training sessions or competitions, both for athletes engaged in competitive sports or competitions and at an amateur level . Therefore, it is extremely important that both coaches and athletes clearly understand the mechanisms and physiology of this mechanism, in order to improve the hydration needs of sportsmen for preventive but also for lending purposes.\n\nLet's start from the basics: in a sedentary subject the daily water exchange is around 2.5 liters (between entries and exits), but the liquids that actually circulate in the entire digestive system amount to approximately 9 litres. When it comes to athletes these quantities vary considerably and the demands for liquids have increased, obviously due to an increase in outings, above all in the form of sweat. These losses must be adequately compensated by an increase in revenue, in order not to risk incurring problems and repercussions (which we will discuss later).\n\nThe quantity of water to be reintegrated then varies according to individual characteristics, the intensity and quantity of muscular work and, above all, in relation to climatic conditions. It is therefore not possible to establish a priori the needs of the individual subject, which are strictly personal.\n\nPhysiology and mechanisms of the state of hydration\n\n\nHowever, it is important to always keep in mind some physiological aspects, which allow us to better understand how the state of hydration of the individual works: body water represents approximately 60% of the total body weight in an adult man (therefore more than half of the number that we see on the scale when we weigh ourselves). The amount of intracellular water (also technically called ICW - Intra Cellular Water ) amounts to 2/3 of the total body water (66%), while the extracellular water content (which is indicated instead as ECW - Extra Cellular Water ) amounts to 1/3 of the total body water (or Total Body Water -TBW ) and represents 35%.\n\nBroadly speaking, the water requirement of a person who performs physical activity is about 1 ml for each calorie of energy expenditure . If physical activity exceeds 2 hours, dehydration can even reach 5% of body weight: a value far too high to be underestimated, and which can also lead to serious complications if not promptly reintegrated. This lack of liquids must therefore be adequately and promptly rebalanced; otherwise it creates the conditions for a rapid deterioration of the athlete's performance.\n\nRespect for the choice of hypo- or isotonic solutions and the use of any targeted supplementation is necessary to avoid that a significant quantity of pure water also leads to the dilution of extracellular fluids. This could in fact determine, thanks to the action of the pituitary gland, the secretion (i.e. the production and secretion) of adiuretin, a hormone also known as \"vasopressin\", with consequent elimination of excess fluids, but which also entails unpleasant consequences for a athlete.\n\nIn general, the lack of liquids and consequently of salts, especially in humid and hot conditions, is signaled by symptoms such as nausea, vomiting, dizziness and general tiredness, as well as by a significant impairment of performance . If you insist on continuing to exercise despite the onset of symptoms, you may experience muscle cramps and difficulty concentrating. To correctly calculate the quantity of substances to be replenished, it is necessary to remember some concepts, linked to the definition of osmolarity, which we report below.\n\nThe term osmolarity refers to a physical quantity that measures the concentration of solutions, and its value expresses precisely the concentration of the solution under examination. Under normal conditions, the osmolarity is identical for all the fluids present in the various compartments of the organism (which can be divided into intra and extra cellular) The volume of extracellular fluid is generally estimated at 0.255 l/Kg of body weight , and the factor The main factor that regulates the distribution of body water between the extracellular (EC) and intracellular (IC) districts is the osmotic pressureof the liquids themselves. Osmotic pressure is defined as that pressure that exactly balances the movement of the solvent generated by the difference in solute concentration between 2 concentrations. In the extracellular compartment sodium is more important , while in the intracellular compartment potassium prevails .\n\nThe importance of a correct interpretation of the osmolarity becomes fundamental in the preparation of a solution that has to replenish energy and mineral salts in the athlete . First of all, it is necessary to identify the goal, i.e. if you aim for a rapid replenishment of water or if you want a quick energy intake, which can be used quickly by the body.\n\nIntegration of mineral salts\n\nAt a supplementary level, two well-known minerals certainly play a fundamental role: magnesium potassium . Magnesium helps support physiological muscle function, contributes to the reduction of tiredness and fatigue, supports energy metabolism and contributes to the normal functioning of the nervous system. Potassium helps to support physiological muscle function, promotes the maintenance of normal blood pressure and also contributes to the functioning of the nervous system. In some situations, sodium supplementation may also be necessarywhen it is not possible to cover the increase in needs with diet alone (generally sufficient) or following extreme sweating not followed by adequate recovery. In fact, sodium participates in the transmission of nerve impulses, regulates the permeability of membranes and contributes to the maintenance of water balance.\n\nAs regards the concentration levels of the solutions, these can be divided into Isotonic and Hypertonic , based on the assimilation times by the intestine. An isotonic solution (with osmotic pressure equal to that of plasma) also guarantees a rapid transit through the stomach, just slower than that of pure water.\n\nOn the other hand, a hypertonic solution, i.e. with an osmotic pressure higher than that of the plasma, remains longer in the stomach and, once it reaches the intestinal lumen due to the high osmolarity, it recalls a considerable quantity of liquids from the mucosa (theft of water) . This subtraction of water damages the entire body, worsening any state of dehydration, causing diarrhea and, in any case, limiting athletic performance.\n\nAt the beginning of physical exercise, water is transferred from the blood plasma (ECW) to the interstitial and intracellular spaces: the metabolites begin to accumulate in and around the muscle fibres; the osmotic pressure at these sites is rising and attracts water. By increasing muscle activity, a rise in blood pressure is obtained, with an \"extravasation\" of water from the vascular compartment, often associated with an increase in sweating: essentially, from all these effects due to increased physical activity, muscles acquire water at the expense of plasma volume.\n\nOn the other hand, the reduction of plasma volume results in:\n\nReduction of blood pressure;\nReduction of blood flow to the epidermis;\nReduction of blood flow to the muscles.\nRisks of dehydration\n\nEven modest dehydration (equal to 1% of body weight), caused by sweating during physical exercise, can increase cardiovascular work by increasing HR (heart rate) and thus reducing the body's ability to thermoregulate.\n\nExcessive sweating and/or urinary urination could also be a consequence of the large loss of electrolytes, which could lead to the development of serious repercussions, such as cardiac dysrhythmias. All this even though Costill, a famous sports physiologist, observed that the uniform loss of electrolytes, even if considerable, derives mainly from the ECW compartment, and therefore the loss of ions by sweating and urinating would translate into small effects on the ion content K+ in the muscle cell.\n\nAlso not to be overlooked is the influence of dehydration on our immune defences. This effect, also known as the \"open window effect\", derives from the fact that after physical exercise, the immune system is busy healing the micro-lesions of the muscles and cells, formed as a result of training. This is why, together with hydration, during and after performance, an athlete must remember to keep the intestines protected as well. In fact, his entire health depends on it: for the intestine to be less \"permeable\" to attacks by pathogens, supplements such as zinc and Vitamin C perform an excellent antioxidant action to protect cells from oxidative stress induced by intense physical activity, and thus supporting the physiological defenses of the\n\n\nBIBLIOGRAPHY\n\nMcARDLE W. D, KATCH FI, KATCH VL \"Physiology applied to SPORT\". Casa Editrice Ambrosiana, Milan, 1998.\n\nOPPLIGER RA, CASE HS, HORSWILL CA et al. “Weight Loss in Wrestlers,” American College of Sports Medicine Official Position. Medicine and Science in Sports and Exercise. Vol. 28, No. 2. 1996\n\nROEMMICH JN, SINNING WE “Weight loss and wrestling training: effects or nutrition, maturation, body composition and strength”. Journal of Applied Physiology 82 : 1751-1759, 1997.\n\nTIMPMANN S., OOPIK V. “The influence of body weight reduction on combat sport performance“. Athlon 10/2005, 1-2/2006.\n\nWILMORE J. H. “Weight Category Sports“; Parte 4, Cap. 49, in MAUGHAN R.J. “Nutrition in Sport“ , Volume VII of the Encyclopaedia of Sports Medicine, in collaboration with the International Federation of Sports Medicine. Blackwell Science, 2002.\n\nDamir Zubac, Armin Paravlic, Reid Reale, Igor Jelaska, Shawnda A Morrison, Vladimir IvancevEur J Nutr. 2019 Mar;58(2):497-514. Fluid balance and hydration status in combat sport Olympic athletes: a systematic review with meta-analysis of controlled and uncontrolled studies.\n\nShirreffs SM et al. 2005, The sweating response of elite professional soccer players to training in the heat. Int. J. Sport. Med. 26 (2): 90-5.\n\nMaughan, R. 2006. Guidelines for replacing fluid and CHO during exercice. In: Clinical sport nutrition-McGraw Hill.\n\nR. J. Maughan, S. M. Shirreﬀs; Scand J Med Sci Sports 2010: 20 (Suppl. 2): 59–69. Development of hydration strategies to optimize performance for athletes in high-intensity sports and in sports with repeated intense efforts.\n\nN.A. Masento, M. Golightly , D.T. Field, L.T. Butler and C.M. van Reekum; British journal of nutrition, January 2014, Effects of hydration status on cognitive performance and mood.\n\n ",
    "contentLength": 10612,
    "url": "https://www.yamamotonutrition.com/int/blog/post/dehydration-and-mineral-salts-role-and-functions-a1938",
    "slug": "dehydration-and-mineral-salts-role-and-functions-a1938"
  },
  {
    "title": "WADA, the World Anti-Doping Agency - actions and directives",
    "author": "ACHZOD",
    "date": "April 18, 2023",
    "category": "sport",
    "fullContent": "That of the substances to be used to improve sports performance is not a recent problem , even Hippocrates and Galen spoke of it in 400 BC and since then, depending on the importance of the competition, scientists, sorcerers, gurus and hucksters of all kinds have alternated , always and in any case in search of \"miraculous\" substance.\n\nObviously mostly these substances variously included in the athletes' programs very often have caused various and, in some cases, considerable health problems for the unfortunate people who used them. To this end, the need was felt to exercise control over the use of these substances and also of some methods that often accompanied the administration of the aforementioned; above all it was necessary to harmonize the classification of the substances to be prohibited with procedures valid for all the nations whose athletes were sent to the various competitions and, above all, to create a super-partes structure capable of controlling these activities and issuing updated classifications every year, and so was born thereWADA .\n\nWhat is WADA?\n\nThe World Anti-Doping Agency, in English World Anti-Doping Agency (WADA) , is a foundation with mixed public-private participation, created by the will of the International Olympic Committee on November 10, 1999 in Lausanne, to coordinate the fight against doping in sport . In 2002, its headquarters were moved to Montreal, Canada, although legally it remains a private law foundation, governed by Swiss civil law. WADA is therefore an international organization that delegates the work to individual nations and national anti-doping organizations (NADO), monitoring their work so that it complies with the World Anti-Doping Code. Furthermore, WADA accredits approx30 laboratories that carry out the scientific analyzes necessary for anti-doping control .\n\nThe WADA World Anti-Doping Code is a document drawn up in order to bring anti-doping regulations into compliance in all sports and, more importantly, in all countries . Contains a list , updated every year, of prohibited substances and methods that athletes cannot use . It was adopted by sports organizations in 2004, before the Athens Olympic Games. In November 2007, at the Third World Conference on Doping in Sport, more than 650 sports organizations (international sports federations, national anti-doping organisations, the IOC, the International Paralympic Committee and various professional federations from around the world) unanimously adopted a Code revision, effective January 1, 2009.\n\nThe WADA Prohibited List of Substances and Methods (WADA List) is the document identified as the International Standard for identifying substances and methods prohibited in sport . The WADA List is one of the most important components for the global harmonization of the worldwide anti-doping movement. Divided into categories, it identifies which substances and methods are prohibited In Competition, Out of Competition and in Particular Sports .\n\nThe WADA List is updated annually following an extensive consultation process coordinated by WADA and comes into force on 1 January each year. In our country, WADA rules are managed by NADO Italy - National Anti-Doping Organization (NADO) -, functional division of the World Anti-Doping Agency WADA, which has exclusive responsibility for the adoption of anti-doping sports rules in accordance with the World Anti-Doping Code ( WADA Code) to which it is a signatory.\n\nKEY ROLES AND RESPONSIBILITIES OF ATHLETES\n\nIt is the personal responsibility of each Athlete:\n\n- be aware of having to comply with the Sports Anti-Doping Rules (NSA) and know the obligations deriving from them;\n\n- always be available for the collection of a biological sample;\n\n- personally answerable for the use or intake of anything in the anti-doping context;\n\n- inform medical personnel of the prohibition of using prohibited substances and resorting to prohibited methods and ensure that any medical treatment received does not violate the NSA;\n\n- report to NADO Italy and its International Federation any decision made by a non-Signatory on an Athlete who has committed an anti-doping rule violation in the previous ten (10) years;\n\n- cooperate with Anti-Doping Organizations involved in the investigation of anti-doping law violations;\n\n- disclose the identity of your Support Personnel at the request of NADO Italy, a National Sports Federation, or any other Anti-Doping Organization having authority over the Athlete\n\nKEY ROLES AND RESPONSIBILITIES OF ATHLETE SUPPORT PERSONNEL\n\nIt is the personal responsibility of all Athlete Support Personnel to:\n\n- be aware of having to comply with the NSAs and know the obligations deriving from them;\n\n- collaborate in the implementation of anti-doping controls placed on the Athlete;\n\n- use one's influence on the Athlete, promoting values ​​and behaviors in contrast to doping;\n\n- report to NADO Italy and its International Federation any decision made by a non-Signatory on who has committed an anti-doping rule violation in the previous ten (10) years;\n\n- cooperate with Anti-Doping Organizations involved in the investigation of anti-doping law violations.\n\nAthlete Support Personnel must not use or possess any prohibited substance or employ any prohibited method, without valid justification.\n\nCLASSIFICATION OF SUBSTANCES\n\nWADA has classified the substances \" prohibited \" in sport using classic and clearly understandable methods. Here is a simple overview:\n\nSUBSTANCES AND METHODS ALWAYS PROHIBITED\nUnapproved substances\nAnabolic agents\nPeptide hormones, growth factors, related substances and analogues\nBeta-2 agonists\nHormones and metabolic modulators\nDiuretics and masking agents\nProhibited methods (e.g. transfusion of homologous substances – autohemo transfusion_ and of heterologous substances. Any form of intravascular manipulation, regardless of the substance introduced; etc.\nSUBSTANCES AND METHODS PROHIBITED DURING COMPETITIONS\nStimulants (specific and non-specific)\nNarcotics\nCannabinoids (except Cannabidiol CBD)\nGlucocorticoids\nSUBSTANCES PROHIBITED IN PARTICULAR SPORTS (* )\nBeta blockers\n(*) Archery; motoring; darts, billiards; golf; mini-golf; each type of shot; extreme ski events; underwater sports\nConclusions\n\nHowever, the fight against doping is constantly evolving, an update is presented every year capable of assimilating all the new substances that are gradually introduced in order to increase all phases of physical exercise almost always regardless of the protection of the health of the athletes.\n\n                                                                               Carmine Orlandi",
    "contentLength": 6644,
    "url": "https://www.yamamotonutrition.com/int/blog/post/wada-the-world-anti-doping-agency-actions-and-directives-a1976",
    "slug": "wada-the-world-anti-doping-agency-actions-and-directives-a1976"
  }
]
