[
  {
    "title": "Ashwagandha: a valuable ally against stress",
    "author": "ACHZOD",
    "date": "October 18, 2022",
    "category": "supplements and nutraceuticals",
    "fullContent": "One of the phytotherapeutic nutraceutical elements that have fascinated me most in recent years is the Ashwagandha (or Withania somnifera, but also called \"Indian Ginseng\") one of the most powerful herbs in Ayurvedic medicine of which I was among the very first to talk about it in Italy.\n\nIn Sanskrit, Ashwagandha means \"horse smell\", referring to its conferring \"the strength and vigor of a stallion\". Used for millennia in Ayurvedic medicine, ashwagandha is regarded as a \"Rasayana\", a tonic for restoring and maintaining health and promoting longevity. It is attributed known and effective anxiolytic, hypotensive, pain-relieving and antioxidant properties, as well as being used to treat problems related to impotence and infertility.\n\nToday it has come to be increasingly known and appreciated also by the modern \"stressed\" and adrenaline-fueled Western world, as an \"adaptogen\" par excellence capable of increasing the body's ability to manage and respond to stressors of various kinds, able to give relief ,  to counter the states of anxiety, to promote relaxation, and mental clarity in case of chronic psychophysical fatigue. The merit of these powerful adaptogenic properties derives from its composition of bioactive elements in the form of steroid lactones, in this case of \"withanolides\". First of all \"witaferin A\", its most powerful active ingredient of this extraordinary medicinal plant to which the differentanti-inflammatory, cardioprotective, especially neuroprotective activities, and at the level of the immune system. \n\nBut its action most recognized and confirmed by research is that on the discourse of the health of the brain, the nervous system and the neurocognitive landscape which extends its potential range of action from only support to anxiety and stress states. This \"cousin\" of the tomato improves brain health and function in several ways, such as enhancing the \"binding\" efficacy of GABA and serotonin receptors in the brain. It seems to act in an interesting way on the receptors of neurons, allowing GABA to connect more easily, and thus inhibit the signals present from the stress response. Tonic-adaptogen therefore par excellence that improves cognitive and psychomotor performance (in a healthy brain), with a particular \"antiaging\" effect on the axons and dendrites of brain nerve cells, which favors synapses, the junctions in which nerve cells communicate.\n\nWe also know that chronic stress and cortisol can damage the brain over time by altering neural networks. Cortisol creates a domino effect that crosses the \"software\" connection between the hippocampus and the amygdala, the area responsible for your fight or flight response that remains in \"permanent alert\", even when not needed, or it takes very little to activate it and have a non-proportional response. Here the Ashwagandha arrives to intervene precisely to restore those physiological balances and \"quell the threats\" detected when there is no real need.\n\nIf we are experiencing severe fatigue and brain fog (\"brain fog\") especially upon waking, if we are perpetually \"exhausted\" and without strength, if the motivation is on the ground with a fluctuating morale, where anxiety becomes an unpleasant daily burden , Ashwagandha is the most interesting and effective element that oriental phytotherapy has transmitted to us \"today\", and where modern science has already given several confirmations. An extraordinary nutraceutical element that can be of help to anyone going through phases of psychophysical stress, by professionals from various sectors, athletes, soldiers, or anyone who needs to restore \"upstream\" the ability to respond with clarity and efficiency to agents or stressful situations, both mental and physical, as well as knowing how to rest when there is no \"danger \", Putting a brake on cortisol levels, with better balance on those of acetylcholine that will reinvigorate performing so you can think again with clarity, more calmly and improving reaction times.\n\n \n\nSCIENTIFIC REFERENCES\n\nSingh N, Bhalla M, de Jager P, Gilca M. An overview of ashwagandha: a rejuvenating Rasayana of Ayurveda. Afr J Tradit Complement Alternate With. 2011;8(5 Suppl):208-13. doi: 10.4314/ajtcam.v8i5S.9. Epub 2011 Jul 3. PMID:  22754076 ; PMCID: PMC3252722.\n\nMishra LC, Singh BB, Dagenais S. Scientific basis for the therapeutic use of Withania somnifera (ashwagandha): a review. Altern Med Rev. 2000 Aug;5(4):334-46. PMID: 10956379.\n\n Bhattacharya S.K., Bhattacharya A., Sairam K., Ghosal S. “Anxiolytic-antidepressant activity of Withania somnifera glycowithanolides: an experimental study.” Phytomedicine 2000 Dec;7(6):463-9.\n\nSengupta P, Agarwal A, Pogrebetskaya M, Roychoudhury S, Durairajanayagam D, Henkel R. Role of Withania somnifera (Ashwagandha) in the management of male infertility. Reprod Biomed Online. 2018 Mar;36(3):311-326. doi: 10.1016/j.rbmo.2017.11.007. Epub 2017 Dec 7. PMID: 29277366.\n\nKuboyama T, Tohda C, Komatsu K. Effects of Ashwagandha (roots of Withania somnifera) on neurodegenerative diseases. Biol Pharm Bull. 2014;37(6):892-7. doi: 10.1248/bpb.b14-00022. PMID: 24882401.\n\nKuboyama T., Tohda C., Komatsu K. “Neuritic regeneration and synaptic reconstruction induced by withanolide A.” British Journal of Pharmacology 005 Apr;144(7):961-71. \n\nChoudhary M.I., Yousuf S., Nawaz S.A., Ahmed S., Atta-ur-Rahman. “Cholinesterase inhibiting withanolides from Withania somnifera.” Chemical and Pharmaceutical Bulletin (Tokyo) 2004 Nov;52(11):1358-61. \n\nChoudhary D, Bhattacharyya S, Bose S. Efficacy and Safety of Ashwagandha (Withania somnifera (L.) Dunal) Root Extract in Improving Memory and Cognitive Functions. J Diet Suppl. 2017 Nov 2;14(6):599-612. doi: 10.1080/19390211.2017.1284970. Epub 2017 Feb 21. PMID:  28471731 .\n\nPingali U., Pilli R., Fatima N. “Effect of standardized aqueous extract of Withania somnifera on tests of cognitive and psychomotor performance in healthy human participants” Pharmacognosy Res. 2014 Jan-Mar; 6(1): 12–18. \n\n“New evidence that chronic stress predisposes brain to mental illness” University of California, Berkeley Feb. 11, 2014, Retrieved Mar. 24, 2016\n\nChandrasekhar K., Kapoor J., Anishetty S. “A prospective, randomized double-blind, placebo-controlled study of safety and efficacy of a high-concentration full-spectrum extract of ashwagandha root in reducing stress and anxiety in adults.” Indian Journal of Psychological Medicine 2012 Jul;34(3):255-62.\n\nDhuley J.N. “Nootropic-like effect of ashwagandha (Withania somnifera L.) in mice.” Phytotherapy Research 2001 Sep;15(6):524-8. \n\nBhattacharya S.K., Bhattacharya A., Sairam K., “Ghosal S. Anxiolytic-antidepressant activity of Withania somnifera glycowithanolides: an experimental study.” Phytomedicine 2000 Dec;7(6):463-9. ",
    "contentLength": 6764,
    "url": "https://www.yamamotonutrition.com/int/blog/post/ashwagandha-a-valuable-ally-against-stress-a1952",
    "slug": "ashwagandha-a-valuable-ally-against-stress-a1952"
  },
  {
    "title": "Beta-Alanine: A supplement to support resistance",
    "author": "ACHZOD",
    "date": "July 11, 2023",
    "category": "sport",
    "fullContent": "Beta-Alanine: The Endurance Supplement\n\nBeta -Alanine is a non-essential amino acid , which our body is able to produce independently to meet organic needs. To date, this amino acid is known and used above all as an ergogenic supplement due to its effects on performance, but in reality its characteristics allow us to exploit it to improve various types of resistance , both when we talk about aerobic and anaerobic endurance. Let's discover together all the properties of this very interesting amino acid.\n\nBeta-alanine: functions and effects\n\nUnlike other supplements, Beta-Alanine can boast many studies to support its effectiveness: when used as a food supplement in sports it is really useful , and its intake has various benefits for the athlete .\n\nFirst of all, Beta-Alanine acts as a \" buffer \", ie as a buffer to limit and counteract the acidity produced by muscle contraction (acidosis). When we practice high-intensity physical activity, there is in fact an increase in the production of hydrogen ions (H+): if these ions accumulate in the muscle cells, the cellular pH is consequently decreased, creating an acidic environment that can compromise muscle contraction, thus increasing our perception of fatigue . Substances that, like Beta-Alanine, are defined as buffers or tampons act by delaying this very process and slowing down the onset of post-exercise tiredness.\n\nBut how does Beta-Alanine work at the molecular level? The buffering effect is actually an indirect consequence of the activity of this amino acid. In fact, Beta-Alanine combines organically with Histidine , forming a dipeptide known as Carnosine . Carnosine is a non-protein nitrogenous compound, which is deposited in our body mostly in the muscles, where it performs its function as a muscle buffer , balancing the pH of the muscle under stress and prolonging its work capacity.\n\nBut if Carnosine is the real muscle buffer, why take Beta-Alanine? The answer is to be found in the bioavailability of Beta-Alanine, decidedly greater than that of Carnosine, which when integrated easily undergoes degradation and therefore remains \"less usable\".\n\nWhere to find Beta-Alanine and recommended doses\n\nIt is not possible to find Beta-Alanine as a free molecule in foods, but it is possible to obtain it in the form of a dipeptide (Carnosine) above all by consuming meat and fish , therefore foods of animal origin. Those who follow a vegetarian and vegan diet will therefore have a lower amount of Carnosine in their muscles than those who follow an omnivorous diet. In order to achieve the necessary requirements for improving resistance parameters, athletes often resort to dietary supplementation of Beta-Alanine, as a single molecule or as a component of pre-workout supplements. However, the effects of this molecule are appreciable in the chronic (long-term) way: in fact, at least 4 weeks of intake are necessaryto saturate the stocks of Carnosine inside the muscle, taking from 2 to 6g of Beta-Alanine per day (even when not training).\n\nEfficacy of Beta-Alanine as a Performance Supplement\n\nThe efficacy of Beta-Alanine has been demonstrated for efforts of at least 30 seconds , a relatively short time frame (when compared to endurance activities). In this sense, Beta-Alanine can also prove to be really useful for those who practice strength training in the weight room, especially if the activity involves performance of resistant strength and muscle endurance (the muscle's ability to resist under load over time). It is therefore easy to deduce for which type of sportsmen Beta-Alanine is truly indispensable: we are talking about all those athletes called to carry out intense efforts, prolonged and which can generate high levels of catabolites (the \"waste products\" such as lactic acid or hydrogen ion). Cyclists, runners, calisthenics athletes or even team sports such as Calcium, basketball or volleyball. In fact, by enhancing anaerobic resistance, it delays the onset of tiredness and fatigue , allowing the athlete to perform more work and more repetitions.\n\nHow to take and side effects of Beta-Alanine\n\nDespite the proven efficacy and safety of this supplement, a \" side \" effect linked to the intake of Beta-Alanine is the sensation of tingling (or itching) which occurs a few minutes after ingestion. Known as paresthesia , this sensation is fully reversible and reduces with continued use of the amino acid. Per some it can be annoying: one way to reduce or avoid it is to divide the overall intake into 2-3 daily intakes, preferably after meals.\n\nConclusions\n\nBeta-Alanine has been shown to effectively support performance during high-intensity exercise by buffering skeletal muscle pH and consequently delaying lactic acid-induced muscular acidosis. This translates into better strength and sprint performance , with greater contrast to the onset of fatigue and more endurance . It is therefore useful in cycling, athletics, cross-training, but also in many team and outdoor sports. In conclusion, we can without fear define it as a supplement in the service of resistance .\n\nBibliography\n\nSaunders B et al. β-alanine supplementation to improve exercise capacity and performance: a systematic review and meta-analysis. Br J Sports Med. 2017 Apr;51(8):658-669.\n\nHobson RM et al. Effects of β-alanine supplementation on exercise performance: a meta-analysis. Amino Acids. 2012 Jul;43(1):25-37.\n\nDankel SJ et al. Do metabolites that are produced during resistance exercise enhance muscle hypertrophy? Eur J Appl Physiol. 2017 Nov;117(11):2125-2135.\n\nIraki J et al. Nutrition recommendations for bodybuilders in the off-season: A narrative review. Sports. 2019;7,154.\n\nHoffman J et al. Effect of creatine and beta-alanine supplementation on performance and endocrine responses in strength/Energy athletes. Int J Sport Nutr Exerc Metab. 2006 Aug;16(4):430-46.\n\nLiu Q et al. Mechanisms of itch evoked by beta-alanine. J Neurosci. 2012;(32):14532-14537.",
    "contentLength": 5954,
    "url": "https://www.yamamotonutrition.com/int/blog/post/beta-alanine-a-supplement-to-support-resistance-a1982",
    "slug": "beta-alanine-a-supplement-to-support-resistance-a1982"
  },
  {
    "title": "Creatine: the queen of performance supplements",
    "author": "ACHZOD",
    "date": "February 28, 2022",
    "category": "bodybuilding",
    "fullContent": "Creatine is part of the guanidine-phosphate family, a protein-free amino acid compound naturally present in several foods, including mainly red meat and fish. Most of the creatine is deposited in skeletal muscle (95%), the rest divided between the brain and testicles. Approximately 2/3 of intramuscular creatine occurs in the form of phospho-creatine (Pcr), the rest as free creatine. It was identified for the first time in 1832 by the French chemist Chevreul but its presence in the flesh was confirmed by the well-known German chemist Von Liebig only in 1847, to which followed in the decade's numerous studies, which do not end yet to produce surprises, studies that saw among the protagonists the Italian school of Margaria.\n\nOf course, a proportion of creatine, chemically \"methyl guanidino acetic acid\", can be synthesized at the liver level, partly also in the kidneys and pancreas, starting from arginine, S-adenosyl-methionine and glycine, Its most well-known physiological functions include the ability to rapidly provide a phosphate molecule in ATP resynthesis from ADP in the known cyclic reaction and thus in energy management in the first seconds of muscle activity.\n\nIt is therefore evident that the availability of Pcr is able to manage muscle energy flows for intense efforts of short duration, the availability of Pcr depends mainly on the activity of the enzyme creatine kinase (CK), muscle stocks (and therefore by total mass) and endogenous synthesis capacity considering that the amount assimilable by food is extremely small. The primary role of creatine, as well as its pleiotropic effect, is linked to the CK/Pcr system, schematically reported in Figure 2.\n\nThe amount of Cr used daily depends on various factors, including the duration and intensity of exercise, the bioavailability of sources of Cr, muscle mass of the athlete, In fact, it has been reported that large athletes are able to consume amounts of Cr equal to 5-10 g/day; in some clinical conditions, it is even 10-30 g/day (Braissant, Wyss et. All).\n\nSupplementation\n\nFor several years it has been hypothesized that increasing the amount of Cr ingested could lead to the advantages caused by the greater availability and therefore an increase in the storage capacity of the same in the muscles given also the demonstration that when the concentration of Cr decreases with the continuation of the exercise, therefore, decreases the ability to keep the intensity constant.\n\nWith a normal diet, it is possible to provide 1-2 g of Cr per day which means saturating the deposits for 60-70%, clearly, a supplementation would not only allow to saturate the deposits at 100% but even increase the capacity of 20-40% also as a result of various strategies of supplementation (Candow, Kreider et all.)\n\nIs Cr’s supplementation really able to improve athletic performance? \n\nCr and its supplementation have been the subject of at least 25 years of a very long and copious series of studies that have led to know many aspects of the biochemistry of the substance and how this is able to accompany and modify metabolic adaptations that follow the exercises, often of very high intensity and load and of particular duration, without considering the very interesting perspectives that are opening in the clinical field but which we will not write on this occasion.\n\nRecommended quantities\n\nThe amount of Cr to be ingested to increase deposits is about 5 g/day for 5-7 days, we speak of CREATINE MONOHYDRATE, the most studied form.\n\nThe quantities of Cr to be administered able to maintain constant maximum quantities of muscle Cr now see a decided sharing indicating 3-5 g/day even for long periods; it is considered a greater need for athletes of large tonnage for which 5-10 g/day. In some studies, it was recommended to start with a short period of loading (in any case not less than 0.3 g/kg bodyweight for 4-5 days) followed by the doses previously recommended.\n\nAdministering Cr monohydrate together with carbohydrates or a mixture of carbohydrates and proteins increases the ability to retain and increase deposits (Steenge, Greenwood). Alternative protocol sees a quantity of 3 g/day for at least 28 consecutive days but the increase in deposits is slow and gradual. It should be considered that once the maximum quantity of deposits has been obtained in case of cessation of supplementation, the return to the starting quantity would take place after 4-6 weeks.\n\nCreatine monohydrate, as mentioned above, the most widely used and studied form, is very stable in solid form, less in aqueous solution in which it remains stable for several hours (the instability manifests with creatinine cyclization which would make it little or nothing assimilatable), the stability increases to the increase of the pH and to the decrease of the temperature of the solution; once ingested the peak of absorption occurs after about 60 minutes. In addition to Creatine Monohydrate, several other forms have been proposed (citrate, ethyl ester, nitrate, buffered and others) but none has been shown to have better properties both in the final result and in the kinetics of absorption.\n\nWhen to take it\n\nRegarding the timing, however, several studies state with a determination that taking Cr post-workout determines better results than pre-workout by analyzing the values of strength and body composition.\n\nAdvantages of supplementation\n\nA copious series of studies has led to having strong evidence in relation to the ability of Cr to provide an energy supplement in a wide range of exercises; clearly different sports disciplines benefit in view of the presence of the different stages in the table that makes up the characteristics of the discipline to be considered.\n\nNext is a summary table that takes into account sports disciplines that bring an advantage from the supplementation of Cr and why prevalent.\n\nAs you can see, several disciplines are involved confirming that the supplementation of Cr is able to increase performance in all athletic conditions and that is both in pure strength and high intensity, continuous and intermittent, as well as in long-term tests.\n\nIn a recent overview of the additional benefits derived from the use of Cr there is a schematic description:\n\nImprovement of recovery\nPrevention of accidents\nIncrease in heat tolerance\nImprovement of rehabilitation from injury\nBrain and column neuroprotection\nSecurity\n\nOne of the most interesting aspects is the safety reported after massive doses of Cr taken for long periods without having any particular side effects. In particular, it is reported that the intake for several years of doses of 0.3-0.8 g per kg/ body weight (equal to 21-56 g for a subject of 70 kg) daily did not result in clinical events or serious side effects.\n\nBeliefs and false myths\n\nThe remarkable fame assumed by the abilities of the Cr has also led, as often happens, to the diffusion of both elements of amazing advantage, never confirmed in such proportions, whereas, on the contrary, alarming data on side effects are likely to compromise certain salient features of specific disciplines, such as the worrying condition of weight gain due to water retention obviously problematic in the disciplines where weight loss is crucial.\n\nNecessary for this purpose to report the final conclusions of a study that has analyzed many scientific publications published on the supplementation of Cr, very illuminating study in this regard:\n\nCr does not lead to water retention\nCr is not an anabolic steroid\nIf taken in the recommended dosages does not result in kidney damage or dysfunction\nMost evidence shows no correlation between Cr use and hair loss\nCr does not cause dehydration and cramps\nThe CR is able to bring the benefits reported safely even in teenagers\nCr does not increase fat mass\nSmall doses of Cr (3-5 g per day) are sufficient to maintain constant maximum amounts of muscle Cr deposits so the load (25 g/day) is usually not useful\nThe supplementation of Cr in combination with counter-resistance training brings considerable advantages to the elderly population; note that in these subjects even the only Cr (without training) is able to bring advantages\nCr is able to bring benefits in a wide variety of sports disciplines\nThe CR is able to bring the same benefits to the female sex throughout life\nNo alternative form of Cr has advantages over creatine monohydrate.\n\nIn conclusion, the Cr is becoming increasingly important as a substance of considerable interest for the most varied aspects in the various sports disciplines not excluded clinical aspects which, increasingly, go beyond the sporting needs and for which, However, scientific evidence is now assuming unequivocal proportions.\n\nBibliography\n\nBraissant O, et al. Creatine deficiency syndromes and the importance of creatine synthesis in the brain. Amino Acids.\n\nWyss M, et al. Creatine and creatine kinase in health and disease–a bright future ahead? Subcell Biochem. 2007;46:309–34.2011;40(5):1315–24.\n\nCandow DG, Chilibeck PD. Potential of creatine supplementation for improving aging bone health. J Nutr Health Aging. 2010;14(2):149–53.\n\nKreider RB. Effects of creatine supplementation on performance and training adaptations. Mol Cell Biochem. 2003;244(1–2):89–94.\n\nSteenge GR, Simpson EJ, Greenhaff PL. Protein- and carbohydrate-induced augmentation of whole body creatine retention in humans. J Appl Physiol (1985). 2000;89(3):1165–71.\n\nGreenwood M, et al. Differences in creatine retention among three nutritional formulations of oral creatine supplements. J Exerc Physiol Online. 2003;6(2):37–43.\n\nKreider RB, Kalman DS, Antonio J, Ziegenfuss TN, Wildman R, Collins R, Candow DG, Kleiner SM, Almada AL, Lopez HL. International Society of Sports Nutrition position stand: safety and efficacy of creatine supplementation in exercise, sport, and medicine. J. Int. Soc. Sports Nutr. 2017;14:18-z eCollection 2017.\n\nAntonio, J., Candow, D.G., Forbes, S.C. et al. Common questions and misconceptions about creatine supplementation: what does the scientific evidence really show?. J Int Soc Sports Nutr 18, 13 (2021)",
    "contentLength": 10116,
    "url": "https://www.yamamotonutrition.com/int/blog/post/creatine-the-queen-of-performance-supplements-a1768",
    "slug": "creatine-the-queen-of-performance-supplements-a1768"
  },
  {
    "title": "Cycling nutrition",
    "author": "ACHZOD",
    "date": "May 16, 2023",
    "category": "sport",
    "fullContent": "The ability to make long-term efforts is determined to a great extent by high potential aerobic capacity, the availability of energy substrates , the enzymatic activity and the efficiency of thermoregulation and the cardiorespiratory system.\n\nThese skills are a fundamental basis necessary to evaluate the level of physical fitness of an athlete and are conditioned by various factors, among which genetics, training regimen, nutrition and body composition should be underlined. Furthermore, it should be emphasized that intensive training, nutritional mismatch and mental stress, lead to muscle fatigue and damage, as well as oxidative stress, which shape the specific nutritional needs of physically active people.\n\nWhat does an endurance athlete need?\n\nEndurance sports are becoming increasingly popular and athletes of all skill levels are looking for ways to optimize their performance through training and nutrition.\n\nPer endurance exercise lasting 30 minutes or more, the factors most likely to contribute to fatigue are dehydration and glycogen depletion, while gastrointestinal problems, hyperthermia, and hyponatremia can reduce exercise performance. endurance exercise and are potentially dangerous to health, especially in longer events (>4 h).\n\nWhile high initial muscle glycogen concentrations may be beneficial for endurance exercise, this need not be achieved by the traditional supercompensation protocol. A personalized nutritional strategy can be developed that aims to deliver carbohydrates to the working muscle at a rate that depends on the absolute exercise intensity and duration of the event.\n\nEndurance athletes should attempt to minimize dehydration and limit body mass losses through perspiration to 2-3% of body mass. Gastrointestinal problems occur frequently, especially in long distance races. The problems appear to be highly individual and perhaps genetically determined, but may also be related to the intake of highly concentrated carbohydrate solutions, hyperosmotic beverages, as well as fiber, fat and protein intakes. Hyponatremia has occasionally been reported, especially among slower competitors and therefore with very high consumption of water or other low sodium beverages.\n\nThe role of nutrition in the cyclist\n\nGood nutrition is important at every stage of training and competition. Both the serious competitive cyclist and the recreational cyclist should follow a balanced diet that provides adequate calories to meet energy needs. Athletes who consume less than 2000 calories per day may find it difficult to meet nutrient needs, particularly for iron and calcium. Weight loss, glycogen depletion, and dehydration are also possible results of an inadequate diet.\n\nDietary strategies to improve or maintain the body's carbohydrate stores are necessary for performance, especially for cyclists with high training miles or who participate in road races and other endurance events. Additionally, cyclists should be encouraged to drink plenty of fluids , especially when in a hot environment.\n\nIt appears that the protein requirement of endurance athletes increases with increasing duration and intensity of exercise. However, factors such as total calorie intake and protein quality should be considered when determining your protein needs. Many athletes are concerned about their vitamin and mineral intake and often use nutritional supplements for both \" health insurance \" and performance reasons .\n\nThe most commonly taken supplements include vitamin C, B-complex and iron. Vitamins and minerals in excess of the RDA do not improve performance and can be toxic when consumed in large quantities. On the other hand it should be considered that vegetarians and cyclists with low calorie intakes can benefit from a multivitamin or mineral supplement.\n\nHow important is body composition for a cyclist\n\nFurthermore, another important aspect from the point of view of endurance sports training is that of achieving and maintaining an adequate nutritional status. In this regard, the key factor providing information on nutritional status is the body composition together with the analysis of the concentration of selected clinically relevant biochemical markers (eg, in blood, saliva, urine) should be prominently indicated.\n\nMonitoring athletes' body composition indicators allows, among other things, to evaluate the effectiveness of dietary and training interventions . On the other hand, manipulation of body composition allows for the support of physical performance, the adaptation to the requirements of a given sport discipline and the assumption of high intensity exercise loads. Similarly, an important element is also the assessment of nutritional status which involves analyzing the balance of selected nutrients, especially over a longer perspective and time.\n\nA recent study, published in December 2022, analyzed the behavior of a large group of endurance athletes (about 50) by assessing their nutritional conditions (analysis of nutrients taken with the diet of the period considered and body composition). These are the results:\n\nBody mass decreased slightly from 80.5 ± 14.4 kg in the training period to 78.6 ± 11.2 kg in the competition period, mainly due to the insignificant reduction in body fat, therefore related to a significant loss of lean mass;\n\nCompared with the recommendations, the studied group provided lower energy (recommended ≥40 kcal/kg BM/day) and carbohydrate (recommended ≥6 g/kg BM/day), as well as vitamin E (recommended 15 mg/day, 85 % of participants not meeting recommendations in both periods) and folic acid (400 µg/day recommended; 85 and 80% of participants not meeting recommendations in training and competition period, respectively) during both periods;\nFurthermore, during the training period, the athletes did not meet their vitamin C requirements (75 mg/day recommended; 60% of athletes do not meet the recommendations) and during the soccer competition period (1000 mg/day recommended ; 65% of participants do not meet the recommendations).\n\nEvaluation of the nutritional value of the diet indicates that the athletes studied did not periodize their diet according to the training cycle (training period vs. competition).\n\nDuring the competition period, athletes performed the incremental exercise test significantly longer (p = 0.025) than during the training period. Additionally, %VO 2max_VT decreased (p = 0.047) during the competition period. However, the lack of changes in relative VO 2 absorption to VT may limit the clinical significance of the above %VO 2max_VT changes. In addition, there were also no significant improvements in the rate of other cardiorespiratory peaks and thresholds.\n\nAlthough there were no differences in the dietary intake of minerals and vitamins in the study group between the training and competition periods in this study, there were several deficiencies. In both training periods, the energy value of the diet of the athletes studied, as well as the intake of carbohydrates and folic acid, were lower than the recommendations. Furthermore, the intake of vitamin C in the training period and calcium intake in the competition period was insufficient. Other studies have shown similar findings regarding inadequate carbohydrate intake, which is also in line with other nutrient ratios as well as showing vitamin D and E deficiencies.\n\nIn the holistic and interdisciplinary sports training approach, body composition primarily reflects the nutritional status of athletes . Monitoring body composition therefore makes it possible to evaluate the effectiveness of the nutritional and training interventions undertaken. The deliberate manipulation of body composition in different periods of training macrocycles allows, among other things, to support physical performance, meet the physical demands of a given sport, and meet significant exercise loads. Elite endurance athletes are typically lean and have relatively low body mass due to the genetic factors that predisposed them to be successful in their sport, as well as the modifying effects of\n\n                                                                                         Carmine Orlandi\n\n \n\nBibliography\n\nBrunkhorst L., Kielstein H. Comparison of Anthropometric Characteristics between Professional Triathletes and Cyclists. Biol. Sport. 2013;30:269–27\n\nMaughan R.J., Burke L.M., Dvorak J., Larson-Meyer D.E., Peeling P., Phillips S.M., Engebretsen L. IOC Consensus Statement: Dietary Supplements and the High-Performance Athlete. Br. J. Sports Med. 2018;52:439–455.\n\nDo Triathletes Periodize Their Diet and Do Their Mineral Content, Body Composition and Aerobic Capacity Change during Training and Competition Periods? Krzysztof Durkalec-Michalski, Natalia Glowka, Paulina M Nowaczyk, Anna Laszczak, Anna Gogojewicz, Joanna Suliburska; Nutrients. 2022 Dec 20;15(1):6.\n\nJeukendrup A, Nutrition for endurance sports: marathon, triathlon, and road cycling. J Sports Sci. 2011;29 Suppl 1:S91-9.",
    "contentLength": 8994,
    "url": "https://www.yamamotonutrition.com/int/blog/post/cycling-nutrition-a1978",
    "slug": "cycling-nutrition-a1978"
  },
  {
    "title": "Dehydration and mineral salts: role and functions",
    "author": "ACHZOD",
    "date": "June 01, 2023",
    "category": "nutrition and well being",
    "fullContent": " \n\nHydration has always played an important role in sports performance, injury prevention and recovery after training sessions or competitions, both for athletes engaged in competitive sports or competitions and at an amateur level . Therefore, it is extremely important that both coaches and athletes clearly understand the mechanisms and physiology of this mechanism, in order to improve the hydration needs of sportsmen for preventive but also for lending purposes.\n\nLet's start from the basics: in a sedentary subject the daily water exchange is around 2.5 liters (between entries and exits), but the liquids that actually circulate in the entire digestive system amount to approximately 9 litres. When it comes to athletes these quantities vary considerably and the demands for liquids have increased, obviously due to an increase in outings, above all in the form of sweat. These losses must be adequately compensated by an increase in revenue, in order not to risk incurring problems and repercussions (which we will discuss later).\n\nThe quantity of water to be reintegrated then varies according to individual characteristics, the intensity and quantity of muscular work and, above all, in relation to climatic conditions. It is therefore not possible to establish a priori the needs of the individual subject, which are strictly personal.\n\nPhysiology and mechanisms of the state of hydration\n\n\nHowever, it is important to always keep in mind some physiological aspects, which allow us to better understand how the state of hydration of the individual works: body water represents approximately 60% of the total body weight in an adult man (therefore more than half of the number that we see on the scale when we weigh ourselves). The amount of intracellular water (also technically called ICW - Intra Cellular Water ) amounts to 2/3 of the total body water (66%), while the extracellular water content (which is indicated instead as ECW - Extra Cellular Water ) amounts to 1/3 of the total body water (or Total Body Water -TBW ) and represents 35%.\n\nBroadly speaking, the water requirement of a person who performs physical activity is about 1 ml for each calorie of energy expenditure . If physical activity exceeds 2 hours, dehydration can even reach 5% of body weight: a value far too high to be underestimated, and which can also lead to serious complications if not promptly reintegrated. This lack of liquids must therefore be adequately and promptly rebalanced; otherwise it creates the conditions for a rapid deterioration of the athlete's performance.\n\nRespect for the choice of hypo- or isotonic solutions and the use of any targeted supplementation is necessary to avoid that a significant quantity of pure water also leads to the dilution of extracellular fluids. This could in fact determine, thanks to the action of the pituitary gland, the secretion (i.e. the production and secretion) of adiuretin, a hormone also known as \"vasopressin\", with consequent elimination of excess fluids, but which also entails unpleasant consequences for a athlete.\n\nIn general, the lack of liquids and consequently of salts, especially in humid and hot conditions, is signaled by symptoms such as nausea, vomiting, dizziness and general tiredness, as well as by a significant impairment of performance . If you insist on continuing to exercise despite the onset of symptoms, you may experience muscle cramps and difficulty concentrating. To correctly calculate the quantity of substances to be replenished, it is necessary to remember some concepts, linked to the definition of osmolarity, which we report below.\n\nThe term osmolarity refers to a physical quantity that measures the concentration of solutions, and its value expresses precisely the concentration of the solution under examination. Under normal conditions, the osmolarity is identical for all the fluids present in the various compartments of the organism (which can be divided into intra and extra cellular) The volume of extracellular fluid is generally estimated at 0.255 l/Kg of body weight , and the factor The main factor that regulates the distribution of body water between the extracellular (EC) and intracellular (IC) districts is the osmotic pressureof the liquids themselves. Osmotic pressure is defined as that pressure that exactly balances the movement of the solvent generated by the difference in solute concentration between 2 concentrations. In the extracellular compartment sodium is more important , while in the intracellular compartment potassium prevails .\n\nThe importance of a correct interpretation of the osmolarity becomes fundamental in the preparation of a solution that has to replenish energy and mineral salts in the athlete . First of all, it is necessary to identify the goal, i.e. if you aim for a rapid replenishment of water or if you want a quick energy intake, which can be used quickly by the body.\n\nIntegration of mineral salts\n\nAt a supplementary level, two well-known minerals certainly play a fundamental role: magnesium potassium . Magnesium helps support physiological muscle function, contributes to the reduction of tiredness and fatigue, supports energy metabolism and contributes to the normal functioning of the nervous system. Potassium helps to support physiological muscle function, promotes the maintenance of normal blood pressure and also contributes to the functioning of the nervous system. In some situations, sodium supplementation may also be necessarywhen it is not possible to cover the increase in needs with diet alone (generally sufficient) or following extreme sweating not followed by adequate recovery. In fact, sodium participates in the transmission of nerve impulses, regulates the permeability of membranes and contributes to the maintenance of water balance.\n\nAs regards the concentration levels of the solutions, these can be divided into Isotonic and Hypertonic , based on the assimilation times by the intestine. An isotonic solution (with osmotic pressure equal to that of plasma) also guarantees a rapid transit through the stomach, just slower than that of pure water.\n\nOn the other hand, a hypertonic solution, i.e. with an osmotic pressure higher than that of the plasma, remains longer in the stomach and, once it reaches the intestinal lumen due to the high osmolarity, it recalls a considerable quantity of liquids from the mucosa (theft of water) . This subtraction of water damages the entire body, worsening any state of dehydration, causing diarrhea and, in any case, limiting athletic performance.\n\nAt the beginning of physical exercise, water is transferred from the blood plasma (ECW) to the interstitial and intracellular spaces: the metabolites begin to accumulate in and around the muscle fibres; the osmotic pressure at these sites is rising and attracts water. By increasing muscle activity, a rise in blood pressure is obtained, with an \"extravasation\" of water from the vascular compartment, often associated with an increase in sweating: essentially, from all these effects due to increased physical activity, muscles acquire water at the expense of plasma volume.\n\nOn the other hand, the reduction of plasma volume results in:\n\nReduction of blood pressure;\nReduction of blood flow to the epidermis;\nReduction of blood flow to the muscles.\nRisks of dehydration\n\nEven modest dehydration (equal to 1% of body weight), caused by sweating during physical exercise, can increase cardiovascular work by increasing HR (heart rate) and thus reducing the body's ability to thermoregulate.\n\nExcessive sweating and/or urinary urination could also be a consequence of the large loss of electrolytes, which could lead to the development of serious repercussions, such as cardiac dysrhythmias. All this even though Costill, a famous sports physiologist, observed that the uniform loss of electrolytes, even if considerable, derives mainly from the ECW compartment, and therefore the loss of ions by sweating and urinating would translate into small effects on the ion content K+ in the muscle cell.\n\nAlso not to be overlooked is the influence of dehydration on our immune defences. This effect, also known as the \"open window effect\", derives from the fact that after physical exercise, the immune system is busy healing the micro-lesions of the muscles and cells, formed as a result of training. This is why, together with hydration, during and after performance, an athlete must remember to keep the intestines protected as well. In fact, his entire health depends on it: for the intestine to be less \"permeable\" to attacks by pathogens, supplements such as zinc and Vitamin C perform an excellent antioxidant action to protect cells from oxidative stress induced by intense physical activity, and thus supporting the physiological defenses of the\n\n\nBIBLIOGRAPHY\n\nMcARDLE W. D, KATCH FI, KATCH VL \"Physiology applied to SPORT\". Casa Editrice Ambrosiana, Milan, 1998.\n\nOPPLIGER RA, CASE HS, HORSWILL CA et al. “Weight Loss in Wrestlers,” American College of Sports Medicine Official Position. Medicine and Science in Sports and Exercise. Vol. 28, No. 2. 1996\n\nROEMMICH JN, SINNING WE “Weight loss and wrestling training: effects or nutrition, maturation, body composition and strength”. Journal of Applied Physiology 82 : 1751-1759, 1997.\n\nTIMPMANN S., OOPIK V. “The influence of body weight reduction on combat sport performance“. Athlon 10/2005, 1-2/2006.\n\nWILMORE J. H. “Weight Category Sports“; Parte 4, Cap. 49, in MAUGHAN R.J. “Nutrition in Sport“ , Volume VII of the Encyclopaedia of Sports Medicine, in collaboration with the International Federation of Sports Medicine. Blackwell Science, 2002.\n\nDamir Zubac, Armin Paravlic, Reid Reale, Igor Jelaska, Shawnda A Morrison, Vladimir IvancevEur J Nutr. 2019 Mar;58(2):497-514. Fluid balance and hydration status in combat sport Olympic athletes: a systematic review with meta-analysis of controlled and uncontrolled studies.\n\nShirreffs SM et al. 2005, The sweating response of elite professional soccer players to training in the heat. Int. J. Sport. Med. 26 (2): 90-5.\n\nMaughan, R. 2006. Guidelines for replacing fluid and CHO during exercice. In: Clinical sport nutrition-McGraw Hill.\n\nR. J. Maughan, S. M. Shirreﬀs; Scand J Med Sci Sports 2010: 20 (Suppl. 2): 59–69. Development of hydration strategies to optimize performance for athletes in high-intensity sports and in sports with repeated intense efforts.\n\nN.A. Masento, M. Golightly , D.T. Field, L.T. Butler and C.M. van Reekum; British journal of nutrition, January 2014, Effects of hydration status on cognitive performance and mood.\n\n ",
    "contentLength": 10612,
    "url": "https://www.yamamotonutrition.com/int/blog/post/dehydration-and-mineral-salts-role-and-functions-a1938",
    "slug": "dehydration-and-mineral-salts-role-and-functions-a1938"
  },
  {
    "title": "Guarana | Properties, Benefits and Curiosities",
    "author": "ACHZOD",
    "date": "August 18, 2020",
    "category": "supplements and nutraceuticals",
    "fullContent": "What is Guarana?\n\nWhat is commonly referred to as guaranàis a drink obtained from the seeds of Paullina cupana, a plant native to Brazil grown in the Amazon rainforest basin. Currently, 70% of the products obtained from the cultivation and processing of this plant are used to produce energy drinks , while the remainder is consumed by infusion or in the form of guarana powder in capsules.\n\n \n\n \n\nThe seeds of guarana are derived from fruit of the plant that, once mature, they open making them visible. The typical processing of the seeds requires that these are collected, chopped and then mixed with water until a paste is obtained. The resulting pasta is then dried in the form of rolls and marketed.\n\n \n\nAlternative processes also include a light roasting of guarana seeds which, in contact with heat, dehydrate, facilitating subsequent milling (fine grinding). The preparation of the drink takes place with a process similar to that of tea, by boiling water and putting the dried pasta inside for the extraction to take place. The resulting drink is refreshing and has energizing properties . The slightly bitter and astringent taste is due to the presence of caffeine and polyphenols (tannins). Another sales format is the freeze-dried one, that is in the form of guarana powder, also in this case used to prepare a drink.\n\nHow are guarana supplements made?\nGuarana extract\n\nThe extracts are the product obtained following the extraction of the active ingredients from the raw material. To obtain the guarana extract, you start by removing the pulp of the fruit from the seeds, drying them at a controlled temperature up to a humidity of 8-10%. Controlling the temperature allows you not to damage the compounds contained in guarana seeds. Once dry, the seeds are ground up and put in contact with a solvent (a liquid that is capable of extracting compounds from seed powder) for extraction.\n\n \n\nAfter the extraction, the seeds are removed from the diluent and washed again to remove other active substances. Subsequently, the products of the washes and the initial extraction are combined in order to guarantee a minimum content of active ingredients (for example, caffeine ). The solution is then allowed to cool and the unwanted substances separated from it by precipitation. At the end of the process, a final filtration follows which guarantees the purity of the extract.\n\nGuarana supplements\n\n \n\nThe extracts are used to prepare guarana food supplements or pharmaceutical products.\n\nThe substantial difference compared to a food is the quantity of active ingredients that we find in the products. In fact, it very often happens that in order to obtain the beneficial effect attributed to a compound through the consumption of a food, excessive quantities must be consumed. This can be compensated for by using an extract.\n\nProperties of guarana\n\nProperties of guarana\n\n \n\nThe guarana has always been known for its energizing properties and, because of that - in addition to being used as a food supplement itself - is widely used as an ingredient to produce:\n\nenergy drink,\npre-workout supplements.\n\nTo these effects are added the benefits on attention and memory , demonstrated through studies conducted on humans. The products obtained from this plant, along with others such as tea and coffee, are part of a category of foods called nerve foods . The peculiarity of nerve foods is that they contain compounds capable of interacting with the nervous system, mostly as stimulants .\n\nAnother property that some studies attribute to guarana is the ability to positively influence lipid metabolism and increase both basal metabolism and weight loss .\n\nGuaranine, theophylline, theobromine\n\n \n\nThe compound responsible for guarana's strong energizing properties is called guaranine . This molecule, in reality, is nothing but caffeine present in the seeds in variable quantities, from 3 to 5%. Also in this case, similarly to what happens for theine, it is usual to use a different name for the same compound. This phenomenon is due to the fact that many names were attributed to compounds before it was possible to identify them precisely. In addition to caffeine, we find two other molecules that possess nervine activity: theophylline and theobromine .\n\n \n\nThese three compounds are purine alkaloids, so defined because their origin is connected to that of the purine bases adenine and guanine which make up the nucleotides and nucleosides. In this case, theobromine is believed to be responsible for the slight diuretic action of guarana, while theophylline has a stimulating action similar to that of caffeine and acts as a bronchodilator .\n\nThese elements are present in guarana in much smaller doses than caffeine: we are talking about 0-0.25% in the case of theophiline and 0.2-0.02% for theobromine.\n\nBeneficial effects of guarana\n\n \n\nSeveral benefits have also been shown in adults who used guarana constantly. Habitual consumption seems to lead to a lower incidence of:\n\nhypertension,\nobesity,\nmetabolic syndrome.\n\nIn addition to the benefits attributable to the content of the alkaloids described above, the antioxidant properties are very important . Per the seeds of this plant, in fact, the polyphenol content is about 7-9%. There are mainly condensed tannins such as catechins and epicatechins.\n\nCuriosity\nThe word \"guarana\" has a specific meaning in some dialects of the indigenous Amazonian peoples. The term is translated with the Anglo-Saxon \"vine\" or vine . This is due to the fact that guarana plants, in the wild, grow very high (up to 10 meters) by climbing the branches of other trees. Furthermore, guarana fruits are grouped in cluster-like structures and before opening at the time of harvest, they change hues from dark green to yellow-brown or intense yellow-orange.\nA second curiosity concerns a fundamental characteristic for its identification. This consists in the fact that, when ripe, the guarana fruits open and their white interior becomes visible. From the innermost part the black seed emerges which creates a strong visual contrast giving the impression that you are looking at a human eye.\nConclusions\n\nGuarana, together with the other plants used to obtain nerve foods, is an excellent support for both energizing and antioxidant properties . Consuming regularly, without exceeding, these drinks or the extracts of these plants can be considered a winning strategy to better deal with problems such as mental fatigue caused by stress.\n\n \n\nFurthermore, being aware of the great qualities that plants possess is a way to get closer to nature and appreciate the immense treasure it represents. Putting the attention in a deeper way on the relationship that nutrition has with nature and the advantages that can be drawn from this knowledge is certainly a milestone in the education of future generations to respect nature and themselves.\n\n \n\n \n\n \n\nBibliography\n\nFood Chemistry, Paolo Cabras, Aldo Martelli;\nChemistry, Biosynthesis and Bioactivity of Natural Substances, Paul M. Dewick;\nReview: Guarana: Revisiting a highly caffeinated plant from the Amazon;\nThe Complete Guide To Herbal Medicines Di Charles W. Fetrow, Juan R. Avila",
    "contentLength": 7182,
    "url": "https://www.yamamotonutrition.com/int/blog/post/guarana-properties-benefits-and-curiosities-a987",
    "slug": "guarana-properties-benefits-and-curiosities-a987"
  },
  {
    "title": "How to deal with psychophysical, work and emotional stress",
    "author": "ACHZOD",
    "date": "December 22, 2021",
    "category": "nutrition and well being",
    "fullContent": "Modern life in the most advanced countries is often very stressful, it implies a continuous commitment to competitiveness in every sector of life, starting from work.\n\nBeing efficient and productive is a difficult demand to meet all the time, keeping up is not easy.\n\nThen there are periods of psychophysical, work, emotional stress, or intense study, you need help to be more cognitively performing and focused, or of greater mental brilliance and reactivity.\n\nThere are a range of natural substances that have a high adaptogenic-nootropic Energy, substances that have always been recognized: Bacopa Monnieri, Panax Ginseng and Ginko Biloba.\n\nFrom the expertly calibrated pool of these elements, it is possible to obtain \"adaptogenic\" food supplements with marked characteristics and elements that make it equally definable as \"nootropic\".\n\nThe Bacopa Monnieri is considered by many experts as the best natural substance nootropic\n\nknown on the market, whose benefits are already evident from Ayurvedic Medicine as a powerful support tonic for phases of particular psychophysical stress, capable of reducing states of anxiety, improving mood, memory and reaction times, thanks to its rebalancing effect on neurotransmitters such as acetylcholine. Clinical research says that its effects begin to manifest after a few days and with chronic use, from 4 to 12 weeks, improvements in thought processing times, reaction and learning skills are evident, as well as greater clarity and feeling of calm.\n\nThe Ginseng is one of the most popular medicinal herbs in the world, handed down from the\n\nancient Oriental or North American medicines for centuries, very rich in bioactive substances, where they stand out among all the \"ginsenosides\". Extensive clinical research has reported its effectiveness as one of the main adaptogens and \"anti-stress\" substances that improve cognitive capacity, memory, counteract fatigue, circulation, digestion, acting as an immunomodulatory, antioxidant, and recently evidence as a support in menopause or erectile dysfunction. But among the many virtues of Ginseng, as we find it today as an important natural nootropic element, as it improves the body's ability to deal with the phases of physical and psychological stress, giving it more energy and reducing adrenergic fatigue. Powerful neuroprotector against dopamine.\n\nThe Ginko Biloba is a medicinal plant whose presence on Earth dates back millennia, whose\n\nuse in Traditional Chinese Medicine dating back to 2800 BC, you can find it already recommended for asthma, cough, vascular disorders, and as a tonic to contrast aging. Today well known in the world of nutraceuticals, it is considered for the rebalancing of neurotransmitters, to slow down the degeneration of brain cells, to improve cerebral circulation thus providing a greater flow of oxygen and glucose available to neurons. Ginko Biloba is one of the most suitable natural substances to stimulate learning, memory, and cognitive abilities in general. Promotes the increase of dopamine in the brain, reducing anxiety and improving motivation.\n\nScientific references\n\nCalabrese N.D., Gregory W.L., Leo M., Kraemer D., Bone K., Oken B. “Effects of a Standardized Bacopa monnieri Extract on Cognitive Performance, Anxiety, and Depression in the Elderly: A Randomized, Double-Blind, Placebo-Controlled Trial” Journal of Alternative and Complimentary Medicine 2008 Jul; 14(6): 707–713.\n\nAguiar S, Borowski T. Neuropharmacological review of the nootropic herb Bacopa monnieri. Rejuvenation Res. 2013 Aug;16(4):313-26. doi: 10.1089/rej.2013.1431. PMID: 23772955; PMCID: PMC3746283.\n\n \n\nStough C., Lloyd J., Clarke J., Downey L.A., Hutchison C.W., Rodgers T., Nathan P.J. “The chronic effects of an extract of Bacopa monniera (Brahmi) on cognitive function in healthy human subjects.” Psychopharmacology 2001 Aug;156(4):481-4.\nStough C., Downey L.A., Lloyd J., Silber B., Redman S., Hutchison C., Wesnes K., Nathan P.J. “Examining the nootropic effects of a special extract of Bacopa monniera on human cognitive functioning: 90 day double-blind placebo-controlled randomized trial.” Phytotherapy Research 2008 Dec;22(12):1629-34 Bhattacharya S.K., Ghosal S. “Anxiolytic activity of a standardized extract of Bacopa monniera: an experimental study.” Phytomedicine. 1998 Apr;5(2):77-82\n\nNemetchek MD, Stierle AA, Stierle DB, Lurie DI. The Ayurvedic plant Bacopa monnieri inhibits inflammatory pathways in the brain. J Ethnopharmacol. 2017 Feb 2;197:92-100. doi: 10.1016/j.jep.2016.07.073. Epub 2016 Jul 26. PMID: 27473605; PMCID: PMC5269610.\n\n \n\nSukumaran NP, Amalraj A, Gopi S. Neuropharmacological and cognitive effects of Bacopa monnieri (L.) Wettst - A review on its mechanistic aspects. Complement Ther Med. 2019 Jun;44:68-82. doi: 10.1016/j.ctim.2019.03.016. Epub 2019 Mar 30. PMID: 31126578.\n\nLi X.T., Chen R., Jin L.M., Chen H.Y. “Regulation on energy metabolism and protection on mitochondria of Panax ginseng polysaccharide.” American Journal of Chinese Medicine. 2009;37(6):1139-52.\n\nBaeg I.H., So S.H. “The world ginseng market and the ginseng (Korea)” Journal of Ginseng Research 2013 Mar; 37(1): 1–7.\n\nChoi K.T. “Botanical characteristics, pharmacological effects and medicinal components of Korean Panax ginseng C A Meyer.” Acta Pharmacologica Sinica. 2008 Sep;29(9):1109-18.\n\nJia L., Zhao Y. “Current evaluation of the millennium phytomedicine–ginseng (I): etymology, pharmacognosy, phytochemistry, market and regulations.” Current Medicinal Chemistry. 2009;16(19):2475-84.\n\nOlinyk S., Oh S., “Actoprotective effect of ginseng: improving mental and physical performance” Journal of Ginseng Research 2013 Apr; 37(2): 144–166.\n\nColeman C.I., Hebert J.H., Reddy P. “The effects of Panax ginseng on quality of life.” Journal of Clinical and Pharmaceutical Therapy. 2003 Feb;28(1):5-15.\n\nPopa A. “Ginkgo Biloba and Memory” Pharmacotherapy Update – Cleveland Clinic Vol. V, No. V September/October 2002\nEGb 761: ginkgo biloba extract, Ginkor. Drugs in R. & D.2003;4(3):188-93.\n\nMashayekh A., Pham D.L., Yousem D.M., Dizon M., Barker P.B., Lin DD. “Effects of Ginkgo biloba on cerebral blood flow assessed by quantitative MR perfusion imaging: a pilot study.” Neuroradiology. 2011 Mar;53(3):185-91.\n\nAhlemeyer B., Krieglstein J. “Neuroprotective effects of Ginkgo biloba extract.” Cellular & Molecular Life Sciences. 2003 Sep;60(9):1779-92.\nMashayekh A., Pham D.L., Yousem D.M., Dizon M., Barker P.B., Lin DD. “Effects of Ginkgo biloba on cerebral blood flow assessed by quantitative MR perfusion imaging: a pilot study.” Neuroradiology. 2011 Mar;53(3):185-91.\n\nPopa A. “Ginkgo Biloba and Memory” Pharmacotherapy Update – Cleveland Clinic Vol. V, No. V September/October 2002\nCieza A., Maier P., Pöppel E. “Effects of Ginkgo biloba on mental functioning in healthy volunteers.” Archives of Medical Research. 2003 Sep-Oct;34(5):373-81\n\n ",
    "contentLength": 6881,
    "url": "https://www.yamamotonutrition.com/int/blog/post/how-to-deal-with-psychophysical-work-and-emotional-stress-a1793",
    "slug": "how-to-deal-with-psychophysical-work-and-emotional-stress-a1793"
  },
  {
    "title": "The diseases of well-being",
    "author": "ACHZOD",
    "date": "April 06, 2023",
    "category": "nutrition and well being",
    "fullContent": "The economic well-being and the improvement of the quality of life, for an important part of the world population, can be seen as a natural process of evolution.\n\nHowever, this has brought to the attention of the scientific medical community the increase of a whole series of pathologies, which are added to the concept of \"well-being\". What at first glance may seem like an \"oxymoron\", ie combining the word disease with well-being , unfortunately is increasingly proving to be the reality of the facts. The reasons are to be found in the lack of physical activity, in bad eating habits, in the absence of cognitive stimuli and also in the increase in stress levels, due to the problems we encounter in our working and personal lives. All these factors then add up to a series of uncontrollable external situations, such as pollution, scarcity of truly nutritious food, intensive farming, pandemics and wars ...... As a result, our body and mind accumulate further stimuli negatives.\n\nSo what are these diseases and how can we fight them?\n\nObesity\n\nThe most frequent and widespread is certainly obesity. Pathological overweight and obesity is defined as an abnormal or excessive accumulation of fat that presents a real health risk , often accompanied by other disorders such as metabolic syndrome or diabetes .\n\nIn recent years, the problem has grown to epidemic proportions, with more than 4 million people dying every year from being overweight or obese: these are the numbers for 2017 according to the global burden of disease. However, the rates of overweight and obesity continue to rise in adults and also in children. From 1975 to 2016, the prevalence of overweight or obese children and adolescents aged 5-19 more than quadrupled, from 4% to 18% globally.\n\nObesity, as anticipated, is a complex problem with many causes. In most cases, being overweight is caused by a caloric excess, with an imbalance in terms of consumption of foods high in fat and sugars, which are stored in the body in the form of fat. Obesity is an increasingly common problem because the environment we live in makes it difficult for many people to eat healthily and get enough physical activity . The best treatment for obesity remains the combination of calorie restriction (always under the supervision of a doctor or nutritionist) and daily physical activity which can be both aerobic and anaerobic. Per most people, a good compromise could be to train 2.5 to 5 hours a week, the minimum movement necessary to keep our metabolism active and avoid or reduce excess fat.\n\nHypertension\n\nHigh blood pressure , or hypertension, rarely has obvious symptoms. But if left untreated, it increases the risk of serious problems like heart attacks and strokes . Blood pressure is recorded as 2 values: systolic blood pressure (represented by the \"higher number\"), which is how hard your heart pumps blood around your body, and diastolic blood pressure, which is the resistance to blood flow in blood vessels. They are both measured in millimeters of mercury (mmHg).\n\nAs far as the treatment of hypertension is concerned, we recommend that you keep the following parameters as a general guide:\n\nhigh blood pressure is considered to be between 140/90 mmHg or 150/90 mmHg if you are over 80;\nthe ideal blood pressure is generally considered to be between 90/60 mmHg and 120/80 mmHg, while the target for people over 80 is less than 150/90 mmHg.\n\nTo this we must always add the individual blood pressure, clearly slightly different for everyone. What is considered low or high for you may be normal for someone else. So never self-diagnose and always contact your doctor for further tests, bearing in mind that hypertension usually develops over time.\n\nHere too, the causes can be of a different nature, even if it is usually the sum of several parameters: unhealthy lifestyle choices , such as smoking and alcohol, together with absent or insufficient physical activity. It should also be remembered that some health conditions, such as diabetes and obesity, can also increase the risk of developing high blood pressure. Apart from the pharmacological treatment, the change in lifestyle has certainly proved to be essential for the treatment of this condition . A balanced diet, regular physical activity, reducing (or rather avoiding!) the consumption of alcohol, quitting smoking and limiting stress are certainly the tips that we all probably know, but which are really fundamental both on a preventive and therapeutic level.\n\nAnxiety\n\nAnxiety is defined as a feeling of fear, dread, and unease. It can cause sweating, tension and restlessness and increase the heart rate at rest. When it is temporary, it represents a normal physiological response, which can be caused by problems related to work, study or important decisions, but for those who suffer from it often (and sometimes daily) we speak of real anxiety disorders. Anxiety disorders are conditions in which the feeling of anxiety does not go away, and indeed can get worse over time. Symptoms can interfere with daily activities such as job performance, school and social relationships. Excluding causes due to health problems, the treatment is psychological and must be carried out by qualified professionals. According to scientific research, balanced nutrition, physical exercise and self-relaxation techniques are proving to be fundamental for this type of ailment. Making some lifestyle changes is definitely a way to help you manage this disorder. At the dietary level, excessive consumption of sugar and alcohol, as well as the abuse of caffeine, have an impact on mood and states of anxiety, making them worse. The abuse of these substances can also lead to low energy levels, nervousness and sleep disturbances.\n\nStress is also a typical problem that many of us face in everyday life. However, it is possible to learn some useful stress management techniques, such as relaxation and breathing techniques, which can be helpful in dealing with unavoidable stressors. In some cases, exercise can also help reduce the frequency and intensity of panic attacks. Exercise can also be an effective way to release built up physical and mental tension by reducing feelings of fear and worry.\n\nConclusions\n\nIt appears evident that our century is characterized by a series of pathologies and disorders that were certainly not widespread in the generations preceding ours. The reason is simple: in our hemisphere we live in abundance and in large-scale distribution. We are continually surrounded by products of all kinds, tempting food but dense in calories and with few vitamins and minerals. In addition, society always wants us to be good performers, capable of performing excellently, quickly and we are inundated with deadlines.\n\nIllnesses of affluence, i.e. those linked to overeating, physical inactivity, stress and pollution, are characteristic of more developed and high-income countries. In order to reduce both the risk of developing these pathologies and the social and economic costs associated with them, it is essential to implement important and effective prevention measures. It is our task to increasingly disseminate the culture of a healthy and active life, of conscious nutrition and weight control, long before resorting to pharmacological treatment.\n\nBibliography\n\nPetridou A, Siopi A, Mougios V. Exercise in the management of obesity. Metabolism. 2019 Mar;92:163-1 doi: 10.1016/j.metabol.2018.10.009. Epub 2018 Oct 29. PMID:30385379.\n\nCelik O, Yildiz BO. Obesity and physical exercise. Minerva Endocrinol (Torino). 2021 Jun;46(2):131-144. doi: 10.23736/S2724-6507.20.03361-1. Epub 2020 Nov 19. PMID: 33213121.\n\nStonerock GL, Hoffman BM, Smith PJ, Blumenthal JA. Exercise as Treatment for Anxiety: Systematic Review and Analysis. Ann Behav Med. 2015;49(4):542-56. doi:10.1007/s12160-014-9685-9\n\nSarris J, Moylan S, Camfield DA, et al. Complementary medicine, exercise, meditation, diet, and lifestyle modification for anxiety disorders: a review of current evidence. Evid Based Complement Alternat Med. 2012;2012:809653.  doi:10.1155/2012/809653\n\nLocke AB, Kirst N, Shultz CG. Diagnosis and management of generalized anxiety disorder and panic disorder in adults. Am Fam Physician. 2015;91(9):617-24.\n\nAmerican Psychiatric Association: Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition. Arlington, VA, American Psychiatric Association, 2013.\n\nMeredith SE, Juliano LM, Hughes JR, Griffiths RR. Caffeine Use Disorder: A Comprehensive Review and Research Agenda. J Caffeine Res. 2013;3(3):114-130. doi:10.1089/jcr.2013.0016",
    "contentLength": 8597,
    "url": "https://www.yamamotonutrition.com/int/blog/post/the-diseases-of-well-being-a1975",
    "slug": "the-diseases-of-well-being-a1975"
  },
  {
    "title": "The secret of youthfulness for quality ageing",
    "author": "ACHZOD",
    "date": "April 19, 2023",
    "category": "supplements and nutraceuticals",
    "fullContent": "What's the secret of youth?\n\nThe answer for us is very simple: being able to fully experience every moment of life. And how to fully live each day? Taking care of health, because the way we live really makes a difference.\n\nIn fact, the great challenge of medicine in our times is to make life expectancy coincide with active life expectancy, i.e. allow us to live long and healthy lives at the same time , preventing the pathologies that characterize old age and that do not allow us to \" act \", to carry out all the fundamental activities for man connected to the general conditions of existence and to the maintenance of physical and cognitive functions.\n\nWe must therefore pay attention to the quality of our aging (both internal and external).\n\nWhen we talk about skin aging , we mean a complex biological process resulting from two synergistic mechanisms: intrinsic and extrinsic factors. On the one hand, intrinsic or endogenous aging is an inevitable phenomenon that includes several factors, such as cellular metabolism, genetics, hormones and the passage of time: this type of aging is the one clinically associated with greater bone fragility and tissues and loss of elasticity. On the other hand, extrinsic agingor exogenous can be avoided, and is caused by repetitive exposure of the skin or body to harmful agents, especially UV light (photo-aging), an inappropriate and unregulated diet, pollution, chemicals and toxins [ 1,2].\n\nIt has been demonstrated that various ingredients of natural origin are potentially effective in reducing the signs of skin ageing, preventing skin problems and the onset of disorders and pathologies (3,4,5).\n\nIn this article we will see how taking nutraceuticals in the preventive field can really be the key to achieving successful aging .\n\nWhat actually happens as we get older\n\nAt the basis of the aging of all our cells we find 3 natural and physiological mechanisms, which every day our body puts in place to function optimally.\n\nI am:\n\nInflammation – a defense mechanism of the body that is activated in the presence of tissue damage of various kinds;\nOxidation – the effect of free radicals on molecules, which is counteracted by the presence of antioxidant substances;\nGlycation – a binding reaction between sugars and Protein, which causes an alteration of the functionality of the protein itself.\n\nThese processes, when present in the right quantities, have positive effects on our lives: over the years, however, the balance that characterizes them changes, leading to an imbalance which consequently causes damage and acceleration of the aging processes.\n\nActing on our lifestyle, with an integrated approach between diet, training and supplementation, can slow down these mechanisms, allowing us to enjoy the time that passes in health (and why not, visually more beautiful!).\n\nWhy Integration Makes a Difference (Long Term)\n\nIn the world we live in it is unfortunately easy to be exposed to micronutrient deficiencies. The foods we consume every day, often ultra-processed, are in fact rich in calories but poor in nutrients. This does not mean that we will notice any difference immediately: not having scurvy does not mean having optimal vitamin C intakes .\n\nTrue deficiency diseases no longer exist (except in some areas of the world), but this does not automatically lead to full health. Indeed, we tend to associate health with the absence of disease, but the reality is that it is something more .\n\nA sense of psycho-physical well-being , which can only be achieved if you feed yourself in an optimal way, increasing life expectancy but above all the quality of life.\n\nNutraceuticals for successful ageing\n\nAfter introducing the concepts of preventive medicine and slow-aging, we know that offering our body everything it needs is optimal for it to function at its best and improve the quality of life by slowing down the aging process.\n\nLet's see together a list of the most useful supplements to achieve successful aging.\n\nOmega-3 – Omega-3 fatty acids are necessary for the body to function properly and perform a protective function : they protect the heart, the brain and regulate heart pressure. Several studies have also shown that they fight the inflammatory mechanisms underlying diseases, including autoimmune ones. They are essential for counteracting ageing, because they act by slowing down the shortening of telomeres, the protective \"caps\" on our chromosomes which shorten with each cell division. They also reduce oxidative stress caused by an excess of free radicals, fighting inflammation.\n\nTurmeric – A spice widely used in cooking, Turmeric extract is known for being a powerful anti-inflammatory and for its antioxidant action. It seems to protect the brain in particular from aging and strengthen the immune system, and these positive effects are attributable to the presence of curcuminoids, bioactive compounds that make up the pigment extracted from turmeric.\n\nVitamin C – Ascorbic acid, another name by which vitamin C is called, is an essential nutrient for tissue repair, and in addition to supporting the functionality of the immune system, it is a powerful antioxidant, counteracts the formation of free radicals and actively participates in the biosynthesis of collagen molecules, responsible for the beauty of the skin and the elasticity of the tissues.\n\nVitamin A – Vitamin A helps form and maintain healthy skin, teeth, skeleton and membranes in our body. It is known as retinol because it produces pigments in the retina of the eye, promoting healthy vision, as well as being necessary for reproduction and lactation. It also nourishes the hair and delays its aging.\n\nB vitamins – All B vitamins are essential for turning food into energy. Many have an antioxidant role, reducing cellular damage and aging. Vitamin B1 is required for proper nerve impulse function; B6 plays an important role in brain development and hemoglobin formation; folic acid (B9) is used for the construction of red blood cells and prevents damage to the nervous system during embryonic life. Even a low level of vitamin B12 has been associated with the acceleration of aging processes, demonstrating a protective effect.\n\nVitamin D – Vitamin D deficiency is responsible for bone fragility, because vitamin D promotes calcium absorption and regulates the amount of phosphate in the body. These actions are essential for having strong and healthy bones, preventing the risk of bone fractures. It also enhances the activity of the immune system, protecting us from external attacks by viruses and bacteria.\n\nVitamin E – It acts in our body as a powerful antioxidant, protecting us from the effects of pollution, smoke, incorrect diet, factors that tend to increase oxidative stress. In particular, vitamin E protects cell membranes and prevents various degenerative diseases.\n\nAlpha lipoic acid – It is a powerful antioxidant, useful for reducing oxidative stress because it supports the activity of vitamins C, A and E. Its action also counteracts the glycation process, the reaction by which sugars bind to Protein, forming compounds harmful to health and aging. It also works by improving insulin sensitivity, reducing the occurrence of type 2 diabetes.\n\nCoenzymeQ10 – Supports energy production and has an antioxidant action. It stimulates the immune system and contributes to the protection of our organs, including the brain, from oxidative stress, slowing down ageing.\n\nCollagen – The intake of bioactive hydrolysed collagen peptides improves the appearance of skin, hair and connective tissues and stimulates the body to biosynthesise new collagen. It guarantees brightness, hydration and elasticity of the skin, as well as reducing the depth of wrinkles and signs of aging.\n\nHyaluronic Acid – Taken orally and not just as a topical cream, hyaluronic acid nourishes the connective tissue from within. It has a moisturizing and lubricating action on the skin and joints, fills the skin, making it firm and bright and protects the cartilage, reducing joint discomfort.\n\nAlthough each organ ages at different speeds, if we take care of ourselves from an early age by combining lifestyle, nutrition, training and integration, we can live better (and longer).\n\nPrevention starts with awareness, as does change.\n\nFederica Federici & Massimiliano Febbi\n\n \n\nBibliography\n\nGilchrest B.A. Age-associated changes in the skin. J. Am. Geriatr. Soc. 1982;30:139–143. doi: 10.1111/j.1532-5415.1982.tb01289.x.\n\nCevenini E., Invidia L., Lescai F., Salvioli S., Tieri P., Castellani G., Franceschi C. Human models of aging and longevity. Expert Opinion. Biol. Ther. 2008;8:1393–1405. doi: 10.1517/14712598.8.9.1393.\n\nSegger D., Schonlau F. Supplementation with Evelle improves skin smoothness and elasticity in a double-blind, placebo-controlled study with 62 women. J. Dermatol. Treat. 2004;15:222–226. doi: 10.1080/09546630410033772.\n\nNi Z., Mu Y., Gulati O. Treatment of melasma with pycnogenol. Phytother. Res. 2002;16:567–571. doi: 10.1002/ptr.1085.\n\nLosada-Echeberria M., Herranz-Lopez M., Micol V., Barrajon-Catalan E. Polyphenols as promising drugs against main breast cancer signatures. Antioxidants (Basel) 2017;6 doi: 10.3390/antiox6040088. \n\nFinch CE, Tanzi RE. Genetics of ageing. Science. 1997; 278: 407-11.\n\nRowe JW, Kahn RL. Human Aging: usual and successfull. Science. 1987; 237: 143-9.\n\nManolagas SC. From estrogen-centric to aging and oxidativestress: a revised perspective of the pathogenesis of osteoporosis. Endocr Rev. 2010; 31: 266-300.\n\nIwamoto J, Takeda T, Ichimura S. Effect of combined administration of vitamin D3 and vitamin K2 on bone mineral density of the lumbar spine in postmenopausal women with osteoporosis. J Orthop Sci. 2000; 5: 546-51.\n\nSalari P, Rezaie A, Larijani B, Abdollahi M. A systematic review of the impact of n-3 fatty acids in bone health and osteoporosis. Med Sci Monit. 2008; 14: 37-44.\n\nAlamdari N, O’Neal P, Hasselgren PO. Curcumin and muscle wasting-a new role for an old drug? Nutrition. 2009; 2: 125-9",
    "contentLength": 10021,
    "url": "https://www.yamamotonutrition.com/int/blog/post/the-secret-of-youthfulness-for-quality-ageing-a1977",
    "slug": "the-secret-of-youthfulness-for-quality-ageing-a1977"
  },
  {
    "title": "WADA, the World Anti-Doping Agency - actions and directives",
    "author": "ACHZOD",
    "date": "April 18, 2023",
    "category": "sport",
    "fullContent": "That of the substances to be used to improve sports performance is not a recent problem , even Hippocrates and Galen spoke of it in 400 BC and since then, depending on the importance of the competition, scientists, sorcerers, gurus and hucksters of all kinds have alternated , always and in any case in search of \"miraculous\" substance.\n\nObviously mostly these substances variously included in the athletes' programs very often have caused various and, in some cases, considerable health problems for the unfortunate people who used them. To this end, the need was felt to exercise control over the use of these substances and also of some methods that often accompanied the administration of the aforementioned; above all it was necessary to harmonize the classification of the substances to be prohibited with procedures valid for all the nations whose athletes were sent to the various competitions and, above all, to create a super-partes structure capable of controlling these activities and issuing updated classifications every year, and so was born thereWADA .\n\nWhat is WADA?\n\nThe World Anti-Doping Agency, in English World Anti-Doping Agency (WADA) , is a foundation with mixed public-private participation, created by the will of the International Olympic Committee on November 10, 1999 in Lausanne, to coordinate the fight against doping in sport . In 2002, its headquarters were moved to Montreal, Canada, although legally it remains a private law foundation, governed by Swiss civil law. WADA is therefore an international organization that delegates the work to individual nations and national anti-doping organizations (NADO), monitoring their work so that it complies with the World Anti-Doping Code. Furthermore, WADA accredits approx30 laboratories that carry out the scientific analyzes necessary for anti-doping control .\n\nThe WADA World Anti-Doping Code is a document drawn up in order to bring anti-doping regulations into compliance in all sports and, more importantly, in all countries . Contains a list , updated every year, of prohibited substances and methods that athletes cannot use . It was adopted by sports organizations in 2004, before the Athens Olympic Games. In November 2007, at the Third World Conference on Doping in Sport, more than 650 sports organizations (international sports federations, national anti-doping organisations, the IOC, the International Paralympic Committee and various professional federations from around the world) unanimously adopted a Code revision, effective January 1, 2009.\n\nThe WADA Prohibited List of Substances and Methods (WADA List) is the document identified as the International Standard for identifying substances and methods prohibited in sport . The WADA List is one of the most important components for the global harmonization of the worldwide anti-doping movement. Divided into categories, it identifies which substances and methods are prohibited In Competition, Out of Competition and in Particular Sports .\n\nThe WADA List is updated annually following an extensive consultation process coordinated by WADA and comes into force on 1 January each year. In our country, WADA rules are managed by NADO Italy - National Anti-Doping Organization (NADO) -, functional division of the World Anti-Doping Agency WADA, which has exclusive responsibility for the adoption of anti-doping sports rules in accordance with the World Anti-Doping Code ( WADA Code) to which it is a signatory.\n\nKEY ROLES AND RESPONSIBILITIES OF ATHLETES\n\nIt is the personal responsibility of each Athlete:\n\n- be aware of having to comply with the Sports Anti-Doping Rules (NSA) and know the obligations deriving from them;\n\n- always be available for the collection of a biological sample;\n\n- personally answerable for the use or intake of anything in the anti-doping context;\n\n- inform medical personnel of the prohibition of using prohibited substances and resorting to prohibited methods and ensure that any medical treatment received does not violate the NSA;\n\n- report to NADO Italy and its International Federation any decision made by a non-Signatory on an Athlete who has committed an anti-doping rule violation in the previous ten (10) years;\n\n- cooperate with Anti-Doping Organizations involved in the investigation of anti-doping law violations;\n\n- disclose the identity of your Support Personnel at the request of NADO Italy, a National Sports Federation, or any other Anti-Doping Organization having authority over the Athlete\n\nKEY ROLES AND RESPONSIBILITIES OF ATHLETE SUPPORT PERSONNEL\n\nIt is the personal responsibility of all Athlete Support Personnel to:\n\n- be aware of having to comply with the NSAs and know the obligations deriving from them;\n\n- collaborate in the implementation of anti-doping controls placed on the Athlete;\n\n- use one's influence on the Athlete, promoting values ​​and behaviors in contrast to doping;\n\n- report to NADO Italy and its International Federation any decision made by a non-Signatory on who has committed an anti-doping rule violation in the previous ten (10) years;\n\n- cooperate with Anti-Doping Organizations involved in the investigation of anti-doping law violations.\n\nAthlete Support Personnel must not use or possess any prohibited substance or employ any prohibited method, without valid justification.\n\nCLASSIFICATION OF SUBSTANCES\n\nWADA has classified the substances \" prohibited \" in sport using classic and clearly understandable methods. Here is a simple overview:\n\nSUBSTANCES AND METHODS ALWAYS PROHIBITED\nUnapproved substances\nAnabolic agents\nPeptide hormones, growth factors, related substances and analogues\nBeta-2 agonists\nHormones and metabolic modulators\nDiuretics and masking agents\nProhibited methods (e.g. transfusion of homologous substances – autohemo transfusion_ and of heterologous substances. Any form of intravascular manipulation, regardless of the substance introduced; etc.\nSUBSTANCES AND METHODS PROHIBITED DURING COMPETITIONS\nStimulants (specific and non-specific)\nNarcotics\nCannabinoids (except Cannabidiol CBD)\nGlucocorticoids\nSUBSTANCES PROHIBITED IN PARTICULAR SPORTS (* )\nBeta blockers\n(*) Archery; motoring; darts, billiards; golf; mini-golf; each type of shot; extreme ski events; underwater sports\nConclusions\n\nHowever, the fight against doping is constantly evolving, an update is presented every year capable of assimilating all the new substances that are gradually introduced in order to increase all phases of physical exercise almost always regardless of the protection of the health of the athletes.\n\n                                                                               Carmine Orlandi",
    "contentLength": 6644,
    "url": "https://www.yamamotonutrition.com/int/blog/post/wada-the-world-anti-doping-agency-actions-and-directives-a1976",
    "slug": "wada-the-world-anti-doping-agency-actions-and-directives-a1976"
  }
]
