{
  "slug": "alimentation-emotionnelle-comment-arreter",
  "title": "L'alimentation émotionnelle : pourquoi c'est si facile d'y céder",
  "excerpt": "Nous cherchons tous du réconfort quand nous sommes stressés. Pour certains, la réponse est la nourriture. Découvrez pourquoi notre corps nous pousse vers les aliments riches en glucides quand nous sommes stressés et comment combattre efficacement l'alimentation émotionnelle.",
  "content": "# L'alimentation émotionnelle : pourquoi c'est si facile d'y céder\n\n## Introduction\n\nNous cherchons du réconfort quand nous sommes stressés ; c'est indéniable et c'est dans notre nature. Qui ne veut pas le confort douillet de son lit après une journée de travail stressante ?\n\nOu de la musique pour se détendre, ou même un hobby apaisant. Nous avons tous nos besoins de confort « de référence » quand nous cherchons à gérer ou atténuer le stress, avec des différences variables.\n\nPour certaines personnes, la réponse à leur stress est la nourriture. Nous ne mangeons pas toujours pour satisfaire notre faim ; beaucoup d'entre nous se tournent également vers la nourriture pour le réconfort, le soulagement du stress ou pour se récompenser.\n\nManger pour se sentir mieux, pour combler des besoins émotionnels plutôt que la faim, est appelé « alimentation émotionnelle », une tendance à se gaver de nourriture quand on se sent stressé.\n\n## Points clés\n\n- Bien que l'alimentation émotionnelle occasionnelle ne soit pas nocive, l'adopter comme mécanisme d'adaptation principal ou utiliser la nourriture comme solution quand nous sommes en colère, stressés, ennuyés ou blessés, plutôt que de traiter le problème en question, devient un problème grave\n- Les glucides nous aident à supporter efficacement le stress car manger n'importe quel aliment sucré ou féculent comme les gâteaux, chips, pizzas, etc., permet au cerveau de produire de la nouvelle sérotonine\n- L'exercice est toujours la clé, et on ne saurait trop insister sur l'importance de maintenir et de travailler sur une routine d'exercice quotidienne\n\n## Le processus physiologique\n\nCela peut sembler étrange au début, car le stress inhibe la consommation alimentaire et la met en pause à court terme.\n\nQuand nous sommes stressés, notre système nerveux envoie des messages à nos glandes surrénales pour pomper de l'adrénaline, ce qui aide à déclencher la réponse de combat ou de fuite de notre corps, qui met temporairement notre appétit en pause.\n\nMais à long terme, c'est l'exact opposé. Si le stress persiste, les glandes surrénales libèrent une autre hormone appelée cortisol, qui augmente notre appétit et stimule la motivation, ce qui peut se transformer en cause de manger.\n\nUne fois le stress passé, les niveaux de cortisol diminuent généralement, mais si nous sommes constamment stressés, ils restent élevés, déclenchant ainsi fréquemment notre corps à manger sous stress.\n\n## Le problème avec l'alimentation émotionnelle\n\nBien que l'alimentation émotionnelle occasionnelle ne soit pas nocive, l'adopter comme mécanisme d'adaptation principal ou utiliser la nourriture comme solution quand nous sommes en colère, stressés, ennuyés ou blessés, plutôt que de traiter le problème en question, devient un problème grave.\n\nNon seulement nous ignorons la cause profonde du stress en mangeant, mais c'est aussi extrêmement malsain pour nous.\n\nLes aliments réconfortants ne sont généralement pas sains ; ils sont chargés de sucre ou de glucides, c'est pourquoi nous nous tournons vers eux en premier lieu !\n\nL'alimentation émotionnelle ne nous fait pas désirer des salades ou des légumes ; ce sont plutôt les fast-foods, les glaces, les sucreries, etc. Ce sont les aliments riches en graisses et en calories que nous aimons tant qui nous font nous sentir mieux. Plus l'aliment est gras, sucré ou salé, mieux nous semblons nous sentir.\n\nDe plus, le stress influence non seulement nos habitudes alimentaires mais affecte également notre métabolisme.\n\nDans une étude menée par la National Library of Medicine, les participants qui ont déclaré se sentir stressés au cours d'un cycle de 24 heures ont brûlé 104 calories de moins que les autres participants qui n'étaient pas soumis au stress.\n\n## Pourquoi notre corps a-t-il envie de glucides quand nous sommes stressés ?\n\nCarolyn Williams, diététicienne-nutritionniste, docteure, explique que nos corps ont envie de glucides quand nous sommes stressés car les glucides augmentent la production de sérotonine, qui est la substance chimique du bien-être.\n\nElle dit : « Les aliments riches en glucides (surtout ceux avec des sucres ajoutés, comme les glaces et les cupcakes) augmentent notre glycémie pour fournir une poussée d'énergie, dont nos corps pourraient avoir besoin après de longues journées stressantes ou des nuits sans sommeil. La plupart d'entre nous pourraient bénéficier de plus d'énergie et de sérotonine en ce moment, donc nos corps essaient probablement de nous aider en nous donnant faim de ce type d'aliments. »\n\nLes glucides nous aident à supporter efficacement le stress car manger n'importe quel aliment sucré ou féculent comme les gâteaux, chips, pizzas, etc., permet au cerveau de produire de la nouvelle sérotonine. La sérotonine nous rend plus calmes et, par conséquent, nous croyons pouvoir faire face.\n\nEn réalité, les glucides nous font nous sentir mieux temporairement mais ne traitent pas le problème de l'agent causant le stress.\n\n## Comment combattre l'alimentation émotionnelle ?\n\nVoici quelques conseils et exercices utiles pour combattre efficacement l'alimentation émotionnelle.\n\n### Vérification des déclencheurs\n\nLa première et principale étape pour contrer l'alimentation émotionnelle est de reconnaître efficacement ce qui nous pousse à manger pendant les périodes de stress. Quand nous réalisons que nous nous dirigeons vers le snack le plus proche en étant stressés, arrêtons-nous. Prenez toujours le temps de réfléchir et de faire le point avec vous-même. Connaissez votre comportement et ce qui déclenche nos réponses, et la prochaine fois, nous pourrons le reconnaître efficacement pour le mettre en pause. Simplement en faisant une pause et en évaluant la situation, nous pouvons comprendre ce qui nous pousse exactement à manger quand nous nous sentons anxieux.\n\n### Exercice\n\nL'exercice est toujours la clé, et on ne saurait trop insister sur l'importance de maintenir et de travailler sur une routine d'exercice quotidienne. Si nous sommes en bonne forme physique, nous sommes plus résistants au stress. L'exercice provoque des changements chimiques dans le cerveau qui réduisent le stress, ce qui peut nous aider à éviter les excès alimentaires. De plus, avec l'exercice, une alimentation équilibrée est également vitale. Quand nous nous en tenons rigoureusement à un régime, cela nous aide également à combattre la consommation inutile de malbouffe.\n\n### Méditation et pleine conscience\n\nEn développant une pratique de méditation et de pleine conscience, nous augmentons progressivement la conscience jusqu'à un point où elle devient l'adversaire le plus fort du stress. La pleine conscience et la conscience sont la kryptonite du stress. Quand nous sommes calmes, posés et concentrés, nous pouvons faire des choix de vie plus intelligents et plus sains, réduisant drastiquement le stress et l'anxiété. Dans une étude menée par le Journal of Obesity, les femmes qui ont suivi des programmes de formation à la pleine conscience, apprenant à reconnaître efficacement la faim, à la différencier de l'alimentation émotionnelle et à faire attention au goût, étaient moins susceptibles de manger émotionnellement et ont perdu une quantité significative de graisse abdominale. Quiconque a déjà fait de l'exercice pour se débarrasser de son ventre vous dira que c'est la partie la plus difficile de la graisse à éliminer, et qu'aucun exercice sans une alimentation appropriée ne peut vous aider à vous en débarrasser.\n\n### Auto-compassion\n\nPratiquer l'auto-compassion est un moyen efficace de diminuer le stress. Quand vous êtes un ami aimant envers vous-même, vous êtes plus susceptible de mieux vous traiter et de vous empêcher de manger de la malbouffe, cherchant à cultiver une relation saine et consciente avec vous-même.\n\n### Chercher des alternatives\n\nEt si tout le reste échoue, et que vous ne pouvez pas vous empêcher de grignoter des snacks quand vous êtes stressé, passez à une alternative plus saine ! Des aliments comme les mini-carottes, les graines de tournesol, les noix et les raisins secs, etc., sont des alternatives plus saines.\n\n## Conclusion\n\nConsommer des aliments réconfortants quand on est stressé est normal, et une indulgence occasionnelle ne nous fera pas grand mal.\n\nMais, comme on dit, trop d'une bonne chose peut être nocif.\n\nAlors la prochaine fois que vous tendez la main vers le pot de glace dans votre réfrigérateur quand vous êtes stressé, souvenez-vous d'être attentif, d'évaluer constamment la cause du stress et de faire le bon choix, le choix sain.\n\n## Avertissement\n\nLe contenu de cet article est fourni à titre d'information générale et éducative uniquement. Il ne fournit aucun conseil médical ni n'a l'intention de se substituer à un avis médical professionnel sur le traitement, le diagnostic, la prévention ou l'atténuation de toute maladie, trouble ou handicap. Consultez toujours votre médecin ou un professionnel de santé qualifié concernant votre état de santé et/ou vos préoccupations et avant d'entreprendre un nouveau régime de soins de santé, y compris tout changement alimentaire ou de mode de vie.\n\n---\n\n## Prêt à transformer votre nutrition ?\n\nDécouvrez nos formules de coaching personnalisé pour optimiser votre alimentation et votre santé métabolique.\n\n[Découvrir le coaching ACHZOD](https://www.achzodcoaching.com/formules-coaching)",
  "category": "nutrition",
  "author": "ACHZOD",
  "date": "2026-01-09",
  "readTime": "8 min",
  "image": "https://images.unsplash.com/photo-1499028344343-cd173ffc68a9?w=1200",
  "sourceUrl": "https://blog.ultrahuman.com/blog/stress-eating-tips-on-how-to-stop-it/",
  "charCount": 8247
}
