{
  "slug": "epoc-bruler-calories-apres-sport",
  "title": "EPOC : Bruler des calories meme apres avoir quitte la salle",
  "excerpt": "Votre corps continue de bruler des calories meme apres avoir termine votre entrainement. Ce processus s'appelle la consommation excessive d'oxygene post-exercice (EPOC), egalement connu sous le nom d'effet afterburn. Decouvrez comment l'exploiter.",
  "content": "# EPOC : Bruler des calories meme apres avoir quitte la salle\n\n## Table des matieres\n\n- Points cles\n- Production d'ATP : Voies aerobies et anaerobies\n- Qu'est-ce que l'EPOC/effet afterburn ?\n- Effet de l'EPOC sur votre corps\n- Types d'exercices qui declenchent l'effet EPOC\n- Conclusion\n\n## Introduction\n\nVotre corps continue de bruler des calories meme apres avoir termine votre entrainement. Ce processus s'appelle la consommation excessive d'oxygene post-exercice (EPOC), egalement connu sous le nom d'\"effet afterburn\".\n\nComprenons comment cela s'integre dans le processus de metabolisme, specifiquement les voies aerobies et anaerobies, et comment cela beneficie a votre corps.\n\n## Points cles\n\n- L'adenosine triphosphate (ATP) est produite soit avec de l'oxygene en utilisant les voies aerobies, soit sans oxygene en s'appuyant sur les voies anaerobies.\n- Le corps stocke l'energie sous forme de graisse pour l'efficacite. Il repond essentiellement a la consommation excessive d'oxygene post-exercice (EPOC) en liberant des acides gras dans la circulation sanguine.\n\n## Production d'ATP : Voies aerobies et anaerobies\n\nLe metabolisme est une serie de processus chimiques qui se deroulent dans chaque cellule, transformant les calories que nous mangeons en carburant pour nous maintenir en vie.\n\nCes processus maintiennent la vie et le fonctionnement quotidien, et incluent la decomposition de la nourriture et des boissons pour l'energie et la construction ou la reparation de nos corps. C'est aussi le processus qui produit l'adenosine triphosphate (ATP) a partir des nutriments consommes. L'ATP est utilisee comme carburant musculaire par le corps pendant l'exercice.\n\nL'ATP est produite soit avec de l'oxygene en utilisant les voies aerobies, soit sans oxygene en s'appuyant sur les voies anaerobies. Lorsque vous commencez a faire de l'exercice, votre corps utilise les voies energetiques anaerobies et l'ATP stockee pour alimenter cette activite.\n\nUn echauffement adequat est important car il peut falloir environ cinq a huit minutes pour pouvoir utiliser efficacement le metabolisme aerobie pour produire l'ATP necessaire a l'activite physique soutenue.\n\nUne fois qu'un etat stable de consommation d'oxygene est atteint, les voies energetiques aerobies sont capables de fournir la plupart de l'ATP necessaire a l'entrainement.\n\nL'exercice qui place une plus grande demande sur les voies energetiques anaerobies pendant l'entrainement peut augmenter le besoin en oxygene apres l'entrainement, ameliorant ainsi l'effet EPOC.\n\n## Qu'est-ce que l'EPOC/effet afterburn ?\n\nLe processus de consommation d'oxygene a un taux accru pour que le corps recupere ou se repose apres des exercices intenses s'appelle la consommation excessive d'oxygene post-exercice (EPOC). Cet etat de repos s'appelle l'homeostasie. Bien que les etudes sur l'EPOC soient souvent contradictoires ou non concluantes, certaines peuvent plaider en faveur de l'EPOC ou \"afterburn\" alors que le corps atteint l'homeostasie.\n\nCela se produit par une consommation accrue d'oxygene pendant environ 3 a 72 heures apres une seance d'exercice intense. Il est en outre identifie que \"l'EPOC reconstitue entre 6 et 15% de l'oxygene total depense par le corps lors de l'exercice\". Le processus EPOC comporte egalement l'avantage que le corps consomme plus d'energie ou de carburant, d'ou le terme \"afterburn\", qui signifie continuer a bruler du carburant apres avoir termine l'exercice.\n\n## Effet de l'EPOC sur votre corps\n\nLe corps stocke l'energie sous forme de graisse pour l'efficacite. Il repond essentiellement a la consommation excessive d'oxygene post-exercice (EPOC) en liberant des acides gras dans la circulation sanguine. Dans differentes etudes, il a ete etabli que :\n\n### 1. Utilisation des acides gras\n\nLe taux auquel les acides gras (AG) sont utilises par le corps augmente apres la periode de recuperation post-exercice. De plus, l'intensite de ce taux d'utilisation des acides gras est affectee a la fois par la duree et l'intensite de l'exercice.\n\n### 2. Consommation d'energie au repos\n\nLa recherche suggere que l'energie au repos consommee par le corps le matin apres un exercice intense peut etre significativement plus elevee que les jours qui ne suivent pas un exercice intense.\n\nEn consequence, tout exercice intense declenche une depense energetique ainsi qu'une oxydation des lipides pendant une periode prolongee.\n\nDans une etude de 7 hommes en bonne sante, les participants ont effectue un entrainement de resistance pendant environ 30 minutes. La consommation d'oxygene de l'experience a indique que \"l'EPOC dans le corps pourrait continuer a se produire bien au-dela de 16 heures apres un exercice intense\".\n\nCependant, la duree de l'EPOC peut etre aussi courte que 15 minutes. Elle se produit egalement chez les personnes en fonction de leur niveau de forme general et peut ne pas etre egalement benefique pour tous.\n\nIl y a divers benefices pour le corps de l'EPOC, se produisant au cours de la duree de son effet.\n\nPrincipalement, ceux-ci sont :\n\n### Plus de calories brulees sans effort supplementaire\n\nUne etude de 2015 publiee dans \"The Journal of Strength and Conditioning Research\" montre que les personnes qui font des exercices comme l'entrainement par intervalles a haute intensite (HIIT) peuvent bruler plus de calories que celles qui passent des quantites de temps similaires a faire des exercices a etat stable.\n\n### Entrainements plus rapides\n\nMalgre moins de temps passe a s'entrainer en utilisant les methodes HIIT, l'EPOC genere par l'intensite d'exercice accrue permet de bruler plus de calories en moins de temps.\n\n### Perte de poids potentielle\n\nUne revue de 2017 publiee dans \"Obesity Reviews\" detaille que trois seances de HIIT pourraient avoir \"autant d'impact sur la reduction de la graisse, de la masse et du tour de taille chez ceux en surpoids\" que l'exercice ou l'entrainement a etat stable.\n\n### Performance sportive amelioree\n\nUne experience de 2016 sur des rameurs bien entraines a conclu que le HIIT effectue sur huit semaines a une puissance de sortie maximale (PPO) maximisee avait une efficacite plus elevee que l'entrainement longue distance lente (LSD) pour ameliorer la performance d'aviron ainsi que les capacites athletiques comme l'absorption d'oxygene et la puissance de sortie aux niveaux d'absorption d'oxygene maximale.\n\n### Fonctions physiologiques supplementaires\n\nL'oxygene remplit diverses fonctions dans le corps apres l'exercice. Il peut reconstituer l'ATP consommee par l'exercice, ainsi que restaurer le compte d'oxygene a travers le sang veineux, le sang musculaire squelettique et la myoglobine.\n\nIl peut stabiliser la temperature du corps lorsqu'il atteint un etat de repos, egalement appele homeostasie. Il peut egalement se combiner avec des proteines pour restaurer tout tissu musculaire endommage ou use par l'entrainement.\n\nDe plus, l'EPOC aide a l'elimination du lactate, ainsi qu'a catalyser la resynthese de la phosphocreatine. L'elimination du lactate previent un impact perturbateur sur les processus metaboliques. Apres une periode de concentration de lactate, soit les niveaux de concentration, soit l'hydrogene accompagnant de tels niveaux de concentration de lactate commencent a avoir un impact sur la contraction musculaire.\n\nCela empeche la facon dont un tel muscle peut fonctionner pour effectuer des exercices avec des rafales courtes et intenses comme le HIIT. La resynthese de la phosphocreatine est essentielle, car c'est la premiere reserve disponible d'ATP. L'exercice intense peut diluer sa puissance jusqu'a aussi bas que 30% par rapport aux niveaux trouves aux niveaux de repos.\n\n## Types d'exercices qui declenchent l'effet EPOC\n\nLa consommation excessive d'oxygene post-exercice (EPOC) a ete montree comme dependant de la duree et de l'intensite de l'exercice.\n\nBien que la duree de l'exercice ait un effet lineaire sur l'EPOC, certaines preuves indiquent egalement une relation exponentielle entre l'EPOC et l'intensite de l'exercice pour certaines durees.\n\nUn EPOC prolonge de 3 a 24 heures peut resulter de certaines metriques d'exercice, indiquees comme etant de 50 minutes ou moins pour 70% ou plus de VO2max (le taux maximal de consommation d'oxygene) et 6 minutes ou moins pour 105% ou plus de VO2max.\n\nIl y a des preuves que l'entrainement de resistance s'avere avoir un effet EPOC plus durable.\n\nEn considerant les faits suivants, certains exercices sont plus adaptes pour debloquer l'EPOC en nous :\n\n1. Il y a des preuves que l'entrainement de resistance ou de force peut debloquer jusqu'a 72 heures d'effets EPOC chez les personnes sous certaines conditions de repetition de series.\n\n2. Des routines de cyclisme de 30 minutes avec des elements d'entrainement par intervalles et des sprints qui entrecoupent des rafales de rythme de 30 secondes avec des periodes de recuperation.\n\n3. La plyometrie, c'est-a-dire une gamme de sauts d'exercice concus pour maintenir et developper la puissance, et la natation en alternant des rafales de sprints de rythme et de recuperation.\n\n4. Essentiellement tous les entrainements qui suivent les principes de l'entrainement par intervalles a haute intensite (HIIT) peuvent debloquer les effets de l'EPOC sur ceux qui les effectuent.\n\n## Conclusion\n\nLe corps humain pourrait continuer a consommer et bruler des calories alors qu'il recupere d'exercices intenses. Ce processus, appele consommation excessive d'oxygene post-exercice (EPOC), est informellement connu comme l'\"effet afterburn\".\n\nIl affecte la disponibilite de l'energie d'exercice par la production d'ATP par des moyens ou voies aerobies et anaerobies. L'impact de l'EPOC depend plus de l'intensite d'un exercice que de sa duree.\n\nCertaines des recherches anterieures sur l'EPOC ont ete moins concluantes. Cependant, des recherches plus recentes indiquent que des exercices d'intensite effectues sur une courte periode de temps par des personnes avec de bons niveaux de forme peuvent produire un impact de combustion calorique substantiel.\n\nCela se produit par le corps consommant des quantites excessives d'oxygene alors qu'il atteint un etat de repos ou homeostasie.\n\nIl y a aussi des benefices physiologiques supplementaires a ce processus qui impactent les muscles et les nutriments dans la circulation sanguine. Vous pouvez debloquer l'EPOC par une gamme d'exercices qui suivent les principes de l'entrainement par intervalles a haute intensite (HIIT).\n\n## Avertissement\n\nLe contenu de cet article est destine a des fins d'information generale et d'education uniquement. Il ne fournit aucun avis medical et ne pretend pas se substituer a l'avis medical professionnel sur le traitement, le diagnostic, la prevention ou le soulagement de toute maladie, trouble ou handicap. Consultez toujours votre medecin ou un professionnel de sante qualifie concernant votre etat de sante et/ou vos preoccupations avant d'entreprendre un nouveau regime de sante, y compris tout changement alimentaire ou de mode de vie.\n\n---\n\n## Pret a maximiser vos performances ?\n\nDecouvrez nos formules de coaching personnalise pour atteindre votre potentiel physique.\n\n[Decouvrir le coaching ACHZOD](https://www.achzodcoaching.com/formules-coaching)",
  "category": "performance",
  "author": "ACHZOD",
  "date": "2026-01-09",
  "readTime": "9 min",
  "image": "https://images.unsplash.com/photo-1534438327276-14e5300c3a48?w=1200",
  "sourceUrl": "https://blog.ultrahuman.com/blog/epoc-burn-calories-even-after-leaving-gym-2/",
  "charCount": 9654
}
