{
  "slug": "regime-iifym-explique",
  "title": "Le régime IIFYM expliqué : comment ça marche et que manger",
  "excerpt": "L'IIFYM (If It Fits Your Macros) est une approche nutritionnelle flexible qui privilégie les objectifs en macronutriments plutôt que l'interdiction d'aliments. Découvrez comment calculer vos macros, quoi manger, et les avantages et inconvénients de cette méthode populaire.",
  "content": "# Le régime IIFYM expliqué : comment ça marche et que manger\n\n## Points clés\n\n- L'IIFYM (If It Fits Your Macros, ou « Si ça rentre dans tes macros ») privilégie les objectifs quotidiens en macronutriments plutôt que la restriction de groupes alimentaires\n- Bien qu'il favorise la perte de poids, le suivi centré sur les macros peut négliger les impacts sur la glycémie et d'autres facteurs de santé\n- Les micronutriments comme les vitamines et minéraux peuvent être négligés lorsqu'on se concentre uniquement sur les macros\n\n## Comment suivre l'IIFYM\n\n### Calculer vos macros\n\nLa méthode implique quatre étapes :\n\n1. **Trouvez votre MB (métabolisme de base) :** Calculez les calories que votre corps utilise au repos en utilisant votre âge, sexe, taille, poids et pourcentage de masse grasse\n\n2. **Ajustez selon votre niveau d'activité :** Multipliez votre MB par un facteur d'activité pour déterminer votre Dépense Énergétique Totale Quotidienne (DETQ)\n\n3. **Définissez votre objectif :** Réduisez la DETQ de 10 à 25 % pour la perte de poids ; augmentez de 5 à 15 % pour la prise de poids\n\n4. **Fixez vos objectifs de macros :** Les protéines devraient être de 1,5 à 2,2 g par kilo de poids corporel\n\nLes calculateurs de macros en ligne automatisent ce processus. La constance est essentielle — suivez votre apport quotidien avec des applications ou des balances numériques pour atteindre vos objectifs avec précision.\n\n## Que manger avec l'IIFYM\n\nAucun aliment n'est interdit, bien que les choix riches en nutriments soutiennent mieux les objectifs. Les sources recommandées incluent :\n\n- **Protéines :** viandes, produits laitiers, œufs, légumineuses, noix, fruits de mer\n- **Lipides :** avocats, noix, poissons gras, huile d'olive\n- **Glucides :** fruits, légumes, céréales complètes\n\nL'approche permet des plaisirs occasionnels comme le chocolat ou le fast-food, mais les aliments complets qui favorisent la satiété et la santé globale donnent les meilleurs résultats.\n\n## Avantages de l'IIFYM\n\n- **Flexible et durable :** L'absence d'aliments interdits favorise la constance\n- **Éducatif :** Développe la compréhension du contenu des aliments et des portions\n- **Personnalisable :** S'adapte à la perte de graisse, la prise de muscle ou le maintien\n- **Aide à la gestion du SOPK :** Des preuves suggèrent que les régimes équilibrés en macros et riches en protéines peuvent aider les femmes atteintes du SOPK à gérer leur poids\n- **Convient aux personnes peu actives :** S'ajuste au niveau d'activité, fonctionne pour les personnes à mobilité limitée\n\n## Inconvénients de l'IIFYM\n\n1. **Micronutriments négligés :** Se concentrer sur les macros peut négliger les vitamines et minéraux essentiels\n\n2. **Non adapté aux conditions de santé :** Les personnes diabétiques ou souffrant de problèmes rénaux peuvent avoir besoin de modifications en raison des contraintes sur les macros\n\n3. **Validation scientifique limitée :** Bien que les régimes basés sur les macros montrent des bénéfices, l'IIFYM manque de recherches évaluées par des pairs ; les promoteurs sur les réseaux sociaux peuvent manquer de formation nutritionnelle formelle\n\n4. **Risque de troubles alimentaires :** Le suivi obsessionnel des macros peut aggraver l'anxiété alimentaire ou contribuer aux troubles alimentaires, particulièrement chez les populations vulnérables\n\n## Conclusion\n\nL'IIFYM offre « une façon efficace et moins restrictive de poursuivre des objectifs de poids », mettant l'accent sur la conscience, la flexibilité et la constance plutôt que sur un régime rigide. Cependant, le succès à long terme nécessite de l'associer à des habitudes alimentaires saines, un sommeil adéquat, une activité physique et une attention aux micronutriments. Les personnes ayant des conditions de santé sous-jacentes ou des antécédents de troubles alimentaires devraient consulter des professionnels de santé avant de commencer.\n\n---\n\n## Prêt à transformer votre nutrition ?\n\nDécouvrez nos formules de coaching personnalisé pour optimiser votre alimentation et votre santé métabolique.\n\n[Découvrir le coaching ACHZOD](https://www.achzodcoaching.com/formules-coaching)",
  "category": "nutrition",
  "author": "ACHZOD",
  "date": "2026-01-09",
  "readTime": "5 min",
  "image": "https://images.unsplash.com/photo-1490645935967-10de6ba17061?w=1200",
  "sourceUrl": "https://blog.ultrahuman.com/blog/what-is-iifym-diet/",
  "charCount": 3847
}
