{
  "slug": "sarms-guide-complet-debutant",
  "title": "7 Types de SARMs : Benefices, Effets Secondaires et Demi-vie",
  "content": "# 7 TYPES DE SARMS : BENEFICES, EFFETS SECONDAIRES ET DEMI-VIE\n\n**Auteur : ACHZOD**\n\n---\n\n## Les Differents Types de SARMs et Leurs Fonctions\n\nPour vous aider a naviguer dans cet article sur les types de SARMs, nous avons inclus une table des matieres avec des liens vers chaque section :\n\n- Que sont les SARMs ?\n- Comment fonctionnent les SARMs ?\n- Liste des SARMs et leurs utilisations\n- Les SARMs sont-ils surs ?\n- Les SARMs sont-ils legaux ?\n- Notre conclusion\n\n---\n\nLes SARMs sont une classe de supplements de plus en plus populaire pour les athletes et les bodybuilders cherchant a ameliorer leur physique et leurs performances. Il existe plusieurs types de SARMs disponibles, c'est pourquoi nous avons elabore ce guide pour mieux comprendre les differences entre eux !\n\n---\n\n## Que sont les SARMs ? (Signification de \"SARMs\" expliquee)\n\nSARMS, egalement connus sous le nom de Modulateurs Selectifs des Recepteurs aux Androgenes - que sont-ils ?\n\nLe recepteur aux androgenes (RA) est un membre de la famille des hormones steroides et joue un role important dans la physiologie des tissus. Ce recepteur inclut les glucocorticoides, les recepteurs mineralocorticoides, ER, PR et le recepteur de la vitamine D3 - points cles pour cet article.\n\nLes ligands du RA incluent la testosterone circulante et la dihydrotestosterone locale qui se lient au RA pour l'activer. Cependant, il y a des limites au metabolisme et a la reactivite avec d'autres recepteurs quant a l'efficacite reelle de l'utilisation d'androgenes steroides therapeutiques.\n\nLes SARMS ont ete decouverts pour \"selectionner les tissus\" recepteurs afin de promouvoir leurs effets benefiques des androgenes sans les effets secondaires indesirables.\n\nLes recepteurs aux androgenes se trouvent partout dans le corps - muscles, os, prostate, organes sexuels secondaires et vesicules seminales. Mais en termes de culturisme, la seule partie sur laquelle nous voulons vraiment voir des effets de taille, de masse et de force est les muscles.\n\nQuand une cellule androgene est stimulee par la testosterone, cela active une enzyme appelee 5-a-reductase qui convertit la testosterone en dihydrotestosterone (DHT) - une hormone androgene qui est 10 fois plus puissante que la testosterone. L'activation du RA est realisee par la liaison du ligand DHT au point de liaison du RA, ce qui provoque ensuite des changements conformationnels et une phosphorylation et une liaison finale a l'element de reponse aux androgenes (ARE). L'ARE module ensuite la transcription des genes sensibles aux androgenes. Si la testosterone est trop elevee, une enzyme appelee aromatase convertit la testosterone en estrogene, qui exerce ensuite des effets de type estrogene dans la cellule. Une petite quantite de cela se produit naturellement, car l'estrogene est necessaire dans le corps d'un homme ainsi que la testosterone. Mais trop d'estrogene et c'est a ce moment-la que des symptomes feminins commencent a apparaitre.\n\nDans des circonstances normales, le corps regule soigneusement sa production d'androgenes par des mecanismes de retroaction pour prevenir les desequilibres. Prendre toute forme de steroide anabolisant, SARM ou modulateur d'estrogene perturbe ce mecanisme naturel de maniere bonne ou mauvaise.\n\nLes principaux modulateurs androgenes utilises par les athletes se trouvent sous forme de \"steroides anabolisants\". Ceux-ci sont connus pour augmenter la masse musculaire, la croissance et la force.\n\nIl faut noter que la testosterone n'est pas classee comme un steroide anabolisant - car c'est une hormone naturellement presente dans le corps. Le probleme avec l'utilisation d'anabolisants, ce sont les effets secondaires (selon le type utilise), cependant tant que quelqu'un s'entraine bien, l'utilisation de steroides anabolisants est tres efficace. C'est pourquoi les SARMS ont ete decouverts, pour trouver les effets positifs des steroides anabolisants, sans les effets negatifs du steroide.\n\nLes SARMs ne sont pas toxiques pour le foie et ont peu d'effet sur la pression arterielle. Cela elimine le besoin de supplements de precharge et de soutien en cycle. Par consequent, un cycle de SARM sera finalement moins couteux qu'un cycle traditionnel AAS/PH (steroide/prohormone). Les risques d'effets secondaires lies aux estrogenes et de retention d'eau sont egalement significativement plus faibles.\n\n---\n\n## Comment fonctionnent les SARMs ?\n\nLes SARMs ciblent les recepteurs aux androgenes dans le corps pour exercer leurs effets la ou nous le voulons - principalement les muscles, mais aussi en augmentant la densite osseuse. Lorsque le SARM se lie au recepteur aux androgenes, il dit au corps de produire plus de testosterone, ce qui peut aider a obtenir les resultats que nous recherchons dans les sports de physique et de performance, tels qu'une augmentation de la masse maigre, de la force et de la recuperation.\n\n### Quels SARMs ne sont pas suppressifs ?\n\nEn theorie, les SARMs ne devraient pas etre suppressifs, car vous ne supplementez pas de testosterone exogene. Cependant, ce n'est pas toujours aussi clair, et des utilisateurs de SARMs ont signale des problemes pour ne pas avoir effectue de PCT apres des cycles intenses. Nous n'aimerions pas dire qu'il existe des 'SARMs non suppressifs' car cela semble etre tres individuel. Les SARMs plus doux, comme l'Andarine ou l'Ostarine, a des doses faibles a moderees, semblent etre moins suppressifs. La recuperation d'un cycle de SARMs peut souvent etre effectuee avec des supplements en vente libre.\n\n### Quels SARMs sont les moins suppressifs ?\n\nPour eviter la suppression, commencez avec l'un des SARMs plus doux mentionnes precedemment a la dose efficace la plus basse, et faites des cycles courts. 4 semaines devraient suffire pour voir des resultats de votre premier cycle ! Avant d'augmenter la dose ou d'ajouter un autre SARM, cherchez a ameliorer les effets avec un supplement non hormonal qui fonctionne par une autre voie, comme la cardarine ou l'ibutamoren.\n\n### Quels sont les SARMs les plus suppressifs ?\n\nLes SARMs les plus suppressifs sont les plus puissants, surtout lorsqu'ils sont utilises pendant de tres longs cycles. Les SARMs les plus puissants incluent le YK-11, que nous suggererions uniquement pour les utilisateurs tres avances.\n\n### Peut-on prendre differents SARMs ensemble ?\n\nOui ! Les stacks de SARMs sont la facon logique de progresser dans votre utilisation si vous atteignez un plateau ou si vous recherchez quelque chose de plus puissant. Cela signifie egalement que vous pouvez recolter les recompenses de deux SARMs differents. Par exemple, le point fort de l'un pourrait etre des gains maigres et secs, tandis que le point fort d'un autre pourrait etre une recuperation amelioree. L'empilement de SARMs ne devrait etre fait qu'avec les conseils appropries.\n\n---\n\n## Quels sont les differents types de SARMs ? (Liste complete des SARMs et ce qu'ils font)\n\n### 1. LGD 4033 (Aussi appele Ligandrol)\n\nLe LGD 4033 est un SARM comme l'Ostarine mais 12 fois plus puissant a seulement 1/3 de la dose ! Par consequent, il est plus suppressif pour l'axe HPTA (Axe Hypothalamus-Hypophyse-Testicules - le systeme de l'hypothalamus, de la glande pituitaire et des glandes gonadiques, qui joue un role vital dans le developpement et la regulation des systemes reproducteur et immunitaire). Donc, une therapie post-cycle avec un SERM (modulateur selectif des recepteurs aux estrogenes) est recommandee.\n\n#### Benefices du LGD 4033\n\nAlors que l'Ostarine est l'un des meilleurs SARMs a inclure dans un cycle de seche, le LGD a prouve son efficacite comme agent de prise de masse.\n\nDans une etude realisee a l'Universite de Boston, des hommes en bonne sante a qui on a donne 1mg de LGD quotidiennement ont gagne environ 1,4 kg en 3 semaines en moyenne. Aucun changement cliniquement significatif n'a ete note dans les tests de fonction hepatique, le PSA (tests de problemes/fonctions prostatiques), l'hematocrite (tests sur le rapport entre le volume de globules rouges et le volume total de sang) ou l'ECG (tests d'electrocardiogramme, utilises pour verifier le rythme et l'activite electrique du coeur).\n\n#### Effets Secondaires du LGD 4033\n\nEtant donne le potentiel d'effets secondaires lies aux estrogenes eleves lors de l'utilisation du ligandrol, il est recommande d'acheter un supplement anti-estrogene.\n\n#### Demi-vie du LGD 4033\n\nLa demi-vie du LGD semble etre d'environ 24 a 36 heures. Cela signifie que vous pouvez prendre votre dose en une seule prise a la meme heure chaque jour.\n\n---\n\n### 2. MK 677 (Aussi appele Ibutamoren)\n\nC'est un agoniste non peptidique, actif par voie orale et selectif du recepteur secretagogue de l'hormone de croissance (stimulant la secretion). Il imite l'action de la ghreline (l'hormone qui regule l'appetit et la distribution et le taux d'utilisation de l'energie) dans l'estomac, augmentant les niveaux d'hormone de croissance et d'IGF-1, mais n'affecte pas les niveaux de cortisol.\n\n#### Benefices du MK 677\n\nDes etudes sur l'homme ont montre qu'il augmente a la fois la masse musculaire et la densite minerale osseuse. Dose a 25mg par jour, l'Ibutamoren a montre une augmentation des niveaux d'IGF-1 de 60% en 6 semaines chez l'homme. Une augmentation de 72% des niveaux d'IGF-1 a ete observee apres 12 mois.\n\nL'Ibutamoren n'est pas hormonal et ne necessite donc pas de PCT apres la fin du cycle. Il est mieux utilise dans un cycle d'au moins 3 mois avec un dosage augmentant chaque mois. Le moment optimal de dosage pour le MK 677 est le soir juste avant d'aller au lit. Vous devriez commencer a remarquer un sommeil plus profond presque immediatement. Si vous vous reveillez avec des mains engourdies ou des picotements, ne vous inquietez pas. C'est un effet secondaire courant de l'hormone de croissance supplementaire dans le systeme.\n\n#### Effets Secondaires du MK 677\n\n- Augmentation de la faim\n- Lethargie\n- Sensibilite a l'insuline alteree\n- Retention d'eau\n\n#### Demi-vie du MK 677\n\nLa demi-vie du MK 677 est d'environ 24 heures. Cela signifie que vous pouvez le prendre une fois par jour si vous le souhaitez. Ceux qui le prennent pour augmenter l'appetit pourraient le prendre le matin, mais s'il vous rend lethargique, vous voudrez peut-etre le prendre avant de vous coucher.\n\n---\n\n### 3. GW 501516 (Aussi appele Cardarine)\n\nLa Cardarine n'est en fait pas un SARM. En fait, c'est un Modulateur PPAR Delta - un agoniste selectif avec une haute affinite pour les PPAR (recepteurs actives par les proliferateurs de peroxysomes - un groupe de proteines detectant les steroides et les hormones thyroidiennes qui controlent l'expression des genes, regulant ainsi le developpement cellulaire et le metabolisme).\n\n#### Benefices du GW 501516\n\nCette modulation des PPAR permet au corps d'utiliser plus de glucose et de creer plus de tissu musculaire.\n\nLes supplements de Cardarine regulent egalement les diverses proteines que le corps utilise pour l'energie. Pour l'utilisateur, cela signifie une augmentation de l'energie et de l'endurance, et cela peut aussi signifier une augmentation de la masse musculaire. Il est egalement possible que le GW puisse avoir un effet positif sur la pression arterielle et le profil lipidique.\n\nLe dosage est dans la plage de 7mg a 21mg, avec 14mg etant le \"point ideal\". Le cycle GW moyen est generalement de 4 a 12 semaines. Le GW n'est pas hormonal et ne necessite donc pas de PCT. Cependant, il fonctionne bien dans un stack de SARMs pour augmenter davantage la perte de graisse et l'endurance.\n\n#### Effets Secondaires du GW 501516\n\nDes etudes sur les rats ont suggere des risques potentiels pour la sante avec la supplementation en cardarine, ce qui a entraine l'arret des essais humains sur le compose.\n\n#### Demi-vie du GW 501516\n\nLa Cardarine a une demi-vie d'environ 24 heures.\n\n---\n\n### 4. RAD 140 (Aussi appele Testolone)\n\n#### Benefices du RAD 140\n\nLe Radarine est tres nouveau, donc il n'y a pas beaucoup de donnees concretes dessus pour l'instant. Cependant, il semble tres prometteur, avec un ratio anabolique/androgenique impressionnant de 90:1 ! Cela signifie que les utilisateurs peuvent experimenter une multitude d'effets de construction musculaire sans tous les effets secondaires androgeniques associes.\n\nLe RAD est suffisamment puissant pour limiter l'effet de la testosterone sur la prostate et d'autres zones indesirables. Il a meme ete demontre comme etant plus anabolique que la testosterone egalement. Le dosage semble etre dans la plage de 4mg a 12mg, avec une duree de cycle optimale de 4 a 6 semaines. Etant donne sa demi-vie plus courte (16 heures), le RAD doit etre dose au moins deux fois par jour.\n\n#### Effets Secondaires du RAD 140\n\nSuppression de la testosterone.\n\n#### Demi-vie du RAD 140\n\n15-20 heures.\n\n---\n\n### 5. MK 2866 (Aussi appele S22, Ostarine ou Enobosarm)\n\n#### Benefices du MK 2866\n\nLe MK 2866 est probablement le SARM le plus connu. Il est mieux utilise pour preserver la masse musculaire tout en etant en deficit calorique.\n\n#### Effets Secondaires du MK 2866\n\nL'Ostarine mk-2866 peut et va supprimer votre production naturelle de testosterone dans des cycles plus longs et a doses plus elevees, donc une PCT avec SERM est necessaire. L'Ostarine peut aussi causer une gynecomastie chez certains utilisateurs, il est donc recommande d'avoir un IA sous la main. La duree moyenne du cycle est de 6 a 10 semaines a une plage de dosage de 10mg a 25mg.\n\n#### Demi-vie du MK 2866\n\nL'Ostarine a une demi-vie d'environ 24 heures.\n\n---\n\n### 6. S4 (Aussi appele Andarine)\n\nL'Andarine agit comme un constructeur musculaire similaire aux prohormones mais avec moins d'effets secondaires androgeniques. Il est plus doux, ce qui le rend adapte a certaines femmes a faibles doses. Lorsqu'il est empile avec la Cardarine, il soutient la perte de graisse et l'endurance.\n\n#### Benefices du S4\n\n- Augmentation de la retention musculaire pendant le regime\n- Augmentation de la masse musculaire maigre\n- Peut etre empile\n- L'une des meilleures options pour les femmes\n- Augmentation de la solidite osseuse\n\n#### Effets Secondaires du S4\n\nUn effet secondaire unique du S4 est les changements de vision. L'Andarine peut causer une teinte jaune a etre vue sur les yeux, surtout la nuit. Cela peut se developper apres quelques semaines d'utilisation une fois que la molecule s'est liee aux recepteurs dans les yeux.\n\n#### Demi-vie du S4\n\nLa demi-vie du S4 n'est que d'environ 4 heures chez l'homme, il serait donc judicieux de diviser les doses.\n\n---\n\n### 7. YK-11\n\nLe Ykareal est un compose puissant souvent classe comme supplement selectif, mais il partage des caracteristiques avec des produits plus intenses. C'est l'un des supplements de culturisme les plus puissants, recommande strictement pour les athletes masculins avances qui ont de l'experience avec des produits similaires.\n\n#### Benefices du YK-11\n\n- Augmentation de la masse musculaire\n- Os plus solides\n- Action rapide\n\n#### Effets Secondaires du YK-11\n\nLes effets secondaires du YK-11 incluent des douleurs articulaires, une toxicite hepatique et une agressivite accrue.\n\n#### Demi-vie du YK-11\n\nLa demi-vie du YK-11 a ete suggeree entre 6 et 12 heures.\n\n---\n\n## Les SARMs sont-ils surs ?\n\nLes SARMs sont-ils surs ? La plupart des SARMS qui ont ete developpes jusqu'a present cherchent a surmonter les effets potentiels de virilisation et/ou d'aromatisation des androgenes steroides. Cela a ete realise en recherchant des agonistes selectifs tissulaires du RA qui pourraient potentiellement activer le RA dans des tissus specifiques tout en en epargnant d'autres.\n\nLes SARMS actuellement developpes sont non-steroidiens, ce qui signifie qu'ils ne sont pas susceptibles au metabolisme enzymatique des tissus cibles. Rappelez-vous, il y avait certaines enzymes qui convertissaient la DHT en metabolites, ou synthetisaient la testosterone a partir du precurseur androstenedione, les SARMS ne sont pas affectes par ces enzymes. Cela signifie que les SARMS ne se convertissent pas ou ne se decomposent pas en molecules indesirables qui causent des effets secondaires, comme la DHT et l'estrogene.\n\nLe ratio anabolique/androgenique des steroides est de 1:1. C'est-a-dire que vous obtenez l'effet de construction musculaire en meme temps que vous pouvez avoir une gynecomastie par exemple. C'est la que les SARMS peuvent entrer en jeu. Ils sont plus selectifs pour stimuler les effets anaboliques de la construction musculaire plutot que de causer les effets secondaires androgeniques. Ce ratio peut commencer aussi bas que 3:1 ou aller aussi haut que 10:1.\n\nLes SARMS sont un groupe de medicaments synthetiques qui imitent les effets de la testosterone dans les muscles et les os avec un impact minimal sur les autres organes et des effets secondaires reduits COMPARES a ceux des agents anabolisants. La theorie est donc que vous pouvez avoir les avantages des steroides sans les effets secondaires.\n\n---\n\n## Les SARMs sont-ils legaux ?\n\nTous les SARMS sauf le RAD-140 sont interdits par l'Agence Mondiale Antidopage (AMA) et la plupart des autres organisations sportives mondiales. Par consequent, si vous participez a un evenement teste ou a un sport sanctionne qui interdit specifiquement l'utilisation d'agents anabolisants, alors les SARMS ne sont pas pour vous. Cependant, si vous ne prevoyez pas de concourir, alors les SARMS pourraient faire partie de votre routine quotidienne, a condition que vous n'achetiez que chez une entreprise reputee et que vous ne les revendiez pas.\n\n---\n\n## Notre conclusion sur les differents types de SARMs\n\nIl existe maintenant un certain nombre de SARMs differents sur le marche pour repondre a differentes exigences. Avez-vous essaye les SARMs ? Choisiriez-vous l'un de cette liste de SARMs plutot que d'autres mesures comme les prohormones ? Partagez vos experiences avec nous.",
  "sourceUrl": "https://www.predatornutrition.com/articlesdetail?cid=types-of-sarms-and-their-benefits",
  "originalChars": 15426,
  "translatedChars": 16842
}
