{
  "title": "7 Different Types of SARMs (Benefits, Side Effect & Half Life Listed)",
  "content": "Home\nArticles\nNutrition\nTraining\nSupplements\nHealth\nMiscellaneous\nResearch Review\n7 DIFFERENT TYPES OF SARMS (BENEFITS, SIDE EFFECT & HALF LIFE LISTED)\nSARMS\nDifferent Types of SARMs & What They Do\n\nTo help you navigate this article on SARMs types, we've included a table of contents linking to each section:\n\nWhats are SARMs?\nHow do SARMs work?\nList of SARMs and their uses\nAre SARMs Safe?\nAre SARMs Legal?\nOur Conclusion\n\n \n\nSARMs are an increasingly popular class of supplement for athletes and bodybuilders looking to improve their physiques and performance. There are a number of ifferent types of SARMs available, which is why we have put together this guide to give a better understanding of the differences between them!\n\n \n\nWhat are SARMs? (& \"SARMs\" meaning explained)\n\nSARMS, also known as Selective Androgen Receptor Modulators – what are they?\n\nThe androgen receptor (AR) is a member of the steroid hormone family, and plays an important role in the physiology of tissues. This receptor includes glucocorticoids, mineralocorticoid receptors, ER, PR and vitamin D3 receptor – key points for this article.\n\nThe AR ligands include circulating testosterone and local dihydrotestosterone which bind to AR to activate it. However there are limits to the metabolism and reactivity with other receptors to how effective the use of therapeutic steroidal androgens actually work.\n\nSARMS were discovered to “select tissue” receptors to promote their beneficial effects of androgens without the unwanted side effects.\n\nAndrogen receptors are found all over the body – muscle, bone, prostate, secondary sexual organs and seminal vesicles. But in bodybuilding terms, the only part that we really want to see effects of size, mass and strength on is the muscles.\n\nWhen any androgen cell is stimulated by testosterone this activates an enzyme called 5-a-reductase that converts testosterone into dihydrotestosterone (DHT) – an androgen hormone that is 10x more powerful than testosterone. Activation of the AR is achieved through binding of the DHT ligand to the binding point of AR, which then causes conformational changes and phosphorylation and final binding to the androgen responsive element (ARE). The ARE then modulates the transcription of the androgen responsive genes. If testosterone is too high an enzyme called aromatase converts testosterone into estrogen, which then exerts estrogen like effects in the cell. A small amount of this naturally occurs, as estrogen is needed in a man’s body as well as testosterone. But too much estrogen and this is when female like symptoms start to occur.\n\nUnder normal circumstances, the body carefully regulates its androgen production through feedback mechanisms to prevent imbalances. Taking any form of anabolic steroid, SARM or estrogen modulator disrupts this natural mechanism in a good or bad way.\n\nThe main androgen modulators that athletes used are found in the form of “anabolic steroids”. These are known to increase muscle mass, growth and strength.\n\nIt must be noted that testosterone is not classed as an anabolic steroid –as it is a naturally occurring hormone in the body. The problem with using anabolics, is the side effects (depending on the type used), however as long as someone trains well the use of anabolic steroids is highly effective. This is why SARMS were discovered, to find the positive effects of anabolic steroids, without the negative effects of the steroid.\n\nSARMs are nontoxic to the liver and have little effect on blood pressure. This eliminates the need for preloading and on-cycle support supplements. Subsequently, a SARM cycle will ultimately be less expensive than a traditional AAS/PH (steroid/prohormone) cycle. The chances of estrogen-related sides and water retention are significantly lower, as well. \n\nHow do SARMs Work?\n\nSARMs target androgen receptors in the body to exhibit their effects in the places we want them to - primarily muscle, but also increasing bone density. When the SARM binds to the androgen receptor, it tells the body to produce more testosterone, which can help bring about the results we strive for in physique and performance sports, such as increased lean mass, strength and recovery.\n\nWhich SARMs are not suppressive?\n\nIn theory, SARMs should not be suppressive, as you are not supplementing exogenous testosterone. It is not, however, always that clear cut, and SARMs users have reported issues from not conducting PCT after heavy cycles. We wouldn't like to say that there are 'non suppressive SARMs' as this does seem to be highly individual. Milder SARMs, like Andarine or Ostarine, at low to moderate doses, do appear to be less suppressive. Recovery from a SARMs cycle can often be done with over the counter supplements.\n\nWhich SARMs are least suppressive?\n\nTo avoid suppression, start with one of the milder SARMs previously mentioned at the lowest effective dose, and run for short cycles. 4 weeks should be enough to see results from your first cycle! Before increasing the dose or adding another SARM, look to enhance the effects with a non-hormonal supplement which works via another pathway, such as cardarine or ibutamoren. \n\nWhich are the most suppressive SARMs?\n\nThe most suppressive SARMs are the most potent ones, especially when they are run for very long cycles. The most powerful SARMs include YK-11, which we would suggest only for very advanced users.\n\nCan you take different SARMs together?\n\nYes! SARMs stacks are the logical way to progress your usage if you hit a plateau or are looking for something harder hitting. This also means that you can reap the rewards of two separate SARMs. For example, the highlight of one might be lean, dry gains, whereas the highlight of another might be enhanced recovery. Stacking SARMs should only be done with the correct guidance. \n\nWhat are the different types of SARMs? (Full list of SARMs & what they do)\n1. LGD 4033 (AKA Ligandrol)\n\n \n\nLGD 4033 a SARM like Ostarine but 12 times as powerful at only 1/3 the dose! Consequently it is more suppressive to the HPTA (Hypothalamus-Pituitary-Testes-Axis – the system of the hypothalamus, pituitary gland and gonadal glands, which plays a vital role in the development and regulation of the reproductive and immune systems). So, a SERM (selective estrogen receptor modulator) post cycle therapy is recommended.\n\nLGD 4033 Benefits\nWhere Ostarine is one of the best SARMs to include in a cutting cycle, LGD has proven itself as a good bulking agent.\n\nIn a study performed at Boston University, healthy men who were given 1mg of LGD daily gained about 3 pounds in 3 weeks on average. No clinically significant changes were noted in liver function tests, PSA (prostate issue/function tests), hematocrit (testing on the ratio of the volume of red blood cells to the total volume of blood) or ECG (electrocardiogram tests, used to check the heart's rhythm and electrical activity).\n\nLGD 4033 Side Effects\nGiven the potential for high estrogen side effects while using ligandrol UK, it is recommended that you buy anti estrogen supplement.\n\nLGD 4033 Half Life\nThe half life of LGD appears to be around 24 to 36 hours. This means that you can take your dose in one hit at the same time each day.\n\n2. MK 677 (AKA Ibutamoren)\n\nThis is a non-peptidic, orally active and selective agonist of the growth hormone secretagogue (secretion-boosting) receptor. It mimics the action of ghrelin (the hormone that regulates appetite and the distribution and rate of use of energy) in the stomach, raising growth hormone and IGF-1 levels, but does not affect cortisol levels.\n\nMK 677 Benefits\nHuman studies have shown it to increase both muscle mass and bone mineral density. Dosed at 25mg daily, Ibutamoren has been shown to increase IGF-1 levels by 60% in 6 weeks in humans. A 72% increase in IGF-1 levels was seen after 12 months.\n\nIbutamoren is non-hormonal and therefore requires no PCT after the cycle is over. It is best utilised in at least a 3 month cycle with dosage increasing each month. The optimal dosing time for MK 677 is at night directly before going to bed. You should start to notice a deeper sleep almost immediately. If you should wake up with numb or tingly hands, do not worry. This is a common side effect of the extra GH in the system.\n\nMK 677 Side Effects\nIncreased hunger\nLethargy\nImpaired insulin sensitivity\nWater retention\n\n \n\nMK 677 Half Life\nThe half life of MK 677 is around 24 hours. This means you can take once per day if you wish. Those who take it to increase appetite might take in a morning, but if it makes you lethargic, you might want to take before bed.\n\n3. GW 501516 (AKA Cardarine)\n\nCardarine is actually not a SARM. In fact it is a PPAR Delta Modulator – a selective agonist with a high affinity for the PPAR (peroxisome proliferator-activated receptors - a group of steroid- and thyroid-sensing proteins that control the expression of genes, thereby regulating cellular development and metabolism).\n\nGW 501516 Benefits\nThis modulation of PPAR allows the body to utilise more glucose and create more muscle tissue.\n\nCardarine supplements also regulate the various proteins that the body uses for energy. For the user, this means an increase in energy and endurance, and it may also mean an increase in muscle mass. It is also possible that GW might have a positive effect on blood pressure and lipid profile.\n\nDosing is in the 7mg to 21mg range, with 14mg being the \"sweet spot\". The average GW cycle is typically 4 to 12 weeks. GW is non-hormonal and therefore requires no PCT. However, it does work well in a SARMs stack to further increase fat loss and endurance.\n\nGW 501516 Side Effects\nRat studies have suggested potential risks to health with cardarine supplementation which have meant that human trials on the compound were halted.\n\nGW 501516 Half Life\nCardarine has a half life of about 24 hours.\n\n \n\n4. RAD 140 (AKA Testolone)\n\nRad 140 Benefits\nRadarine is very new, so there isn't a lot of real world data on it yet. However, it does look very promising, with an impressive anabolic to androgenic ratio of 90:1! This means that users can experience a wealth of muscle building effects without all the associated androgenic side effects.\n\nRAD is powerful enough to limit the effect of testosterone on the prostate and other unwanted areas. It has even been shown to be more anabolic than testosterone, as well. Dosing appears to be in the 4mg to 12mg range, with optimal cycle length being 4 to 6 weeks. Given its shorter half-life (16 hours), RAD needs to be dosed at least twice daily.\n\nRad 140 Side Effects\nSupression of testosterone.\n\nRad 140 Half Life\n15-20 hours.\n\n \n\n5. MK 2866 (AKA S22, Ostarine or Enobosarm)\n\nMK 2866 Benefits\nMK 2866 is probably the most well-known SARMs. It is best used to preserve muscle mass while in a caloric deficit.\n\nMK 2866 Side Effects\nOstarine mk-2866 can and will suppress your natural testosterone production in longer, higher dosed cycles, so a SERM PCT is needed. Ostarine can also cause gyno in some users, so it is recommended that you have an AI on hand. The average cycle length is 6 to 10 weeks at a dosage range of 10mg to 25mg.\n\nMK 2866 Half Life\nOstarine has a half life of around 24 hours.\n\n6. S4 (AKA Andarine)\n\nAndarine acts as a muscle builder akin to prohormones but with fewer androgenic side effects. It's milder, making it suitable for some women at low doses. When stacked with Cardarine, it supports fat loss and endurance.\n\nS4 Benefits\nIncreased muscle retention while dieting\nIncreased lean muscle mass\nCan be stacked\nOne of the better options for females\nIncreased bone strength\n\n \n\nS4 Side Effects\nA unique side effect of S4 is changes to vision. Andarine can cause a yellow tint to be seen over the eyes, especially at night. This can become develop after a couple of weeks of use once the molecule has bound to receptors in the eyes.\n\nS4 Half Life\nThe half life of S4 is only about 4 hours in humans, so it would be wise to split doses.\n\n \n\n7. YK-11\n\nYkareal is a potent compound often classified as a selective supplement, but it shares characteristics with more intense products. It's among the most powerful bodybuilding supplements, recommended strictly for advanced male athletes who have experience with similar products.\n\nYK-11 Benefits\nIncreased muscle mass\nStronger bones\nFast acting\n\n \n\nYK-11 Side Effects\nYK-11 side effects include joint pain, liver toxicity & increased aggression.\n\nYK-11 Half Life\nYK-11 half life has been suggested between 6 and 12 hours.\n\n \n\nAre SARMs safe?\n\nAre SARMS safe? Most of the SARMS that have been developed so far are sought to overcome the potential virilisation and/or aromitisatizing effects of steroidal androgens. This was achieved by searching for tissue selective agonists of the AR that could potentially active the AR in specific tissues whilst sparing others.\n\nThe SARMS currently developed are non-steroidal, which means they are not susceptible to the enzymatic metabolism of target tissues. Remember, there were certain enzymes that converted DHT into metabolites, or synthesised testosterone from the precursor androstenedione, SARMS are not affected by these enzymes. This means that the SARMS do not convert or break down into the unwanted molecules that cause side effects, like DHT and estrogen.\n\nThe anabolic-to-androgenic ratio of steroids is 1:1. That is, you get the muscle building the same effect as you may get man boobs for example. This is where SARMS can come into play. They are more selective in boosting the anabolic effects of muscle building rather than causing the androgenic side effects. This ratio can start as little as 3:1 or go as high as 10:1.\n\nSARMS are a group of synthetic drugs that mimic the effects of testosterone in muscle and bone with minimal impact on other organs and reduced side effects COMPARED to that of anabolic agents. The theory therefore is that you can have the perks of steroids without the side effects.\n\nAre SARMs legal?\n\nAll SARMS but RAD-140 are banned by The World Anti-Doping Agency (WADA) and most other global sporting organisations. Therefore if you are competing in a tested event or a sanctioned sort that specifically prohibits the use of anabolic agents, then SARMS aren’t for you. However if you are not planning to compete, then SARMS could be part of your daily routine, providing you only buy from a reputable company and do not sell them on.\n\nOur conclusion about the different kinds of SARMs\n\nThere are now a number of different SARMs on the market to suit different requirements. Have you tried SARMs? Would you choose any from this SARMs list over other measures like prohormones? Please share your experiences with us via Facebook. Alternatively, check out our other informative articles or shop our range of SARMs by following the links below.\n\nShop SARMs Here\n\nREGGIE JOHAL\nReggie Johal is the founder of Predator Nutrition and owes much of his extensive strength and fitness knowledge to his former career as a Great Britain American Footballer.\n\nRecommended Products\n\n(182)\nFusion supplements\nAndrotest\nFrom£84.98\n(196)\nRPN\nHavoc\nFrom£47.99\n(38)\nAugmented Labs\nIbutareal\nFrom£62.99\n(32)\nOlympus Labs\nLGD-4033/MK-677\nFrom£91.98\n(77)\nFusion supplements\nNano 1T\nFrom£71.99\n(18)\nOlympus Labs\nMK-677\nFrom£89.99\n(31)\nAugmented Labs\nCardareal\nFrom£59.99\n(55)\nIBE\nEpistane\nFrom£47.99\n(37)\nFusion supplements\nNanodrol\nFrom£67.98\n(19)\nAugmented Labs\nRadareal\nFrom£59.99",
  "contentLength": 15426,
  "url": "https://www.predatornutrition.com/articlesdetail?cid=types-of-sarms-and-their-benefits"
}