{
  "title": "Post Cycle Therapy (PCT) After a Prohormone Cycle",
  "content": "Home\nArticles\nNutrition\nTraining\nSupplements\nHealth\nMiscellaneous\nResearch Review\nPOST CYCLE THERAPY (PCT) AFTER A PROHORMONE CYCLE\nPCT\nIntroduction\n\nThe proliferation in the use of prohormones in the bodybuilding world has meant that trainees are able to acquire levels of muscularity and strength previously out of the reach of many. Prohormones have allowed even those with relatively deficient training and nutritional programs to make rapid gains. However, there has not been a concomitant awareness of the necessity to restore a homeostatic environment in the body, such that while many make rapid progress while using prohormones, many users experience a crash familiar to steroid users who use powerful ergogenics without the ancillary products needed to protect their gains. This article will cover strategies aimed at restoring normal hormonal function via the use of post cycle therapy, or PCT, supplements, with the aim of allowing trainees to maintain a greater proportion of the gains elicited by the use of prohormones.  \n\nHow prohormones work\n\nWithout going into too much detail, prohormone use will cause the body to recognise that an exogenous substance has been introduced into the body. With that substance being an androgenic hormone, a process called negative feedback takes place whereby the body will reduce its own production of testosterone, the naturally occurring androgen made in the body. This is to counteract the influence of the exogenous hormone that has been introduced. While the user is on his prohormone cycle he will not be too alarmed in most cases by the fall in his own natural testosterone levels because he is taking a substance which is working via similar mechanisms, to provide many of the anabolic functions of testosterone such as increased muscle mass and strength.\n\nAndrogenic functions of testosterone, related to characteristics we consider as being associated with males such as aggression, and sex drive, can either be magnified by the use of prohormone supplements, if the substance taken has these characteristics, or else, stay stable or possibly even fall. It is quite common for substances which are very “dry”, that is, lower estrogen in the body, to cause a reduction in sex drive whereas those compounds which allow for some estrogen formation, tend to increase the prevalence of androgenic traits such as sex drive and aggression.\n\nRegardless of whether the user takes something that increases androgenic characteristics or not, ALL users of prohormones will expect to increase muscle mass via the anabolic characteristics of these compounds. So towards the end of a typical 4-6 week cycle a user will have gained considerable muscle mass and strength via the anabolic actions of these products while his male traits such as sex drive, and aggression will have varied depending on the nature of the supplement taken. In most cases, the user will have congratulated himself that he has done very well from the cycle, assuming adequate nutrition and training. So what happens next?  \n\nShop Prohormones Here\n\nEnding a Prohormone cycle\n\nThis is where some users come unstuck. Inexperienced trainees tend to run a cycle of a powerful supplement like Nanodrol or Havoc, which will cause a great increase in muscle mass and strength, but not take into account what happens next.... Once the cycle ends you may think your body will carry on like it was before you took the hormonal product. You may even be delusional enough to think the gains made while “on” were all down to you, but you would be very wrong indeed. After a cycle is discontinued, the exogenous substance (the prohormones used) rapidly leave the body, usually in 24-48 hrs at the most. At this point, you can no longer rely on them for either anabolic or androgenic effects.\n\nSo this is where your body’s own testosterone production picks up the slack right? Wrong. Remember, during a cycle your body will gradually shut down production of its testosterone to try to maintain what it considers a normal hormonal milieu. The stronger the prohormone taken and the longer you remained on, the greater the degree to which normal testosterone levels will have been shut down. So when you come off the cycle your testosterone levels are very low. At the same time, estrogen levels tend to rise in response to low testosterone, so post cycle you are not in a very favourable place for muscle building and strength. Instead you are well placed to lose size, strength, gain fat, and, horror of horrors, if you do not take steps to counteract it, the estrogen could even cause you to gain actual breasts! This is known as gynecomastia, or gyno for short. That’s not all either. During a cycle, levels of the catabolic hormone cortisol are reduced, but once the cycle ends, levels of cortisol slowly rise, usually after about a week or so. This cortisol rise will cause you to lose muscle and strength very quickly, as well as cause you to gain body fat.\n\nClearly then, our novice user who failed to consider what would happen once he ended his cycle is in a very bad position of having low testosterone, high estrogen, and high cortisol levels. This is some place you definitely don’t want to be in for long, but without the use of ancillary supplements (PCT) it is something from which the body will only recover very slowly, at which point you may have lost all your gains from your prohormone cycle. What can we do to accelerate recovery then?\n\nWhat are prohormone PCT supplements?\n\nProhormone PCT supplements are over the counter supplements designed to restore normal, healthy levels of testosterone and oestrogen following a cycle. These help 'kickstart' endogenous testosterone production and control the conversion of testosterone to oestrogen to avoid any rebound and the related oestrogenic side effects.\n\nPost Cycle Therapy Supplements\n\nFortunately, we have some methods by which we can restore your body’s pre-cycle environment, while protecting your gains while “on”. Generally speaking for your post cycle therapy you need to consider the following factors:\n\n1. Testosterone recovery\n2. Estrogen inhibition\n3. Progesterone inhibition\n4. Reducing cortisol\n5. Increasing libido and mood\n6. Enhancing workout performance\n7. Restoring health\n8. Minimising fat gain\n9. Natural Anabolics\n\nSometimes trainees may focus on only one or two of these methods, but a comprehensive approach will lead to far superior results than a narrowly focused approach. We will go through each in turn and explore possible options in each.\n\n1. Testosterone Recovery\n\nThis is the most important part in most peoples’ eyes and the one that most people will usually make some effort in addressing. A slew of products/ingredients are promoted to boost testosterone levels. There are far too many to mention but they include Anacyclus Pyrethrum, D-Aspartic Acid, Divanil, Icariin, Indole-3-Carbinol, Zinc, Resveratrol, Vitex Agnus Castus, Epimedium, and many, many more. We have noted that individual responses to testosterone boosting ingredients vary significantly so we would recommend finding an ingredient you respond well to and sticking to it and note that just because one test booster did not work for you, it does not mean none of them will.\n\n An important point which should be made is that while estrogen blockers will both reduce estrogen AND increase testosterone, the reason you would want to include a supplement which purely focuses on testosterone enhancement alone is that such products can help in areas such as increasing bioavailable testosterone in the body (free testosterone) as well as providing much needed support to mood and libido.\n \n\nPopular Testosterone Boosters Include: \n\nActivate Xtreme, Progendarex, M-Test & Ashwaganda\n\n \n\nShop Testosterone Boosters Here\n\n2. Estrogen Inhibition\n\nRelated to testosterone recovery, we must also look to drive down estrogen levels at the conclusion of our prohormone cycle. The sooner this is done the faster we get our testosterone levels back to normal, and the sooner sex drive rebounds especially if we combine an estrogen blocker with a test booster which is the classic way to maximise testosterone, free testosterone, mood and libido, as well as limiting the potential for any unwanted estrogenic effects caused by the rebound effect seen at the end of a prohormone cycle.\n\nThis rebound effect can occur for example, when a non-aromatising prohormone is used on cycle meaning a compound that drives estrogen levels way down. However, once you remove the exogenous prohormone, the body has a tendency to overshoot estrogen production above baseline levels and if testosterone is also not recovered, this is a classic cause of post-cycle gynecomastia.\n\nA number of products have been specifically designed for the purpose of reducing estrogen, with some adding additional ingredients to facilitate other effects we desire such as not only increasing testosterone but variable such as controlling cortisol and bodyfat or increasing performance – all key facets of an intelligently constructed PCT regimen. \n\nFavoured ingredients include 7-hydroxy-4-imidazolyl-flavan, pZole , ATD, Formestane, 6-Bromo and Chrysin. \n\nPopular Estrogen Blockers Include:\n\nTriazole, Alchemy, Post Cycle Matrix & Arimistane\n\n \n\nShop Estrogen Blockers Here\n\n3. Progesterone Inhibition\n\nOccasionally you hear reports of users reporting issues with gyno from compounds that do not directly agonise the estrogen receptor such as methasterone (super-drol), 19-norandrostenediol or dienolone focused products in particular. In this situation the culprit is more than likely a related steroid hormone called progesterone. To inhibit progesterone during both the cycle itself and during post cycle therapy is therefore a wise move for people who wish to cover their bases during a prohormone cycle and afterwards. \n\nCompared to estrogen lowering ingredients there is a relative paucity of options for those seeking to control progesterone. The primary ingredients used to lower progesterone include the herb vitex agnus, Pyridoxal-5-Phosphate and mucuna pruriens in the product. This is one case where propietary blends are best avoided in our view as the dosing is very important. Fortunately, both of the options include all three ingredients and disclose the dose in each.\n\nPopular Progesterone Control Supplements:\n\nSerious Nutrition Solutions Inhibit-P\n \n4. Reducing Cortisol\n\nFailing to address rising cortisol levels post cycle can crucify training gains as well as help cause the fat gain typically seen post-cycle. Similar to the situation described for estrogen, it is important to understand that one of the ways prohormones exert their muscle building benefits is the reduction in cortisol and consequent enhancement of anti-catabolic processes. In short, as much as prohormones are anabolic (directly increase the rate at which new muscle is formed), they are also very much anti-catabolic (reduce the loss of muscle). By both reducing muscle loss and increasing muscle gain the net effect is obviously vastly superior muscle gains.\n\nUnfortunately, once you remove the prohormone from the equation there is a rapid rise in cortisol and this happens at a time when anabolic hormones such as testosterone (or similar androgens) are not only down from their peak on cycle, but below the baseline level they would be before you took the prohormone. This means you have a situation where you go from vastly inflated anabolic and anti-catabolic effects to one where anabolism is minimal and catabolic actions leading to muscle loss are very high.\n\nIf you ever wondered why so many prohormone users lose so much muscle so quickly at the end of their cycle then this is a clear consequence of failing to take action to remedy this type of situation.\n\nThe use of ingredients such as 5-AT, Phosphatidylserine, 7-OXO, Dehydroabietic Acid,  Vitamin C and Ashwagandha are commonly used to address the problem of high cortisol among many others with more ingredients being discovered all the time to help modulate cortisol.\n\nPopular Cortisol Control Supplements Include:\n\nLean Xtreme, Alchemy & Nolvadren XT\n\n \n\nShop Cortisol Control Supplements\n\n \n\n5. Increasing Libido and Mood\n\nLibido or sex drive may at first glance be considered more of a means to make yourself feel psychologically better post cycle. While there is an element of this, an increased libido is a sign that the body is working optimally and is a signal that a normal hormonal environment is likely to have been attained. Furthermore, libido is very tightly linked with mood and as such a key requirement of a post cycle therapy protocol as a lowered libido and mood is liable to cause trainees to make bad choices on their diet as well as being less likely to exercise. At the extreme end, some may choose to abuse recreational drugs such as cannabis or cocaine to help address some of the issues seen with libido and mood. Regardless of any temporary effects they may confer on libido and mood, these are disastrous choices during PCT with the former increasing estrogen and lowering testosterone while the latter is immensely catabolic and detrimental to both testosterone and other anabolic processes such as sleep.\n\nThe obvious conclusion many will draw is to simply take a testosterone booster described previously to address these issues but testosterone by itself is not sufficient to increase libido as can be seen in anabolic steroid users abusing testosterone for a long time who often find that they eventually experience diminished sexual desire and function.\n\nIndeed, the key element that a libido/mood focused supplement regimen should focus on is the neurotransmitter dopamine, which is released in limited quantities only naturally such as when you may eat some chocolate or have an orgasm but which can be boosted significantly if someone is using a drug such as cocaine and the reason why that drug has been used by some people as an aphrodisiac. Of course, cocaine is disastrous in many ways and can never be recommended to anyone under any circumstances but the point remains that by harnessing the power of dopamine, we are able to boost both libido and mood and make our post cycle therapy more productive.\n\nTo boost dopamine, we have a relatively limited amount of nutrients and unlike class A drugs like cocaine they work to produce sustainable increases in dopamine and as a further benefit, they can also enhance neurocognitive processes and act as neuroprotectants. While ingredients such as mucuna pruriens may have some promise as a way to boost dopamine, there is one standout ingredient in this category and that is 9-methyl-beta-carboline. Not only has it got clinical research supporting its efficacy in promotiong focus, memory, concentration, libido, respiratory efficency and mood, it also stimulates neuron and neurite growth as well as enhancing dopaminergic action. Best of all, this is not a stimulant at all so works better the longer it is used and both boosts cognitive and physical functions for the long run.\n\nExclusively manufactured by Hydrapharm, their 9-MBC product is the perfect choice to combat post-cycle blues in general. \n\nAs another option for users looking for alternative options, look for any testosterone boosting supplement that features mucuna pruriens or trans-resveratrol, both shown to support mood and libido while Bulgarian sourced tribulus terrestris has a huge amount of empirical and clinical evidence supporting its libido boosting properties (although it is commonly marketed as a testosterone booster, it is nowadays becoming accepted that it is essentially a mood and libido booster which exerts its effects via dopaminergic pathways).\n\nPopular Products for Mood and Libido Support Include:\n\nActivate Xtreme, 9-MBC & Ashwagandha\n\n \n\nShop Mood Boosting Supplements\n\n \n6. Enhancing Workout Performance\n\nAthletes will to a varying degree accept the need for the management of the hormones and neurotransmitters described previously but arguably the biggest and most misunderstood determinant of how much muscle you maintain after a cycle is nothing to do with hormonal status but instead the degree to which your muscles are subjected to forces that encourage them to maintain their newly acquired size.\n\nThink about this logically. We lift weights to gain muscle and the more our strength goes up the more we gain all other things being equal. Our article on optimising prohormone cycles goes into more depth on the various overlooked dietary and training considerations when running a prohormone cycle but suffice it to say that most people train in a way on cycle that is not conducive at all to maintaining their strength and muscle mass during post cycle therapy.\n\nA big factor in keeping muscle gains is to try your best to keep your weights up post-cycle, or, if at all possible, even try to increase your strength post-cycle, as strength is a powerful signal to the body telling it to maintain muscle mass. We have discussed the dietary and training strategies in the article described above but there are also a variety of supplemental approaches which can be deployed to improve strength either through the use of ergogenics compounds such as creatine, beta-alanine, or the use of preworkouts based around stimulants and nootropics that help to increase strength. I\n\nIf using stimulant based preworkouts, it is advised to not use them while using prohormones as they are best used when they have not been used for some time as your tolerance to them is so low even a small amount will provide a huge boost to strength – possibly enough to meet or even beat the strength feats you achieved without stimulants while on a prohormone cycle. \n\nPopular Ergogenics Include: \n\nPredator Nutrition Pure Creatine, Cell-Tech Creatine & Hydrapharm Plasma \n\n \n\nPopular Preworkouts to Boost Performance Include:\n\nHydrazine, Frenzy & MusclePharm Assault\n\n \n\nWe can pretty much guarantee that if a user of a prohormone omits to take any stimulants at all during their cycle and then runs any of these for one month after their cycle, they should be able to maintain or even exceed their strength which, providing it is accompanied by a reduction in training volume (to take into account diminished recovery ability during PCT) is an excellent way to maintain most or all of their gains.\n\nShop Preworkouts Here\n\n7. Restoring Health\n\nThis should be an obvious one really but it is something that too many trainees omit. During a prohormone cycle you will place extra strain on your body systems so it is important to restore optimal health as rapidly as possible. Apart from the obvious, this will help your body to help retain muscle gains since a healthy body is one which will recover sooner. You should also take these products whilst on cycle, particularly if using a methylated prohormone. A host of ingredients such as minerals/vitamins, fish oils, adaptogens such as Ginseng and Rhodiola Rosea, liver support substances such as TUDCA and Milk Thistle can be employed to restore health. \n\nPopular Health Supplements Include: \n\nTUDCA Elite, Organ Shield & N2Generate\n\n \n\nShop Cycle Support Supplements\n\n \n\nThe focus when selecting a cycle support or post cycle support product should be to pay attention to liver support as the priority if you are using a methylated prohormone. Otherwise, an all-purpose product which supports blood lipids, the cardiovascular system and so on is a smart choice especially if it also takes into account elements such as estrogen control.\n\n \n\n8. Minimising Fat Gain\n\nNobody wants to gain loads of muscle only to get fat after their prohormone cycle is over. At the same time it is not advised to rely too much on stimulants to prevent fat gain as we could end up eating too little, or, by releasing too many catecholamines (adrenealine like hormones), actually cause increased stress levels which is the last thing we want post cycle. Besides, stimulants should be used sparingly to maintain/increase strength before workouts not used every day. \n\nTherefore, if you are using such products, it would be best to spare them for your most intense workout sessions. It is important to remember that we are trying to limit fat gain, but not go on a diet or starve ourselves (which will rapidly lead us to lose all our muscle gains given both the calorific deficit and negative hormonal environment during PCT). \n\nIt is better to employ ingredients which can limit fat gain, causing some fat loss without any of the problems of overuse of stimulants. As such staple ingredients should include the likes of 7-hydroxy-4-imidazolyl-flavan, Forskolin,  7-OXO, Maslinic Acid, Ursolic Acid, Ecklonia Cava, Berberine and even fish oils all of which can help enhance body composition but without causing negative effects on muscle mass. Notably, none of these ingredients is a stimulant nor will they adversely impact on appetite. By coupling them with a high protein diet you are doing all you can do to avoid the typical post cycle fat gain.\n\nPopular Choices of Supplement to Prevent Fat Gain:\n\nHydrapharm Myogenesis, Elixir & Lean Xtreme\n\n \n\nIf looking for something that is speficially a fat burner then from the above you can select Lean Xtreme. This is a supplement that will reduce cortisol levels (which are rather high after a cycle) and optimise your testosterone levels, which is exactly what you should aiming for. On the top of that it is non-stimulating fat burner, which makes it easy to be stacked with pretty much any other supplement.  \n\nOnce you are a few weeks into your PCT you can consider other more targeted fat burners as at this point you are at a point of likely hormonal equilibrium so can afford to take a more aggressive approach to fat loss.\n\nPopular Hardcore Fat Burners:\n\nHydrapharm Hydralean & Fusion Supplements Rocket Fuel\n\n \n\nShop Fat Burners\n\n9. Natural Anabolics\n\nIn the past few years there have been several innovative formulas hitting the market which increase the rate of protein synthesis compared to baseline levels. Given that during PCT your body’s rate of protein accretion is sub-normal the use of such supplements is highly recommended as they provide another dimension to a PCT program by not relying on simply restorating the body’s hormone levels to normal. \n\nPopular Natural Anabolics:\n\nAdamantine, Phosphatidic Acid, Myogenesis & Molecular Nutrition X-Factor\n\n \n\nTherotetically, you could take any of the above in combination to further enhance gains and of course even for non-prohormone users, a stack of these especially if combined with a testosterone booster and estrogen blocker is about as good as it gets when it comes to natural muscle building stacks.\n\nShop Muscle Builders\n\nAn optimum post cycle therapy program\n\nOkay, so now that you have a good grasp of the various supplements available you will no doubt be feeling you had better go rob a bank. Not necessarily. In terms of supplementing during the post cycle period it is possible to narrow some of the above down to a smaller number of supplements which can then be used to promote recovery during the post cycle period. We would encourage prohormone users to carefully study each compound they are using or considering to use so as to determine the best PCT for themselves as depending on factors ranging from if the prohormone is methylated, whether it aromatises, its degree of androgenicity. How suppressive it is, the length of cycle, and potential scope for adverse effects on progesterone and blood lipids to name just a few considerations, it will require a different strategy for each use case.\n\nThat said, the recommendations below will cover 99% of cases so anyone wanting something simple and easy to follow can elect to go with the following. A reminder we described the following as all of the elements to consider during PCT.\n\n1. Testosterone recovery\n2. Estrogen inhibition\n3. Progesterone inhibition\n4. Reducing cortisol\n5. Increasing libido and mood\n6. Enhancing workout performance\n7. Restoring health\n8. Minimising fat gain\n9. Natural Anabolics\n\nYour Primary Goal is to Maintain Muscle Mass and Strength\n\nThe key factors from the list of variables for you to focus on is:\n\n•    Testosterone support\n•    Estrogen inhibition\n•    Reducing cortisol\n•    Enhancing workout performance\n•    Maximising non-hormonally mediated anabolic processes   \n\nYou could theoretically choose an all purpose-supplement such as Nolvadren XT and Alchemy to cover testosterone/estrogen and cortisol factors. Add to that any of the recommended preworkouts and natural anabolics and you are pretty much set although we highly recommend not skimping on some of the other factors especially if they apply to you (such as needing a health supplement if using a methylated prohormone or a progesterone inhibiting one if you intend to use something that has the potential to increase progesterone levels).\n\nYour Primary Goal is to Maintain Your Bodyfat Percentage\n\n•    Estrogen inhibition\n•    Reducing cortisol\n•    Minimising fat gain\n•    Enhancing workout performance\n•    Maximising non-hormonally mediated anabolic processes   \n\nAs you can see we have swapped in a supplement class intended to prevent fat gain where we have provided various choices in the section devoted to it. This is in place of one whose focus is boosting testosterone. This is very much a compromise but one which can be made if money is an issue and we must remember that an estrogen blocker is capable of still boosting testosterone.\n\nYour Primary Goal is Optimal Health\n\n•    Testosterone recovery\n•    Estrogen inhibition\n•    Progesterone inhibition (or Cortisol Control if progesterone is not relevant)\n•    Increasing libido and mood\n•    Restoring health\n\nFor a prohormone user who is happy to accept a little trade-off in muscle loss and fat gain and who instead is seeking to get as healthy as possible, feel as good as possible, energised without stimulants and with a healthy libido then the priorities are the factors above.\n\nIt should not matter too much to someone in this group what they select for the first three options but Hydrapharm’s 9-MBC is a standout product for increasing libido and mood while for restoring health, we highly recommend a comprehensive solution with TUDCA a must if you have used a methylated prohormone.\n\nOther Supplements Not Discussed\n\nAdditional supplements are always being released which can help to maximise anabolic processes and the various options suggested are not intended to be exhaustive but to instead reflect both the quality of the ingredients in the products and the feedback seen from users who have used them.\n\nSimilarly, amino acid and protein supplements and the use of nutrients which can boost androgen receptor status such as LCLT are not specifically listed in this article but should nevertheless be considered an essential part of your supplementation regime.\n\nConclusion\n\nWe hope this article has helped you to understand that through proper planning and supplementation, the risks of prohormones use can be mediated via the intelligent use of appropriate ancillary supplements, whose use can help users maintain the gains made using prohormones, while accelerating recovery of optimal body function.  To really get the best out of your prohormone cycles and in turn your PCT it is highly recommended you read this article in conjunction with the optimising prohormone cycles as the two together comprise the best possible way to maximise your results and mitigate any potential downsides inherent in the use of prohormones.\n\nShop Prohormones Here\n\nSAVANNAH WESTERBY\nSavannah is part of the team here at Predator. Her qualifications include a degree in Sport and Exercise Nutrition alongside a background working in the supplement industry. She has also been an active bikini competitor since 2016.\n\nRecommended Products\n\n(182)\nFusion supplements\nAndrotest\nFrom£84.98\n(196)\nRPN\nHavoc\nFrom£47.99\n(38)\nAugmented Labs\nIbutareal\nFrom£62.99\n(32)\nOlympus Labs\nLGD-4033/MK-677\nFrom£91.98\n(77)\nFusion supplements\nNano 1T\nFrom£71.99\n(18)\nOlympus Labs\nMK-677\nFrom£89.99\n(31)\nAugmented Labs\nCardareal\nFrom£59.99\n(55)\nIBE\nEpistane\nFrom£47.99\n(37)\nFusion supplements\nNanodrol\nFrom£67.98\n(19)\nAugmented Labs\nRadareal\nFrom£59.99",
  "contentLength": 28278,
  "url": "https://www.predatornutrition.com/articlesdetail?cid=post-cycle-therapy-pct-after-a-prohormone-cycle"
}