{
  "slug": "hrv-variabilite-frequence-cardiaque-guide",
  "title": "Heart rate variability (HRV): What's normal - and how to increase it",
  "content": "## Highlights\n\n- Heart rate variability is the difference in intervals between each heartbeat. A greater variability means your body is well prepared for performance.\n- While there are some general trends in what a good HRV is, it's highly individual.\n- Good sleep and recovery boost HRV, but it can be lowered by stress, intense exercise, illness, or alcohol.\n- Try to look at HRV over extended periods for a true picture of your health and wellness, and build healthy habits to keep HRV high\n\n## What is HRV?\n\nHeart rate is the number of times your heart beats per minute. Heart rate variability (HRV) measures the tiny differences in time between each heartbeat, in milliseconds. Even at a steady heart rate, such as 60 beats per minute, the exact interval between beats can vary slightly.\n\nOne gap might be 1.0 seconds, the next 1.1 seconds. That's heart rate variability. This variability reflects how well your autonomic nervous system is adapting to stress.\n\nA larger variability from your baseline generally indicates that your body is recovered and well prepared for sudden changes in heart rate. A low HRV means your body is showing signs of stress. That could mean it's fighting an illness, is struggling to recover from a tough workout, or that life is taking its toll. And that could mean you might not perform at your best.\n\n## The science behind HRV\n\nEvery function in the body, including heart activity, is regulated by the nervous system. At the centre of this is the autonomic nervous system (ANS), which controls involuntary processes like heart rate, blood pressure, breathing, digestion, and sexual arousal.\n\nThe ANS communicates with the heart via the sinoatrial (SA) node, the heart's natural pacemaker. That enables it to ramp up your heart rate within seconds, such as during exercise, when your body needs more oxygen fast.\n\nThe ANS has two branches working in opposition:\n\n- The **sympathetic nervous system**, which drives the \"fight-or-flight\" response by increasing heart rate and blood pressure.\n- The **parasympathetic nervous system**, which promotes \"rest and digest\" via the vagus nerve, and slows the heart and aids recovery.\n\nHeart rate variability (HRV) reflects the constant push-pull between these two systems.\n\nWhen the \"flight or fight\" sympathetic system dominates, HRV drops. When the \"rest and digest\" parasympathetic system kicks in HRV rises. This dynamic balance is what allows your heart to adapt to physical and emotional demands.\n\n## What's a 'good' HRV?\n\nHRV values are personal, and while there are general trends that match age and fitness, comparing HRV is only useful against an individual's established baseline.\n\nStrictly speaking, there is no specific ideal HRV. What may be considered an ideal HRV for you may not be true for someone else. A person's gender, age, genetics, lifestyle choices, fitness level, and even their environment can affect their HRV.\n\nBut there are some general rules of thumb:\n\n- People in their mid-twenties usually have an average HRV in the range of 55-105\n- People in their sixties and seventies have an average HRV in the range of 25-45.\n- Males often tend to have slightly higher HRV on average than females.\n- Women's HRV rises and falls naturally during the menstrual cycle.\n\nGenerally, athletes have superior HRV, although many people in great shape have an HRV average. This all points to the fact that HRV is highly individualistic. Daily tracking, understanding what's normal for your body, and at changes over long periods is the only way to use HRV.\n\n## What affects HRV?\n\nGreat sleep, good recovery, and high levels of fitness are solid reasons behind a good HRV. But dips in HRV can be linked to a range of reasons. They include:\n\n- Illness\n- Stress\n- Over-training\n- Phases of the menstrual cycle\n- Alcohol and diet\n- Dehydration\n- Heat\n- Heart disease/chronic disease\n- Mental health\n\nThe limitation of HRV is that while it's an excellent indicator that something is stressing your body, it can't help determine exactly what that problem is. That's where a holistic look at our health is required to make informed decisions.\n\nSometimes the answer to low overnight HRV is obvious. Lifestyle choices can show a dramatic overnight drop in HRV. Studies have shown that \"drinking alcohol can lower HRV by an average of 22 milliseconds the following day.\"\n\nBut if HRV has dropped over a longer period, then the reasons might be less obvious.\n\nUsing wearables, such as the Ultrahuman Ring AIR, enable you to look at HRV over weeks and months, which will enable a better understanding of your health. Signals such as resting heart rate, sleep, and stress can help point you in the right direction to reverse the trend.\n\n## How to use HRV to improve recovery, sleep, and focus\n\n### Good sleep and wind down\n\nYou can improve HRV in the short term by getting a good night's sleep and improving the quality of your sleep with a strong wind-down routine. Avoid eating late to digest food 3+ hours before bed. Alcohol is also an HRV killer.\n\n### Cold exposure\n\nExposing the body to low temperatures for a short duration (cold showers, ice baths, etc.) stimulates the vagus nerve, which triggers the parasympathetic branch of your ANS and controls HRV.\n\n### Mindfulness\n\nA study showed that \"participants who engaged in mindfulness practice for 5 minutes regularly for 10 days enjoyed better HRV.\" Resonant breathing or coherent breathing refers to breathing at a pace of 5 full breaths per minute. Breathing at this rate has been shown to increase HRV and reduce stress.\n\nBut if your HRV has been trending down over an extended period, and there's no obvious lifestyle reason, then you might need to take a look at the bigger picture. You should check other biomarkers, such as resting heart rate, as similar rises could be a sign that something is wrong. If that's the case, it's worth speaking to your doctor.\n\n## Conclusion\n\nHeart rate variability (HRV) is a key biomarker that offers insight into how well prepared our bodies are to perform. Good HRV is a sign your body is rested for peak performance, but low HRV can point to a need to recover.\n\nHRV is highly personalised and sensitive to our lifestyle, environment, and choices. But tracking HRV over months - and maintaining or improving HRV - is more revealing about our health and wellbeing.",
  "sourceUrl": "https://blog.ultrahuman.com/blog/heart-rate-variability-hrv-the-ultimate-guide-for-your-health-and-fitness/",
  "category": "stress",
  "originalChars": 6847
}
