{
  "slug": "age-metabolique-guide-complet",
  "title": "What is metabolic age? Understand and improve this key health metric",
  "content": "## Highlights\n\n- Metabolic age has emerged as a marker of your metabolic health.\n- Your body burns energy at rest, and this is known as your Basal Metabolic Rate (BMR). This is higher among healthy individuals with good muscle mass.\n- Metabolic age is calculated by comparing your Basal Metabolic Rate (BMR) to the average of your chronological age group.\n\n---\n\n## What is metabolism?\n\nMetabolism refers to all the chemical reactions in your body that convert food into energy and maintain life. These processes include breaking down nutrients to fuel movement, breathing, and digestion (catabolism), as well as building and repairing tissues (anabolism).\n\n---\n\n## What is metabolic health?\n\nMetabolic health means having ideal levels of blood sugar, triglycerides, HDL cholesterol, blood pressure, and waist circumference without relying on medications. It's a marker of how efficiently your body manages energy and maintains internal balance.\n\n---\n\n## Metabolism 101: How our bodies use energy\n\nMetabolism is the sum of all the chemical processes your body uses to convert food into energy and sustain life. It's driven by two opposing systems: **catabolism**, which breaks food down to release energy, and **anabolism**, which uses that energy to build and repair the body.\n\n**Catabolism** breaks down carbohydrates, fats, and proteins from food into usable energy. This fuels everything from muscle movement to brain function.\n\n**Anabolism**, its opposite, uses that energy to support growth, tissue repair, and maintenance, like building muscle or healing wounds.\n\nYour **total energy expenditure** — the calories you burn in a day — comes from four key areas:\n\n1. **Basal Metabolic Rate (BMR)** is the energy your body uses at rest to keep vital functions running, like your heart beating or brain working. It accounts for 60–80% of your daily energy use and is influenced by factors like age, sex, body size, and muscle mass.\n\n2. **Thermic Effect of Food (TEF)** is the energy required for the digestion, absorption, and disposal of what we eat and drink. TEF makes up 10% of our daily energy use.\n\n3. **Activity Energy Expenditure (AEE)** includes all energy expended by movement. That includes workouts, everyday tasks like walking, cleaning, or even fidgeting. This is the most variable part, making up 20–50% of your energy use.\n\n4. **Sleeping Metabolic Rate (SMR)** is the energy you burn during sleep. Energy use increases in the second half of the night, especially during REM sleep, when brain activity and glucose metabolism ramp up.\n\n---\n\n## What is metabolic age?\n\n**Metabolic age** is a comparison between your **Basal Metabolic Rate (BMR)** and the average BMR of people in your age group. BMR is the number of calories your body burns at rest to maintain essential functions like breathing, circulation, and cell repair.\n\nIf your metabolic age is **higher** than your actual age, it suggests your metabolism is slower than average — often due to low muscle mass, poor fitness, or suboptimal body composition.\n\nIncreased exercise will build healthy muscle tissue, which in turn will improve your metabolic age. That's because muscle burns more energy than fat. In real terms, that means someone who has a high level of muscle mass will burn more calories sitting at their desk than someone with a lower muscle mass.\n\nSo the fitter, healthier, and stronger you are, the lower your metabolic age will be. If your metabolic age is lower than your actual age, it means your body is in good shape.\n\nSome adults can have the metabolic age of a 15-year-old or lower, which means their body is top of the class at burning calories.\n\n---\n\n## How to calculate your basal metabolic rate (BMR)\n\nTo estimate your BMR, you can use the **Harris-Benedict Equation**, which factors in your sex, age, height, and weight. Here's how to do it:\n\n### For Men:\n\nBMR = 88.362 + (13.397 × weight in kg) + (4.799 × height in cm) – (5.677 × age in years)\n\n### For Women:\n\nBMR = 447.593 + (9.247 × weight in kg) + (3.098 × height in cm) – (4.330 × age in years)\n\n### Example: (Female, 65 kg, 165 cm tall, 35 years old):\n\n**BMR = 447.593 + (9.247 × 65) + (3.098 × 165) – (4.330 × 35)**\n**= 447.593 + 600.055 + 511.17 – 151.55**\n**= ~1,407 kcal/day**\n\nThis means she burns roughly 1,407 calories a day doing absolutely nothing — just by staying alive.\n\nNow, consider **metabolic age**. It compares your BMR to the average BMR of people your age. If your calculated BMR is higher than average for your age group, your metabolic age is _lower_ — suggesting a more efficient metabolism.\n\nWhile comparing BMR is not easy, some rough examples based on average BMI and heights are below:\n\n| Sex | Age Group | Average Age Used | Assumed Height (cm) | Assumed Weight (kg) | Estimated BMR (kcal/day) |\n|-----|-----------|------------------|---------------------|---------------------|---------------------------|\n| Male | 18–25 | 21 | 175 | 72 | 1714 |\n| Male | 26–35 | 30 | 175 | 72 | 1669 |\n| Male | 36–45 | 40 | 175 | 72 | 1619 |\n| Male | 46–55 | 50 | 175 | 72 | 1569 |\n| Male | 56–65 | 60 | 175 | 72 | 1519 |\n| Male | 66–75 | 70 | 175 | 72 | 1469 |\n| Female | 18–25 | 21 | 165 | 62 | 1385 |\n| Female | 26–35 | 30 | 165 | 62 | 1340 |\n| Female | 36–45 | 40 | 165 | 62 | 1290 |\n| Female | 46–55 | 50 | 165 | 62 | 1240 |\n| Female | 56–65 | 60 | 165 | 62 | 1190 |\n| Female | 66–75 | 70 | 165 | 62 | 1140 |\n\nIf your BMR score is lower than average, then your metabolic age is _higher_ — possibly indicating a slower metabolism, often linked to low muscle mass or higher body fat.\n\nWhile it's not a medical measure, your metabolic age can be a useful indicator of how your body is performing behind the scenes — and whether there's room to improve your metabolic health.\n\nIt's an important indicator of how hardworking your metabolism is. It also steps away from using your 'real age', or the number on traditional weighing scales, to define your fitness. Your metabolic age shifts the focus away from weight and focuses more on your body's structure, or composition, of muscle and fat.\n\n---\n\n## Metabolic age and metabolic syndrome\n\nMetabolic syndrome is a cluster of conditions that occur together, increasing your risk of heart disease, stroke, and type 2 diabetes. These conditions include increased blood pressure, high blood sugar, excess body fat around the waist, and abnormal cholesterol or triglyceride levels.\n\nHaving just one of these conditions doesn't mean you have metabolic syndrome. But it does mean you have a greater risk of serious disease. And if you develop more of these conditions, your risk of complications, such as type 2 diabetes and heart disease, rises even higher. A consistently high metabolic age can be one precursor to metabolic syndrome.\n\n---\n\n## How can you improve your metabolic age?\n\n### 1. Eat more protein\n\nYour body burns more calories by digesting protein-rich foods than fat-rich foods, which means eating more protein can help fight an ageing metabolism. A simple way to do this is to make sure you have a source of protein in every meal.\n\nA study showed that individuals with a younger relative metabolic age consumed significantly more grains, lauric acid, meat alternatives, a greater percentage of calories from polyunsaturated fatty acids, and were inclined towards consumption of greater amounts of vegetable protein.\n\n### 2. Build muscle mass\n\nMuscle mass has a huge impact on your metabolism, so strength and resistance training can help to speed it up and also burn more calories in the process. As you get older and your metabolism slows down, strength training to improve muscle mass can ensure your metabolic age stays as low as possible.\n\n### 3. Sleep\n\nStudies have shown that poor sleep can slow down your basal metabolic rate (BMR) – the number of calories your body burns at rest. Studies show that even short-term sleep loss can reduce energy expenditure and impair insulin sensitivity, making it harder for the body to process glucose efficiently.\n\n### 4. Drink more cold water\n\nPeople who drink water instead of sugary drinks are more successful at losing weight and keeping it off. Studies have shown that drinking 17 ounces (0.5 litres) of water increases resting metabolism by 10–30% for about an hour. This calorie-burning effect may be even greater if you drink cold water, as your body uses energy to heat it up to body temperature.\n\n### 5. Drink Green Tea or Oolong Tea\n\nGreen tea and oolong tea have been shown to increase metabolism by 4–5%. These teas help convert some of the fat stored in your body into free fatty acids, which may increase fat burning by 10–17%. As they are low in calories, drinking these teas may be good for both weight loss and weight maintenance.\n\n---\n\n## Conclusion\n\nYour metabolic age is based on what's called your Basal Metabolic Rate – often known as just BMR, compared to the average BMR of someone of the same age.\n\nYour BMR tells you how many calories your body burns while resting, and it's a good gauge of your efficiency in burning the calories you consume. Your metabolic age is your BMR compared to others in your age group.\n\nIf your metabolic age is lower than your chronological age, that's probably a good sign. If it's higher, you may want to take a look at your dietary habits and exercise routine.\n\nThere are ways to improve your metabolic age, which involve protein consumption, good sleep, drinking cold water, and green or oolong tea.\n\n---\n\n_Disclaimer: The contents of this article are for general information and educational purposes only. It neither provides any medical advice nor intends to substitute professional medical opinion on the treatment, diagnosis, prevention or alleviation of any disease, disorder or disability. Always consult with your doctor or qualified healthcare professional about your health condition and/or concerns and before undertaking a new health care regimen including making any dietary or lifestyle changes._\n\n---\n\n**Author:** Hisham Syed\n**Published:** May 28, 2025\n**Last Modified:** June 13, 2025\n**Word Count:** 1,647\n**Article Categories:** Longevity, Metabolic Health",
  "sourceUrl": "https://blog.ultrahuman.com/blog/what-is-metabolic-age-and-how-to-improve-it/",
  "category": "metabolisme",
  "originalChars": 9847
}
